[
    {
        "title": "35 days to go for HoR elections: EC to use Nepal-made election materials",
        "tag": null,
        "content": "KATHMANDU: The Election Commission has adopted a policy of using locally produced materials as much as possible for the elections to the House of Representatives slated for March 5.\nTo make the election economical, transparent and to use and encourage local products, the Commission has adopted a policy of using locally produced materials as much as possible.\nA total of 51 materials will be used for the elections and currently 37 types of materials are being procured from the provinces and districts in a decentralized manner, shared the Commission’s spokesperson Narayan Prasad Bhattarai.\nAmong them, 14 types of materials are being procured from the central level and the responsibility for most of the purchases has been given to Salt Trading Company. He said that only new materials worth Rs 67.5 million have been procured for the elections and other materials have been reused.",
        "url": "https://english.nepalpress.com/2026/01/29/35-days-to-go-for-hor-elections-ec-to-use-nepal-made-election-materials/",
        "scraped_at": "2026-01-30T16:42:50.490049"
    },
    {
        "title": "“Topsoil protection should be the main focus to protect Nepal’s erodible landscapes and lead the country toward a sustainable agricultural path”",
        "tag": null,
        "content": "KATHMANDU:In an exclusive interview with Dr. Suresh Sharma, Nepal Press shares some thoughts on Nepalese agriculture and its future. Dr. Sharma is a leading expert in the field of sustainable and regenerative agriculture, as well as regional planning. Dr. Sharma has a Ph.D. in Natural Resources and Environmental Sciences from the University of Illinois at Urbana-Champaign, U.S.A. His doctoral study primarily focused on adopting sustainable agricultural practices by farming communities using socio-psychological behavioral theories and mixed research methods. He also holds two master’s degrees, one in Regional Development Planning from the prestigious SPRING program jointly offered by the University of Dortmund, Germany & University of the Philippines, Quezon City, and the other in Anthropology from Tribhuvan University (T.U.), Nepal. Having also acquired his primary bachelor’s degree in agriculture from T. U. Rampur campus in Chitwan, with nearly two decades of experience serving at a senior position in the Nepalese Government at various capacities in the Department of Agriculture and its wings, Dr. Sharma has some rich perspectives and ideas to share on Nepalese farming that could be beneficial to our nationwide readers, policymakers, and people abroad.\nExcerpts:\nBased on your rich experience working with the farming communities of Nepal spanning two decades, and serving as a senior extension official in the Department of Agriculture in the past, where do you think the problem lies when it comes to making agriculture a sustainable source of livelihood and income for Nepalese farmers?\nAgriculture has stood as the backbone of Nepalese economy for decades, still contributing almost one-fourth chunk of its GDP, however Nepalese farmers for the most part have hardly got the opportunity to rise above the subsistence level, when it comes to diversifying their income from agriculture. At least 80% of Nepal’s 19.5 million farming population are still bordering the poverty line and struggling to make their ends meet from agriculture. These farming communities are constantly faced with the challenge of reconciling their economic needs with farming as their principal source of income and livelihood support on the one hand, while protecting the productive capacity of their farmlands, on the other. These farmers need a clear roadmap of farming practices that they need to undertake which could not only support their farming occupation and livelihoods in the long term, but also safeguards their farmland against major environmental stressors such as the unfolding climate change crisis and unpredictable weather patterns posing considerable risks to subsistence-based farming. Nepalese farmers are often confronted to cope with prolonged droughts in some regions of the country, while navigating their lives with unforeseen precipitation in other parts, often resulting in flash floods and landslides, a major contributor of farmland degradation arising from topsoil loss and erosion.\nNepal have consistently lacked in bridging the polices and implementation gap over the years with regards to production increment of major cereal crops such as rice, wheat and maize including other cash crops, while protecting the environment, farmers’ wellbeing, and human health at the same time. The main problem in Nepalese agriculture lies in prioritizing resources to address the symptoms of the problems without addressing its underlying cause. I believe that agriculture in Nepal could reach to newer heights if we start to focus on the right polices and actions based on our rich ecological niche, varying climatic zones, and align human and financial resources accordingly to uplift the farming population with economic opportunities and technological access. However, at this point, it seems that the government and its partners are misguided over several decades by focusing resources and efforts in production and productivity enhancement of cereals, cash crops, and vegetables through forcibly carving a one-size-fits-all “commercialization of agriculture” bandwagon, through over-reliance and dependency on imported commercial fertilizers and pesticides. Such an approach to food production and poverty reduction has not served us well in the past, and therefore needs to change for the better.\n\nI think it would be more prudent to convey message to the farming communities in first prioritizing the protection of topsoil and conservation of its agricultural biodiversity through the widescale adoption of regenerative and sustainable farming practices applying time-tested agro-ecological principles. I firmly believe adoption of such an approach will yield sustainable and rewarding results in the long term. To accomplish this, the government and its partners need to provide farmers with the resources, tools, and needed support through grants, subsidies, and training along this direction. Although government policy documents hinted at striving to reach food self-sufficiency for its people, I seriously doubt this coveted goal could be achieved in the foreseeable future without first addressing the topsoil loss from erosion, and agrobiodiversity issue, which unfortunately are on a declining trend in Nepalese farming context.\nWhy conservation of topsoil is important in the context of Nepalese agriculture?Can you elaborate further?\nGeologically, Nepal’s landmass is crafted and shaped from the constant collision of the tectonic plates underneath the Himalayas and is relatively young, as per scientific studies. As such, the topography of Nepal is a fragile landscape with mountains, hills, and terai cascading and overlapping in regions with varying relief features and climatic niches. Only one-fifth of the landmass of Nepal is arable land, capable of supporting farming. The rest of the country’s landmass comprised of sloping lands with rivers, valleys, gorges, and steep mountainous terrain. Since farmland is a scarce resource in Nepal, with average agricultural landholding of only 0.55 hectares, therefore, protection of this limited cultivable land is vital for ensuring food security for its 29.6 million population growing annually at 1.7%. Being a fragile and sloping topography especially in the Mid-hills and Churia (Siwalik) range, where agriculture is practiced by rural communities as the main source of livelihood support, Nepal’s farmland in this region is often prone to severe topsoil loss from erosion and landslides especially during the monsoon season.\nAccording to one recent study, Nepal is losing topsoil at an exceedingly high rate ranging from 11.2 tons per hectare up to 64 tons per hectare. When topsoil is lost at such an alarming rate, the capacity of the land to produce food and fiber for supporting people’s livelihood is compromised both in the short and long term. This is because topsoil is rich in organic matter, which often takes decades and centuries to form under the natural process and is the very essence of life-support system that provides resilience and sustainability to farmlands. Furthermore, the topsoil that is eroded from the hilly and mountainous region carrying huge amounts of silt and clay during the monsoon overwhelms the river system and farmlands in terai causing inundation, loss of crop production from sedimentation deposits, and displacement of farm families. On top of that, loss of lives and property from landslides and soil erosion is a regular phenomenon repeating every year in Nepal. Such natural calamities impose a significant burden on the national treasury in managing reparations, damages, and losses. It is evident that all these issues and problems are interconnected. Therefore, conservation of topsoil is critical for Nepal from the perspective of the country’s food security, protection of its rich agrobiodiversity, and building socio-economic resilience.\nCan you throw some light regarding agrobiodiversity decline in general and the case of Nepal in particular? How did this happen, and what should be done to address such an issue?\nAgrobiodiversity is the richness of genetic diversity of crops, seeds, and species of edible plants and other living organisms in a geographic region that are harbored by nature through generations following the natural selection process. Most of the plant agrobiodiversity available in nature comprises of different genus and species of crops and their cultivars that are open-pollinated. In other words, farmers can save the seeds of these open-pollinated crops for the next growing season. Agrobiodiversity decline occurs from multiple factors that includes both natural and anthropogenic. In the Nepalese context, when topsoil is lost through erosion or agricultural lands are converted into human settlements, which is already happening since the last several decades due to rapid urban sprawl in the country, a lot of the agrobiodiversity that was inherent within those landscapes is also lost in the process. Simultaneously, when farmers start to relinquish their open-pollinated crop cultivars and begin cultivating hybrid varieties on their farmlands for a few generations, then agrobiodiversity loss occurs rapidly. This happens because open-pollinated crops start to lose their viability to procreate if their seeds are not planted by farmers for a few years.\nThe practice of widescale monocropping with the advent of modern industrial farming, especially in developed countries, and subsequent upscaling of such monocultural practices in our part of the world, has also resulted in a significant loss of agrobiodiversity from farmlands. Once agrobiodiversity is lost from nature, it is gone forever. As per one recent study, out of 24,300 total species of agricultural genetic resources available in Nepal, the country has lost close to 40% of those species so far, and the trend of agrobiodiversity loss is worsening every year.\nNepal is not the only country that is facing the agrobiodiversity crisis, it is a global phenomenon, posing some dire consequences for the human species and the planet’s future. The best way to minimize or halt agrobiodiversity loss is through seed savings and conservation of genetic diversity by individual farmers and groups through farm diversification and by establishment of community seed banks. The government initiated National seed bank, for instance the one currently existing in Kathmandu valley under the management of National Agricultural Research Council, should be the last resort of hope toward seed conservation, because the cost of maintaining such a facility in terms of manpower, energy requirement, and resources is huge. Nevertheless, Nepal needs at least a couple of such seed banks in times of emergency. However, at this point, farmers and citizens awareness and actions toward promoting community seed banks is therefore the least costly and viable option for safeguarding against agrobiodiversity loss both in the case of Nepal and globally for ensuring food security for the current and future generations.\nWhat types of currently adopted agricultural practices and other development trends in Nepal are detrimental to safeguarding its long-term agricultural sustainability?\nWe have seen farming communities in Nepal growing annual crops like corn and millet even in sloping lands without proper terracing, resulting in a heavy loss of topsoil from erosion and landslides every year. The phenomena of topsoil loss are very much visible in sloping terraces especially after the heavy monsoon rains. This has resulted in degradation of farming landscapes with severe decline in soil productivity and its functionality over the years. The government needs to carve policies and actions that prohibit annual crop farming in high sloping lands while providing subsidies and motivating farmers to grow perennial grasses, forages, fodders, fruit trees, and shrubs as well as a combination of various conservation practices in steep and semi-steep slopes. Adoption of such a policy would result in protection of vulnerable and erodible landscapes, especially in the Mid- and High-hill regions against soil erosion and landslides, following heavy downpour especially in the monsoon season.\nAnother disturbing trend often observed in Nepal is the rapid conversion of its prime agricultural land into urban settlements and towns without consideration of its inherent land use potential and the capacity of such lands to support agricultural production and food security both in the long and short term. For example, as reported in one recent research study published in 2023, about 25% of the agricultural land in Kathmandu valley had been converted to urban settlements during the 10-year period from 2011-2021. Such development trend is often short-sighted and could result in unpredictability in food supply and long-term scarcity of food for the rapidly growing country’s population. Since Nepal is already a heavy importer of grains, pulses and other essential food commodities from its neighbors like India, China and other food exporters, what we have witnessed over several decades is that Nepal is reeling under an ever-increasing import-export imbalance and trade deficit. As such, it has become a moral imperative for Nepal to protect its prime agricultural land in the form of a regulated and sustainable land use policy to ensure its food security.\nWhat broad policy recommendations do you have for the Government of Nepal to make Nepalese agriculture sustainable and resilient?\nSome broad policy changes I would suggest for Nepal is to divest resources from commercial fertilizers and chemical pesticides importation and instead invest it in sustainable and regenerative agriculture both at the farm and landscape level. The government should provide substantial resources and technical support to the farming communities for motivating them in adopting a sustainable agricultural pathway. Given the vulnerability of its population already facing food insecurity especially in the remote regions, the widely used catchphrase “commercialization of agriculture” in the Nepalese context, may have been sending the wrong message to the farming communities. Farmers may connote this message to simply boost food production by adopting all available means of production, even though they are unsustainable. The main goal of a sustainable agricultural system should not be to only boost food production and sell it in the market for short-term economic return. Nepal must instead make every effort to train farmers and community members to produce food locally by building soil health and conserving its limited land resources to reach food self-sufficiency, without relying on synthetic fertilizers and agrochemicals. Research and efforts by farming communities from around the world have shown that reaching food self-sufficiency is not a distant dream if regenerative agricultural practices are adopted with a land conservation and stewardship mindset.\nFurthermore, Nepal urgently needs to curb unregulated infiltration of banned pesticides and agro-chemicals from its porous southern border. This could be achieved by strictly regulating its Plant Quarantine check posts at border points while revamping its monitoring and supervision capacities. Raising increased awareness among the farming communities and providing them the tools and resources needed in adopting sustainable practices on their farms is another viable way to tackle this issue in the long-term.\nAlongside, Nepal should massively invest its resources and efforts in regreening barren landscapes and degraded farmlands with afforestation by applying time-tested agroforestry principles and techniques. The end-goal should be to create a functional agricultural landscape and food forest where nature, people and biodiversity thrive together in perpetuity.\n",
        "url": "https://english.nepalpress.com/2024/09/12/topsoil-protection-should-be-the-main-focus-to-protect-nepals-erodible-landscapes-and-lead-the-country-toward-a-sustainable-agricultural-path/",
        "scraped_at": "2026-01-30T16:42:51.119537"
    }
]