[
    {
        "title": "Vehicles gifted by India for the election (Photos)",
        "tag": "Politics",
        "content": "Kathmandu, January 27\n\nFor the election of members of the House of Representatives scheduled for Falgun 21, the Government of India has gifted 61 vehicles to the Government of Nepal. The Indian Embassy handed over the cabin pickup vans to the Nepal government during a program held at Singha Durbar on Magh 6. The vehicles are currently parked in front of the Ministry of Home Affairs at Singha Durbar.\n\nThe Ministry of Home Affairs had requested vehicles from the Government of India through the Ministry of Finance as material assistance for election purposes. Under the proposal, India has provided 61 vehicles as a gift to the Nepal government in the first phase.\n\nFor this election, the Government of India is reported to be providing a total of 538 vehicles of various sizes. As the vehicles have been registered in the name of the Government of Nepal, the government will be able to use them as needed after the election.\n\nThe Government of India has been providing assistance to the Government of Nepal, including vehicles and other election equipment, to help conduct elections.",
        "url": "https://english.onlinekhabar.com/vehicles-gifted-by-india-for-the-election-photos.html",
        "scraped_at": "2026-01-27T20:30:22.974922"
    },
    {
        "title": "Nepal’s silent health crisis: Chronic sleep deprivation",
        "tag": "Blog",
        "content": "In Nepal, lack of sleep is rarely treated as a health concern. It is often worn like a badge of discipline or sacrifice. Students stay up late preparing for exams. Shift workers push through long nights. Parents juggle jobs, households, and family responsibilities with little rest.\n\nWhen exhaustion shows up, it is usually dismissed with a familiar phrase: this is just life. The brain, however, does not see it that way.\n\nNeuroscience offers a different perspective. Sleep is not a luxury or a reward for finishing work; it is a biological requirement. Without adequate sleep, the brain cannot function, adapt, or repair itself properly. When sleep is disrupted night after night, the consequences go far beyond feeling tired. They shape how we think, regulate emotions, store memories, and protect ourselves from disease.\n\nDuring sleep, the brain performs some of its most critical tasks. Neural connections formed during the day are reorganised, strengthening useful information while clearing unnecessary signals. This is how learning stabilises and memories take shape. Sleep also allows the brain to flush out metabolic waste that accumulates during waking hours. When sleep is repeatedly cut short, these processes remain incomplete, leaving the brain insufficiently reset for the next day.\n\nThese findings are no longer limited to laboratories. They are reflected in Nepal’s own data.A 2024 studyof medical students and health-care professionals found that more than one-third had poor sleep quality, while nearly two-thirds experienced excessive daytime sleepiness. These are future doctors and nurses, expected to make critical decisions for others. Their exhaustion highlights how deeply sleep deprivation has been normalised, even within the health system.\n\nResearch consistently shows that even modest sleep loss dulls attention, slows reaction time, and weakens judgment. Over time, chronic sleep deprivation alters brain regions responsible for emotional control and decision-making. This helps explain why sleep-deprived individuals often feel irritable, anxious, or emotionally overwhelmed. These are not signs of weakness or poor character; they are predictable biological responses to insufficient rest.\n\nFor children and adolescents, the consequences are even more serious. A school-based study in Kathmandu reported that more than 60 per cent of early adolescents had poor sleep quality, strongly linked to heavy social media use and lower academic performance.\n\nAdolescence is a critical period for brain development. Persistent sleep disruption during these years interferes with memory formation, emotional regulation, and the development of self-control, with effects that can last into adulthood.\n\nSleep deprivation is also closely connected to physical health. Studies in Nepal have shown strong associations between sleep problems and overweight and obesity among adolescents, alongside poor diet and low physical activity.\n\nOver time, these patterns increase the risk of diabetes, heart disease, and other chronic conditions. Sleep is not separate from public health; it sits at its centre.\n\nMultiple factors contribute to widespread sleep loss in Nepal. Academic pressure pushes students to trade rest for achievement. Urban noise, traffic, and crowded housing make uninterrupted sleep difficult. Shift work in transportation, health care, security, and manufacturing forces the brain to work against its natural rhythms. Late-night smartphone use exposes the brain to artificial light, delaying melatonin, the hormone that signals it is time to sleep.\n\nDespite these risks, sleep remains poorly addressed within the health-care system. Studies indicate that many health professionals receive little formal training on sleep and feel unprepared to identify or manage sleep problems, particularly in children. When sleep is overlooked at the institutional level, it remains invisible in everyday care.\n\nTreating sleep deprivation as a public health issue does not require expensive technology or specialised clinics. Many solutions are simple and affordable. Schools can promote realistic study schedules and teach students how sleep supports learning. Employers can recognise the cognitive costs of long shifts and irregular hours. Urban planning that reduces noise and improves housing conditions can protect sleep at the community level. Public dialogue can help dismantle the belief that exhaustion equals productivity.\n\nAt the individual level, small habits matter. Maintaining consistent sleep and wake times, limiting screen use before bed, and spending time in natural daylight during the morning can help stabilise the brain’s internal clock. These are not indulgent choices; they are acts of care for the brain.\n\nNepal has begun to recognise mental health as a public health priority. Sleep deserves the same attention. A society that runs on chronic exhaustion places an invisible burden on its people, its productivity, and its future.\n\nSleep is not a waste of time. It is time the brain uses to prepare for the next day. Treating sleep deprivation as a public health issue is not about comfort; it is about protecting the cognitive and emotional foundation of the nation.\n\n",
        "url": "https://english.onlinekhabar.com/nepals-silent-health-crisis-chronic-sleep-deprivation.html",
        "scraped_at": "2026-01-27T20:30:28.410191"
    },
    {
        "title": "18 new members elected to National Assembly",
        "tag": "Politics",
        "content": "Eighteen new faces have been elected to the National Assembly, including a mix of experienced leaders, first-time parliamentarians, youth, and representatives from inclusive groups.\n\nElections were held on Sunday for 18 of the 19 seats whose terms are set to expire on Falgun 20. The Nepali Congress, CPN-UML, and Loktantrik Samajwadi Party (LSP) contested the election in alliance, while the Nepal Communist Party contested independently. Candidates backed by the alliance emerged victorious.\n\nMembers of provincial assemblies and chiefs and deputy chiefs of local governments serve as voters in National Assembly elections. Across all seven provinces, there are 550 provincial assembly members. Among local levels, there are 1,506 voters, including mayors, chairpersons, and their deputies from 753 local units. The term of the newly elected National Assembly members will begin on 21 Falgun.\n\nSeveral of those elected on Sunday have previously served in the House of Representatives, while others are completely new to parliamentary politics.\n\nThose elected to the National Assembly who have previously served as members of the House of Representatives include Mahanta Thakur, Ram Kumari Jhakri, Sunil Bahadur Thapa, and Lalit Jung Shahi.\n\nEighty-three-year-old Mahanta Thakur, elected from Madhesh Province, was a member of the dissolved House of Representatives. A multiple-time lower house lawmaker, he has entered the National Assembly in the later phase of his political career.\n\nThakur entered parliamentary politics in 1991 after winning the election from Sarlahi Constituency No. 5 as a Nepali Congress candidate and later served as deputy speaker. He won again from Sarlahi in the 1994 mid-term election. He lost in the 2008 election but became a lawmaker through cabinet nomination. He was defeated again in 2013 but won elections from Mahottari-3 in 2017 and 2022. This time, he has moved from the House of Representatives to the National Assembly.\n\nRam Kumari Jhakri, elected from Lumbini Province, is also a former member of the House of Representatives. She was elected under the proportional representation system in 2017 but lost the 2022 election. She has now been elected to the National Assembly.\n\nBorn on May 10, 1978, in Gulmi, Jhakri rose to prominence through student politics under ANNFSU.\n\nFrom Karnali Province, Lalit Jung Shahi is a former Constituent Assembly member. Born on November 15, 1955, he is a resident of Chandannath Municipality-5, Khalanga, Jumla.\n\nInfluenced by the ideology of BP Koirala, Shahi has been active in politics for decades. He unsuccessfully contested the first Constituent Assembly election in 2008 as a rebel candidate against his own party’s nominee but remained in the party. He was elected from Jumla in the second Constituent Assembly election in 2013 and played a role in drafting the Constitution of Nepal 2015. He lost the 2022 provincial assembly election but has now been elected to the National Assembly. After his election, Shahi pledged to help bring the constitution back on track, saying it had deviated from its intended course.\n\nSunil Bahadur Thapa, elected unopposed to the National Assembly from Koshi Province, is the son of former prime minister Surya Bahadur Thapa.\n\nThe 66-year-old has prior experience as a federal lawmaker and minister. He was directly elected to the Constituent Assembly from Dhankuta-2 in 2013 as a Rastriya Prajatantra Party candidate. In May 2017, he served as Minister for Commerce and Supplies in Prime Minister Sher Bahadur Deuba’s cabinet.\n\nHowever, the last two House of Representatives elections were unsuccessful for Thapa. He lost the 2017 and 2022 elections from Dhankuta to UML’s Rajendra Kumar Rai. He left RPP in 2020 and joined the Nepali Congress, later becoming a central committee member through the party’s 14th general convention. From Chaitra 2079 BS to Chaitra 2082 BS, he served as chief political adviser to President Ram Chandra Paudel.\n\nThapa was elected unopposed after his main rival, Nepal Communist Party candidate Hemraj Ghimire, failed to reach the election officer’s office on time during nomination registration on Poush 23.\n\nBorn on April 13, 1959, in Pakhribas, Dhankuta, Thapa previously worked in various countries under the United Nations. He entered active politics after resigning from his post at the UN High Commissioner for Refugees in Sudan.\n\nAnother National Assembly member elected from Koshi Province is Roshni Meche, who represents the marginalised Meche community.\n\nRosani defeated Nepal Communist Party candidate Namita Nyaupane in Sunday’s election. With her victory, the door has opened for her to take the lead in shaping federal policies related to marginalised communities.\n\nThe Meche community, which resides in areas including Mechinagar, Birtamod, Haldibari, and Kachankawal in Jhapa, currently receives a monthly social security allowance of Rs 4,000. Rosani’s election is considered a moment of pride for the community.\n\nShe previously worked at the secretariat of then prime minister KP Sharma Oli. A resident of Mechinagar-12, Jhapa, Rosani entered politics through the UML-affiliated Democratic Indigenous Nationalities Federation. She holds a master’s degree in sociology and a bachelor’s degree in law. Over the next six years, she plans to raise the voices of marginalised and minority communities in the federal parliament.\n\nApart from Mahanta Thakur, three others have been elected to the National Assembly from Madhesh Province: Dharmendra Paswan and Ranjit Karn of the Nepali Congress, and Rekha Jha of CPN-UML.\n\nDharmendra Paswan is a Dalit rights activist known for raising his voice against discrimination, injustice, and exclusion. The 54-year-old leader from Rautahat is regarded as disciplined, people-oriented, and living a simple lifestyle. He studied political science up to the bachelor’s level and has experience working with various non-governmental organisations. He has also served as general secretary of the Dalit Association and has pledged to work for the economic and social development of the Dalit community during his tenure.\n\nRanjit Karn is a former central president of the Nepal Students’ Union. A resident of Rajbiraj, he has been active in the Nepali Congress since his student days and was elected under the minority quota from Madhesh Province.\n\nRekha Jha of CPN-UML has also been elected to the National Assembly from Madhesh.\n\nNewly elected member Som Portal says he will raise youth-related issues in the National Assembly. Elected from Koshi Province under the Dalit cluster, Portal said he would advocate for both Dalit concerns and youth issues, as mandated by his party.\n\nHe noted that the National Assembly was previously viewed mainly as a chamber to honour senior and experienced leaders, but stressed the need for meaningful youth participation. Portal began his political journey at the ward committee level and worked through local, district, and provincial responsibilities before reaching the National Assembly.\n\nBorn in Falgun 2035 BS, Portal has experience in local governance and development and served as chair of the Jhapa District Coordination Committee from 2017 to 2022.\n\nFrom Bagmati Province, Geeta Devkota of the Nepali Congress and Dr Prem Dangal of CPN-UML have been elected. Dangal, a UML central committee member, is a resident of Gokarneshwar-5, Kathmandu. He has worked in various roles within ANNFSU and party committees and previously served as chair of the All Nepal Peasants’ Federation. He has led regional farmers’ organisations and authored several books on food sovereignty, neoliberalism, climate change, sustainable development, and the Nepali farmers’ movement.\n\nDevkota, born in 1971, has been active in politics since 1987 through the Nepal Students’ Union. She was elected a central committee member of the Nepali Congress at its 14th general convention and currently serves as vice-chair of the Beekeepers Farmers Federation.\n\nFrom Gandaki Province, Jagat Timilsina of the Nepali Congress and Smriti Devkota of CPN-UML have been elected.\n\nTimilsina was a lecturer at Tribhuvan University’s management faculty and has served as president of the Congress-affiliated Democratic Professors’ Association since 2016. A resident of Shuklagandaki-7, Tanahun, he had not previously held a party post.\n\nSmriti Devkota entered the National Assembly after losing three consecutive elections. She had contested the 2017 local election as a UML candidate for deputy mayor of Gorkha Municipality and the 2022 mayoral election from the same municipality, but lost both. She was again nominated for the National Assembly election in 2024 and has now succeeded.\n\nFrom Lumbini Province, Vasudev Jangali and Chandra Bahadur KC of the Nepali Congress have been elected. Jangali hails from Dang, while KC is from Gulmi.\n\nFrom Karnali Province, Lalit Jung Shahi of the Nepali Congress and Mina Rakhal of CPN-UML have been elected. Rakhal, a resident of Dailekh, was a proportional representation member of the Karnali Provincial Assembly in 2017 and later became a UML central committee member through the party’s 11th general convention.\n\nFrom Sudurpaschim Province, Khamba Bahadur Khati of the Nepali Congress and Leela Bhandari of CPN-UML have been elected. Khati is a former general secretary of the Nepal Bar Association and a former attorney general, while Bhandari is a leader with a Maoist background.\n\n",
        "url": "https://english.onlinekhabar.com/18-new-members-elected-to-national-assembly.html",
        "scraped_at": "2026-01-27T20:30:34.121581"
    },
    {
        "title": "PM Karki insists development works should not affect religious beliefs, cultural heritages",
        "tag": "Politics",
        "content": "Kathmandu, January 27\n\nPrime Minister Sushila Karki has emphasised that religious beliefs and cultural heritages should not be affected while carrying out development construction, including road infrastructure.\n\nIn the course of inspectingthe  Kathmandu-Tarai/Madhes fast track, the national pride project, today, the Prime Minister directed the bodies concerned to find a solution after taking the concerns of locals seriously.\n\nShe mentioned, “The concerns of the locals should be taken seriously, and a solution should be found for them. The demarcation along the section, as well as the zero point, should also be changed if needed. We should forward development construction without hurting their faith.”\n\nThe Prime Minister also suggested making arrangement of necessary vacant places while constructing physical structures. “Open space is needed during a natural disaster. It is also required for people’s movement, festivals, fairs, and gatherings. Therefore, we should abandon the idea of building any structure after seeing an open space. We should plan and build a structure by leaving open space,” she argued.\n\nThe Prime Minister’s team comprises the Minister for Physical Infrastructure and Transport, the Minister for Foreign Affairs and the secretaries of different ministries, among other officials. Previously, Chief of the Army Staff Ashok Raj Sigdel and project chief Major General Dharmendra Jha had informed Prime Minister Karki about the project’s progress so far and related challenges.\n\nThere was a slight delay in starting the project as the detailed project report (DPR) of this road under construction under the management of the Nepali Army took time to be approved. The physical progress of the expressway project, which has a total length of 70.977 km, has currently reached around 45 per cent.\n\nUnder the expressway, more than 87 bridges will need to be constructed. Among them, some are of a specific type and up to 82 metres tall. As these bridges have also reached the final stage of construction, the Army has stated that the project will be completed within the scheduled date of Chaitra-end 2083 BS and within the initial estimated cost of Rs 213 billion.\n\nThis will be a short-distance highway connecting Kathmandu Valley directly with the central Tarai region. After the construction of the expressway, it is expected that transportation of goods from the Tarai to Kathmandu will significantly reduce costs and time, and contribute considerably to the country’s economic development.\n\nThere are seven tunnels under the project. The Army has stated that it is making special efforts to accomplish the tasks according to the project’s objectives.",
        "url": "https://english.onlinekhabar.com/pm-karki-insists-development-works-should-not-affect-religious-beliefs-cultural-heritages.html",
        "scraped_at": "2026-01-27T20:30:38.319505"
    },
    {
        "title": "Gold price hits Rs 309,000 per tola",
        "tag": "Economy",
        "content": "Kathmandu, January 27\n\nThe gold and silver prices have set new records in the local market today. The Federation of Nepal Gold and Silver Dealers’ Association has fixed the price of hallmark gold at Rs 309,000 per tola, while the price of silver at Rs 6,870 per tola today.\n\nThe foreign media have stated that the gold per ounce is traded at 5,073 US dollars, while a similar amount of silver is traded at 109 US dollars in the international market today.",
        "url": "https://english.onlinekhabar.com/gold-price-hits-rs-309-thousand-per-tola.html",
        "scraped_at": "2026-01-27T20:30:45.735431"
    },
    {
        "title": "Meet Sharda Kumari Paudel, first female principal of Nepal’s oldest school",
        "tag": "Editor's Pick",
        "content": "Following an intensely complex political period, Nepal this year appointed its first woman prime minister, a historic milestone. While the appointment of Sushila Karki as the country’s first female prime minister has drawn global attention, another appointment within Nepal has received far less discussion despite its significance.Durbar High School, also known as Bhanu Secondary School, the first school in Nepal, has appointed its first female principal, 172 years after its establishment.\n\nOn November 20, Sharda Kumari Paudel was appointed principal of Durbar High School. Previously, she had been serving as the school’s acting principal.\n\nBeing promoted from acting principal to principal, Paudel says she now feels more confident, responsible, and challenged.\n\nShe was appointed through an open competition among three contenders, in which she was the only female candidate.\n\nEstablished in 1854, Durbar High School took a long time to appoint a female principal. In this context, Paudel notes that in the past, women rarely entered the teaching profession, and those who did were mostly limited to teaching at the primary level.\n\n“Women in the past were confined to family life due to societal structures, which limited the time they could devote to their professional development,” says Paudel. “As a result, it took a long time for women in almost every sector to reach higher positions, and Durbar High School is no exception.”\n\nHowever, Paudel considers herself fortunate, as it was her father who inspired her to become a teacher and pursue a career in the profession.\n\n“My father always motivated me to serve society, and as a result, I chose to become a teacher,” she says.\n\nBorn in Syangja in western Nepal, Paudel joined the teaching profession in 2004. Her first posting was at Mahendra Rastriya Secondary School in Baluwatar, where she taught health education for 10 years. In 2014, she joined Durbar High School as a permanent secondary-level teacher, teaching economics.\n\nIn 2019, she was appointed assistant principal of the school. At that time, Durbar High School had only 71 students. In 2020, at the height of the COVID-19 pandemic, she was appointed principal with limited responsibilities. Under her leadership, the school began conducting virtual classes. Despite the challenges, the school also focused on strengthening extracurricular activities. It organised a national essay competition on the impact of COVID-19 and established a robotics lab.\n\nDurbar High School became the first government school in Nepal to introduce robotics classes. Students from the robotics program went on to win several competitions and participate in international events outside Nepal. Meanwhile, the school, severely damaged by the devastating 2015 earthquake, completed its renovation. In collaboration with Kathmandu Metropolitan City, smart boards were also installed in classrooms. After physical classes resumed, the number of students increased to 350.\n\nAs the quality of education improved, Durbar High School began attracting public attention. Even parents who had been sending their children to private schools started enrolling them at Durbar High School, one of the rarest shifts seen in Nepal’s education sector.\n\nSimilarly, under Paudel’s leadership, the school’s canteen and security systems improved. Currently, the school has 1,095 students. Managing such a large number of students has become one of Paudel’s major challenges as principal.\n\nThe challenge is compounded by the fact that Sanskrit Secondary School, which has around 900 students, is also operating within the Durbar High School building.\n\n“As two different institutions run in the same building, conflicts sometimes arise among students and teachers, and in such cases I have to be especially sensitive,” says Paudel.\n\nDue to overcrowding, the school is compelled to run tiffin breaks multiple times, which often causes disturbances. Efforts are underway to address this challenge, she adds.\n\nWhile the number of students continues to grow each year, the school’s resources remain limited. However, with support from guardians, the school has managed to recruit additional staff.\n\nTo prevent a shortage of teachers, the school has recently introduced the concept of a “Teachers Bank.” The Teachers Bank serves as a backup pool of teachers. For instance, if a teacher is unable to attend classes for a week or longer, the school can reach out to teachers listed in the Teachers Bank. The school has also publicly advertised this initiative and invited interested individuals to join. As a result, Paudel has received many inquiries and has been personally handling the process.\n\nPaudel’s tenure as principal will be four years. Speaking toOnlinekhabar, she shared the plans she hopes to accomplish during her term.\n\nHer priority is to strengthen the school’s technological capacity so that students become more technologically skilled. Second, she plans to introduce more optional subjects. She also aims to prioritise sports. Lastly, she intends to improve students’ public speaking skills and further enhance the quality of the robotics program.\n\n“My goal is to make Durbar High School a place where students are confident, skilled, and ready to compete anywhere, not just in exams, but in life,” says Paudel.",
        "url": "https://english.onlinekhabar.com/principal-sharada-kumari-paudel.html",
        "scraped_at": "2026-01-27T20:30:50.302016"
    },
    {
        "title": "Fearless and unbound Nepali youth make historic wheelchair bungee jump",
        "tag": "Editor's Pick",
        "content": "Dilip Sapkota of Chautara Sangachokgadhi Municipality–5, Sindhupalchok and Shishir Dahal of Kamalamai–5, Sindhuli, completed a wheelchair bungee jump from the suspension bridge over the Bhotekoshi River in Sindhupalchok.\n\nThey claim this bungee jump, said to be the first of its kind in Nepal, is historic. Sapkota asserts that he is the first person in Nepal’s history to do a bungee jump in a wheelchair.\n\nAmong the two, Sapkota jumped first from the 160-meter-high suspension bridge, and Dahal successfully followed soon after.\n\n“It was a historic leap, for the first time in Nepal, I did a bungee jump from a wheelchair,” Sapkota says with excitement. “These activities are not just displays of personal courage. I want accessible tourism to grow in Nepal, and I want people with disabilities to participate equally in hiking, trekking, and adventure activities. That’s why I keep taking part in new and challenging adventures, hoping my experience will inspire confidence, motivation, and courage in others with disabilities.”\n\nDahal shares a similar experience. He toldOnlinekhabarthat the bungee jump was an enjoyable and memorable experience.\n\n“I wanted to experience it for myself. But I also wanted my attempt to inspire others, which is why I jumped along with my wheelchair,” Dahal says. “The bridge shook slightly, but the moment above the river,  being the first to bungee in a wheelchair was unforgettable.”\n\nShishir added, “I had done such adventure activities before, but this time I wanted to inspire others with disabilities and hopefully shift society’s perception of people with disabilities, which is why I did the bungee in a wheelchair.”\n\nAfter suffering a spinal injury that left him bedridden and unable to move for a long time, Sapkota now travels on a disability-friendly scooter and wheelchair, becoming a strong voice for thousands of people with disabilities.\n\nSapkota has been participating in paragliding, zipline, swing, and other adventure activities for a long time.\n\nHe is not only an adventure enthusiast but also a committed advocate for inclusive tourism. Despite his disability, he serves as the secretary of the Jugal Tourism Promotion and Environment Conservation Forum Nepal, continuously lobbying for accessible tourism. He believes that making trails, routes, and services in Nepal’s tourism sector accessible for people with disabilities must now be a mandatory agenda.\n\nDahal, who joined Sapkota in the bungee jump, has been living with spinal paralysis due to a motorcycle accident.\n\nHe has been using a wheelchair for four years. Dahal runs an agricultural nursery in Bhaktapur. Alongside the nursery, he also works as a graphic designer and social media manager, and holds leadership roles in various sports and entertainment-related organizations.",
        "url": "https://english.onlinekhabar.com/wheelchair-bungee-jump.html",
        "scraped_at": "2026-01-27T20:30:54.828484"
    },
    {
        "title": "Know what are yomaris and learn how to cook them on your own",
        "tag": "Food & beverage",
        "content": "Considered one of the signature dishes of theNewa community, yomari is arguably a local invention that is both sweet and healthy. On the full moon day of Thinlaa: (the second month of Nepal Sambat) or Marga Shukla Paksha, the Newa community celebrates Yomari Punhi, where primarily the households make yomari of various shapes and sizes. The day is also celebrated asJyapuDiwas or Dhanya Purnima. Meanwhile, the Kirant community celebrates it as Udhauli.\n\nIt is said yomari was first made by a Newa couple working in the field of Panauti. Since rice was the prime harvest, the couple decided to use the harvest and make yomari out of it. Also, since it was winter, they filled it withchaku(molasses) to increase body heat. As a part of the community, the couple also shared their harvest and yomari with the neighbours.\n\nThe signature shape of the yomari is also said to resemble the fig.\n\nAnother story is of Chhinnapatta Maiju and yomari, but this yomari is about the fig. According to a cultural expert and retired Nepal Bhasa professor at Tribhuvan University, Chunda Bajracharya, “In this folklore, we hear the story about two sisters. The elder is Chhinnapatta Maiju, who was disliked by her mother. She had a goat as her friend. Her mother killed her beloved goat and Chhinnapatta took the bones out and buried them in the ground. It is said a fig tree grew out of there and she used to spend more time there.”\n\nShe continues, “One day when she was up in the tree, lakhe and lasi: (a demon couple) came there and tricked her into bringing the fig down to them. Chinnapatta got kidnapped and then was taken to their abode. The demon couple directed her to make roti (flatbread) for them. While in the kitchen, a mouse came to Chinnapatta and asked for roti. The mouse, in return for the roti, warned her that the demon couple were planning to eat her, so she better run with all the jewels they had stored. Chinnapatta Maiju adhered to it and went home with the jewels.”\n\n“Seeing her coming back with the jewels, the mother questioned her on what happened. After Chinnapatta briefed them, the mother directed her younger daughter to get kidnapped and get more jewels from the couple. She did, but she ignored the mouse unlike her sister and failed to get the warning. The demon couple then slept with the girl in between and ate her.”\n\nAs an act of gratitude for the good harvest, it is a custom for the people to offer yomari to the gods and goddesses. It can be in any shape or size; more common are the signature shape of the yomari while others also make them in the shape of gods and goddesses.\n\nAs the day is celebrated in winter, people also follow the tradition of sitting in front of makal (traditional firepots) to keep themselves warm. “Many also eat roasted eggs, garlic, and potatoes while sitting around the fire. However, the tradition is rarely seen nowadays,” Bajracharya laments.\n\nChildren also go around to ask for yomari where the households share their fortune by giving it back to the community. Charity on the day is also very common, she adds.\n\nOther tradition includes guru puja (worshipping teachers) where people worship books and their teachers.\n\nChef Santosh Sah made yomari famous in the international cooking show Masterchef UK 2020. Looking at that, many are inclining towards tasting this local delicacy. With its newfound fame and the local festival in mind, here is how you can make yomari and enjoy this tasty delicacy at your own home:\n\nYou need a bowl of rice flour. You also need boiled water to make the dough.\n\nBoil water in a pot. Then, put the hot water in the rice flour, and mix them together. Knead the mixture and make it into a dough. [You have to be careful as the mixture can be hot to touch].\n\nWhen the dough is ready, wrap the dough in a cotton cloth. Leave it aside for half an hour or overnight.\n\nIn a pan or a pot, put water and chaku. With heat, the chaku turns into liquid. The mixture should be consistent and thick but runny. Mix black sesame seeds and powder into the pan, and mix all. Add cinnamon or cardamom for taste. Put it aside to cool down.\n\nMix a bit of water and make it a paste. In the paste, mix coconut, sugar, and almonds. Add cinnamon or cardamom for taste. And put it aside to cool down.\n\nPut oil on the palm. Take a dollop of the dough into your hands and give it the shape. Start on one side, roll the dough between your palms for an elongated tail or lower half of the yomari. On the top, poke a hole. With your index finger slowly start pressing and rolling the dough in your palms. Make the base like a vessel to put your fillings.\n\nPut a spoon of your fillings and cover the opening by slowly pressing the opening with your hands. Give shape to the top any way you like it.\n\nContinue the process to make as many yomari as you want.\n\nThe way you make yomari is just like making momos. So, you can use the same pot you would use to make momos.\n\nPut the water to boil.\n\nOil the pot base before putting in the yomari. Make sure there are gaps for the yomari so that they do not stick.\n\nWhen the water boils, keep the base on top of that to make yomari.\n\nCook it for 10 to 12 minutes.\n\nTake the hot yomari into a plate and serve it.\n\nGarnish it with chopped almonds or chocolate syrup or any ingredient you would like before serving.\n\nFrom thearchive.",
        "url": "https://english.onlinekhabar.com/yomari-punhi-newa-festival-nepal.html",
        "scraped_at": "2026-01-27T20:31:01.142027"
    },
    {
        "title": "With foreign talent and rising crowds, Nepal’s cricket finds fresh energy",
        "tag": "Cricket",
        "content": "Right now in Nepal, as the clock strikes either 11 am or 4 pm, thousands of people get excited about the same thing, watching theNepal Premier League. Cricket, over the past few years, has gained immense popularity among Nepalis as the national team has achieved major milestones, such as playing in the World Cup and retaining ODI status. The cricket fraternity of Nepal has accomplished feats that other sports communities in the country still dream of.\n\nThe second edition of the NPL features matches under floodlights and allows spectators to watch from the parapet, both happening for the first time in Nepal’s cricketing history, marking yet another milestone.\n\nIn a country currently experiencing intense political tension, cricket has, to some extent, created an environment where people can share moments of happiness.\n\nWhile this league continues to draw attention from thousands around the world, its significance for Nepal’s cricket fraternity, along with its challenges and future, remains an important topic of discussion.\n\nFormer captain of Nepal’s national cricket team, Gyanendra Malla, says that such leagues would first strengthen the status of the Cricket Association of Nepal (CAN), the cricket governing body of Nepal.\n\n“Once CAN becomes strong, a lot of positive changes will automatically occur in the cricket fraternity,” says Malla, who is also the coach of Karnali Yaks, one of the NPL franchise teams.\n\nHe further adds that such a league will open avenues to international leagues for Nepali cricketers in the coming days.\n\nEach team in the NPL includes eight foreign players. In the first edition of the NPL, Nepali players had the opportunity to play with or against big names such as Shikhar Dhawan, Martin Guptill, Ravi Bopara, and James Neesham. Similarly, big names in the second edition include Jason Roy and Sohail Tanvir, Faf du Plessis and others.\n\n“Gaining and sharing experiences with foreign coaches and cricketers will naturally help in the skill development of our players,” says Malla.\n\nIn theeight-decade-long cricketing historyof Nepal, this is the first time that such a large franchise cricket league has been organised by CAN.\n\nThe NPL also held a talent hunt where each team opened a camp and selected the best players, one included in the main squad and others in the development squad, allowing them to train with the team.\n\n“Exploring new domestic players from different parts of the country who could contribute to the future of Nepal’s national team is another significant step taken by the NPL,” says CAN spokesperson Chhumbi Lama.\n\nEchoing Malla, Lama says that sharing the same dressing room and playing alongside players from various backgrounds will further enhance the skills of Nepali players.\n\nBoth Malla and Lama say that, in addition to skill development and making the cricket sector vibrant, leagues like the NPL also help boost tourism and Nepal’s economy.\n\nNational cricket player Gulshan Jha says that the NPL has become a great learning platform for domestic players.\n\n“Besides the technical aspects, playing with players from different countries also helps mentally. It allows us to understand other players’ approaches to the game,” says Jha, who currently plays for Karnali Yaks.\n\nAccording to CAN, on average, around 6,000 spectators watch the NPL live at the TU International Cricket Ground. On Saturdays, the tickets get sold out, meaning 12,000 spectators watch the NPL live at the TU International Cricket Ground. Ticket prices range from Rs 500 to 2,000.Reportedly, the first edition of the NPL was viewed live by around 130,000 to 135,000 spectators.\n\nWhile the league is getting “bigger and better,” it also faces challenges.\n\nAccording to the concerned authorities, the first and biggest challenge in hosting the NPL is infrastructure.\n\n“Although we now have floodlights and well-managed parapets, we still need better infrastructure,” Lama says. “Seeing the growth of Nepali cricket, I am hopeful that we will get good infrastructure very soon.”\n\nFor the improvement of the league in the future, Malla suggests that the next edition be held in better weather conditions.\n\n“In the present weather, the pitch condition is not as good as it should be,” he says. “Better pitch conditions would make the matches even more interesting.”\n\nHe adds that the league would reach another level if it received full sanction from the ICC.",
        "url": "https://english.onlinekhabar.com/nepals-cricket-finds-fresh-energy.html",
        "scraped_at": "2026-01-27T20:31:11.037412"
    },
    {
        "title": "What’s brewing in your cup? A deep dive into Nepal’s coffee caffeine",
        "tag": "Editor's Pick",
        "content": "For many Nepalis, mornings once began with a cup of tea. But that is changing. More and more, the day does not truly start until the first sip ofcoffeetouches the tongue. In the cool air of Kathmandu mornings or the quiet corners of Pokhara’s cafés, coffee has found a growing and loyal following. It is no longer just an imported indulgence. Nepali coffee, especially the Arabica grown in the highland mid-hills, is carving out a reputation of its own.\n\nBut as coffee culture takes root, so do the questions: How strong is that daily cup? How much caffeine are we drinking? Does it matter whether we boil, press, or brew it in a Moka pot? And what happens to that flavor and kick after the coffee sits on a shelf for a few weeks?Some of us wonder why our coffee sometimes tastes too sour. Others find it oddly flat or bitter. And many of us, whether sipping in a hip café or at home, are quietly asking: How many cups is too many?\n\nThat is precisely whata new studyfrom researchers at the Center for Environmental and Sustainable Agricultural Research (CESAR) and the Gandaki Province Academy of Science and Technology (GPAST) aimed to investigate.\n\nIt is the first research of its kind in Nepal to measure the actual caffeine content in our locally brewed coffee and how that changes depending on how it is brewed or how long it has been stored. The study also examined acidity levels, providing us with fresh insights into why some cups taste bright and tangy while others fall short.\n\nThe researchers purchased 10 locally available brands of coffee from Pokhara, all of which were made from Nepali-grown Arabica beans. Then, using three popular household brewing methods (boiling, French press, and Moka pot), they tested how much caffeine could be extracted from each technique.\n\nTheir findings were clear: the Moka pot outperformed the others. On day 0 (right after opening the packet), the Moka pot brewed the strongest cup, averaging 14.4 milligrams of caffeine per gram of coffee. Boiling came second at 11.6 mg/g, and the French press trailed at 10.1 mg/g.\n\nTo put that into perspective: if you brew 10 grams of coffee, a typical single-serving, you’re drinking about 144 mg of caffeine with a Moka pot, 116 mg with boiling, and 101 mg with the French press. The safe daily limit for most adults is 400 mg, according to international health guidelines. That means three cups of Moka is your max, less if you are sensitive.\n\nSo if you have ever wondered why your Moka pot coffee gives you that extra buzz, now you know.\n\nHere’s where things get more interesting. The researchers did not just test the coffee when it was fresh. They returned after 21 days and retested the same samples.\n\nAnd the caffeine had dropped. Sometimes by more than 10%.\n\nAlthough the coffee was stored in a reasonably sealed container, it had been exposed to air and humidity. Over time, this seems to reduce the caffeine content, possibly through moisture absorption or slow degradation. In simple terms, your coffee loses its punch the longer it sits around.\n\nThis matters. It means that if you want your coffee strong and flavorful, it is best to buy smaller quantities and use them up quickly. Storing ground coffee in airtight containers can also help preserve its flavour and aroma.\n\nAnother mystery the researchers tackled: acidity. Coffee lovers often describe a “bright” or “sour” taste, but what is going on?\n\nThe study measured the pH of coffee brewed using each method. A lower pH indicates higher acidity, and acidity plays a significant role in determining how we perceive the flavour of coffee. Interestingly, the boiling method produced the least acidic coffee (with the highest pH), while the French press method yielded the most acidic brews.\n\nAcross all methods, acidity changed slightly over time, typically becoming less sharp (i.e., exhibiting a somewhat higher pH) after 21 days. So if your coffee starts tasting flat or dull after a few weeks, it is not just in your head. Time does change the chemistry of what is in your cup.\n\nAcidity is not inherently bad. Many high-quality coffees are prized for their distinct flavor. However, if you prefer a mellow, smooth cup, boiling might be the best method for you.\n\nNepali coffee, primarily Arabica grown in mid-hill regions such as Gulmi, Syangja, Palpa, and Kaski, already has a reputation for quality. However, this study also shows that it stands up chemically: the caffeine content in fresh Nepalese coffee is comparable to that of some of the world’s best.\n\nThe strongest sample in this study yielded 17.8 mg of caffeine per gram of coffee, a number that rivals or exceeds that of many coffees from Brazil, Colombia, or Italy. That’s something for both farmers and consumers to be proud of.\n\nSo, what should you do with all this information?\n\nNepal’s coffee culture is still young, but it is growing fast. Walk around any city and you will find a café on nearly every street corner. Young people are buying French presses and pour-over kits. Farmers are planting more Arabica.\n\nHowever, there is still a lot we do not know about our coffee, including how it tastes, how it changes, and how it affects us. Crucially, we need to understand why and how our coffee is unique.\n\nThe diverse weather conditions in the mid-hills favour the formation of a variety of chemical compounds within the coffee beans, suggesting that taste profiles and caffeine content likely vary significantly depending on the specific location (altitude, microclimate) where the coffee is grown. Documenting these terroir-driven differences and tracking them over time requires dedicated, long-term research.\n\nCoffee is not just a beverage. It is a ritual, a comfort, a source of pride, and increasingly, a part of daily life for many in Nepal. Understanding what’s in that cup, how strong it is, how it changes over time, and how different brewing styles affect its taste is not just a matter of scientific curiosity. It is about making better choices, enjoying better flavour, and supporting a growing local industry.\n\nThe next time you brew a cup, think about what is happening behind the buzz, beyond the aroma, and inside the bean.\n\n",
        "url": "https://english.onlinekhabar.com/whats-brewing-in-your-cup-a-deep-dive-into-nepals-coffee-caffeine.html",
        "scraped_at": "2026-01-27T20:31:19.321806"
    },
    {
        "title": "US deports 80 Nepali nationals",
        "tag": "Society",
        "content": "Kathmandu, January 21\n\nThe United States has again deported 80 Nepali nationals. The deportees were brought to Kathmandu on Tuesday via a chartered aircraft and handed over to the authorities.\n\nAccording to Immigration Department spokesperson Tikaram Dhakal, those deported include 79 men and one woman. The individuals were deported for reasons including lack of valid documents, illegal stay, and violations of US immigration laws.\n\nFollowing their arrival, the deportees were sent to the Human Trafficking Investigation Bureau. After questioning, bureau officials handed them over to their families. The bureau has also requested the deportees to file complaints if anyone had sent them to the United States through illegal means.\n\nThe United States has been deporting Nepali nationals in phases in recent years.",
        "url": "https://english.onlinekhabar.com/us-deports-80-nepali-nationals.html",
        "scraped_at": "2026-01-27T20:31:23.280577"
    },
    {
        "title": "Sharp rise in gold price",
        "tag": "Economy",
        "content": "Kathmandu, January 21\n\nThe price of gold climbed sharply in the domestic market today compared to Tuesday. According to the Federation of Nepal Gold and Silver Dealers’ Association, the price of gold reached Rs 295,100 per tola (11.66 grams) today, while that of silver is set at Rs 5,920 per tola.\n\nOn Tuesday, gold was traded at Rs 284,700 per tola, while the price of silver stood at Rs 5,880 per tola. Recently, both gold and silver prices have continued to surge significantly. In the international market, gold is priced at 4,740 US dollars per ounce today, while silver is trading at 95 dollars per ounce, international media reported.\n\nAccording to economic analysts, rising uncertainty in the global economy, inflation, and geopolitical tensions have contributed to the increase in gold and silver prices, as they are considered safe investment assets.\n\n",
        "url": "https://english.onlinekhabar.com/sharp-rise-in-gold-price.html",
        "scraped_at": "2026-01-27T20:31:27.608714"
    },
    {
        "title": "Women in politics: A stepping stone for patriarchy!",
        "tag": "Politics",
        "content": "Kathmandu, January 21\n\nDespite the biting cold of Magh, Nepal’s political climate is heating up. As the country heads toward the scheduled elections on 21 Falgun, election-related activities have intensified. Yet, amid this political bustle, gender inclusivity within party ranks both in numbers and in meaningful roles appears weak across new and old political parties alike.\n\nWomen’s presence in national politics remains limited, and even the few women leaders who have emerged wield little influence within their own parties. Examples across parties, old and new, large and small, clearly show that it is not easy for women to reach parliament, raise their voices there, or assume executive roles through state power.\n\nNew parties that have projected themselves as alternative forces have, within a short span, gone through cycles of unity, adjustment, and renewed splits. Having claimed to be alternatives to traditional politics, these parties are now actively engaged in sharing power and positions and have entered the House of Representatives elections after completing ticket distribution.\n\nEven at this stage, disputes have emerged over proportional representation lists within these alternative parties. They have also been accused of lacking inclusivity in the distribution of leadership positions. In the current nomination process for the House of Representatives, the number of women candidates remains minimal, only about 12 per cent of total candidates.\n\nFollowing the earlier unification between then Ujyalo Nepal Party coordinator Kulman Ghising, Kathmandu Metropolitan City Mayor Balen Shah, and Rastriya Swatantra Party (RSP) chair Rabi Lamichhane, there was only one woman among the party office-bearers—treasurer Lima Adhikari. That unity has since collapsed, with Ghising’s Ujyalo Nepal charting its own course.\n\nA similar picture emerged from the 11th general convention of the CPN-UML held in the first week of Poush. Of the office-bearers elected, 18 were men and only one woman, Padma Kumari Aryal, was elected as secretary. When Ishwar Pokharel and KP Sharma Oli competed with full panels, social media saw sharp criticism over the low number of women candidates.\n\nEven earlier, during the UML statute convention held in Godawari from Bhadra 20, before the Gen-Z movement, voices had been raised demanding increased representation of women in the party’s leadership and central committee. Leaders, including former minister Bidya Bhattarai, Ashta Laxmi Shakya, Binda Pandey, and Pemba Lama, had called for constitutional guarantees of women’s participation, demanding at least one-third representation among office-bearers and 50 per cent in the central committee.\n\nHowever, issues such as the renewal of former President Bidhya Devi Bhandari’s party membership and the removal of the two-term limit dominated the party leadership’s priorities, pushing women’s representation demands into the background. The impact of this was clearly visible in the leadership selection at the 11th general convention.\n\nThe Nepali Congress, too, elected Gagan Thapa as party president through a special general convention held amid intense internal power struggles ahead of the elections. After the Election Commission recognised Thapa-led Congress as the official party, the Sher Bahadur Deuba faction moved the Supreme Court seeking to overturn the decision.\n\nEven before that, despite resistance from the party establishment, the special convention driven by then general secretaries Gagan Thapa and Bishwo Prakash Sharma saw men dominating both the frontlines of the convention and the newly elected central committee. The Deuba faction in the opposing camp was also dominated by male leaders, the so-called “seven brothers.” Notably, even reconciliation talks between the Thapa and Deuba camps did not feature any women leaders.\n\nAs a result, social media buzzed with questions about how many women the Congress convention would elevate to leadership, given the overwhelming presence of men in critical debates and power struggles. During the convention, Pushpa Bhusal, who broke the male-centric pattern of past office-bearers to become vice-president, addressed the gathering from the stage.\n\nElected unanimously, Bhusal said she had become the second woman vice-president of the Nepali Congress after Shailaja Acharya. As she spoke late at night at Bhrikutimandap, Bhupi Air, seated in front, was visibly emotional.\n\n“We finally got a woman vice-president after such a long time. I couldn’t hold back my tears,” said Air, chairperson of the Padma Kanya Campus Free Students’ Union. “When I think about how much struggle women leaders must have gone through to reach this position, it gives me goosebumps.”\n\nFrom the Congress special convention, three of the 11 office-bearers (27 per cent) in the new central working committee are women—Vice-President Bhusal, Joint General Secretary (women) Dr Dila Sangraula Pant, and Mukta Kumari Yadav from the Madhesi quota. However, outside reserved categories, women’s representation among central members remains almost negligible.\n\nWhether UML or Congress, these mainstream parties continue to be dominated by men at the centre. Public discourse framed through headlines like “seven brothers” or “ten brothers” has also drawn widespread dissatisfaction on social media.\n\nEven in the much-hyped unity involving RSP, Balen Shah, and Rabi Lamichhane, the final photo session featuring only male faces sparked criticism that even new parties were advancing with old political culture.\n\nAccording to former education minister and UML leader Bidya Bhattarai, when brothers and sons are visible outside, society tends to expect sisters, daughters, and mothers to remain confined to the kitchen.\n\nShe argues that “brotherhood” politics and patriarchal thinking still dominate Nepali politics, with “sisterhood” neither publicly accepted nor embraced in the same way. Leadership and state governance are still viewed through a patriarchal lens.\n\n“In our politics, there is constant talk of brotherhood, while women are discussed in terms of motherhood. Sisterhood is still confined within the home,” Bhattarai said. “Even though there is a mandatory provision of 33 per cent representation in committees, parties are reluctant to field and help women win at decisive levels like office-bearer positions.”\n\nCompared to the 2017 local elections, the 2022 elections saw an increase in the number of women in top leadership positions. However, overall women’s representation declined.\n\nIn 2017, only seven women were elected as mayors; that number rose to 13 in the latest elections. The number of women elected as rural municipality chairs also increased by one, reaching 12. Overall, the number of women elected as mayors and rural municipality chairs rose from 18 to 25, an improvement of just 3.34 per cent.\n\nHowever, the number of women elected as deputy mayors and vice-chairs declined sharply. Women’s representation in the second tier of local government leadership dropped from around 700 in 2017 to 562 in the latest elections. Under the shadow of electoral alliances among ruling parties, women’s representation shrank.\n\nThis shows that while the number of women in top leadership has increased, overall women’s representation has declined.\n\nAlthough legal provisions have increased women’s participation in Nepali politics, gender-based discrimination and neglect persist in practice. Few women are nominated as candidates, and even those who win often do not experience respectful treatment.\n\nBirtamod Municipality Mayor Pabitra Mahatara Prasai says discrimination does not end even after women are elected to leadership. She says women leaders’ work often goes unpublicised and undervalued, while the media prioritises male mayors’ statements and activities.\n\n“No matter how well we perform, there is a tendency not to publicise our work. Beyond that, women’s voices are not readily heard,” said Prasai, Jhapa district’s only woman mayor. “Men interrupt women while they are speaking at public forums, and women’s views are not taken seriously. If a male politician is present, our words are ignored and deprioritised.”\n\nPrasai, who began her political journey as a student in 1986 BS, says women face discrimination from the household level all the way to local governments, central ministries, and administrative offices. She recounts repeated experiences where male officials and secretaries ignored women representatives and failed to respond appropriately.\n\n“It often feels like what we say has no meaning. That causes deep internal pain. But if we speak about it publicly, it feels like we will become targets of trolling,” she said.\n\nThis reflects how society struggles to accept women’s work even when they succeed on their own merit.\n\nThe experience of Maulapur Municipality Mayor Rina Kumari Shah in Madhesh Province is not much different. Although she was elected with family support and her own effort, she finds her voice less heard than that of male leaders at public events.\n\n“I had support from home, which made it easier for me to enter politics. Otherwise, politics is not easy for women. Even after being elected, women are given less importance at public programs when men are present—so what must it be like otherwise?” she asked.\n\nThese experiences show that women face far greater struggles than men, not only to enter politics but also to survive and establish themselves after entry. Structural barriers and patriarchal thinking continue to prevent even women in decision-making positions from escaping gender discrimination.\n\nWomen’s representation in parliament has gradually increased numerically since the fall of the Rana regime, when there was only one woman lawmaker. However, women still struggle to secure meaningful roles commensurate with the times.\n\nFrom the 2022 House of Representatives election, 92 of 275 lawmakers were women. At that time (2023), 22 of the 59 National Assembly members were women. Together, women made up one-third of the total 334 federal parliamentarians.\n\nBecause the constitution mandates one-third representation of women in the federal parliament, parties are legally compelled to meet that threshold. But beyond barely meeting the minimum, there appears to be little effort to further increase women’s representation.\n\nEarlier, the 2017 elections had produced 90 women in the House of Representatives and 22 in the National Assembly. The Constituent Assembly had 601 members—197 women (33 per cent) in the first assembly and 176 (29 per cent) in the second.\n\nHistorically, women’s representation was far more dismal. In the 109-member House of Representatives and 36-member Upper House between 1958 and 1960, there was only one woman lawmaker in each chamber. At that time, Nepali Congress lawmaker Dwarika Devi Thakurani also became a minister, the first woman lawmaker and minister of Nepal. On June 30, 1959, the then king nominated Kamal Rana to the Upper House.\n\nWomen’s presence in the Rastriya Panchayat was also minimal. Between 1962 and 1986, only 21 women served as members, elected or nominated. After the restoration of democracy, 43 women became lawmakers between 1991 and 1999.\n\nDespite numerical growth, women have continued to face challenges in exercising influence.\n\nFor instance, on February 14, 2023, during a meeting of the House of Representatives Rules Drafting Committee at Singha Durbar, then UML lawmaker Bidya Bhattarai took a firm stand. She insisted on the need for a separate unit to address women’s issues in parliament.\n\nWhen it became clear that the proposal by Bhattarai and other women lawmakers for a dedicated mechanism might be rejected, she said, “If this does not happen, it will not be acceptable. This is the unified voice of women lawmakers.”\n\nHowever, committee member Subas Chandra Nembang proposed an alternative, arguing that a women-specific unit resembled a caucus, and suggested a “Gender and Inclusive Advocacy Unit” instead. The committee accepted this proposal, though Bhattarai expressed doubts about its future implementation.\n\nDuring final passage in the House, further discussions led to the unit being renamed the “Women Coordination Committee.” Accordingly, Rule 257 of the House Rules provides for such a committee.\n\nNearly three years later, Bhattarai’s doubts have proven valid. Despite the committee’s full 33-month tenure having elapsed due to House dissolution, the mechanism to discuss women’s issues has not been implemented. Women’s concerns have not been taken seriously within parliament.\n\nAccording to Bhattarai, political parties rarely give women roles voluntarily unless compelled by law. “When the law makes it mandatory, they are willing to assign roles. Otherwise, there is little interest in doing so,” she said.\n\nShe also observes that when male leaders leave politics or switch parties, it becomes a major public issue, while women leaving politics are often dismissed as having “gone to look after family,” effectively privatising their exit.\n\n“Not only that, our structures themselves reinforce this,” she said. “Traditionally, women are confined to leading sister organisations or women’s wings rather than the party’s main leadership. This weakens their presence in the party mainstream. This tradition also needs to change.”\n\n",
        "url": "https://english.onlinekhabar.com/women-in-politics-a-stepping-stone-for-patriarchy.html",
        "scraped_at": "2026-01-27T20:31:32.833459"
    },
    {
        "title": "Nepal’s Election: Something is cooking",
        "tag": "Opinion",
        "content": "Nepal is at a political crossroads. The recent Gen-Z protests shook the country to its core, toppling a sitting government in just 48 hours. This was not just street politics; it was a loud signal of public frustration, frustration with corruption, slow governance, and political stagnation. But it’s not only about what’s happening inside Nepal.\n\nRegional geopolitics and international influence have quietly but powerfully shaped the currents behind these protests. Even after a new government was formed and investigation committees were set up to look into the September 8–9 shootings and vandalism, uncertainty persists.\n\nAmid all the chaos, one thing has become clear- Nepal must go to the election. The bigger question now is not if but how—what kind of political order will emerge, and who will lead it?\n\nYoung people around the world are challenging politics from Sri Lanka to Bangladesh; they are demanding accountability and space in decision-making. Nepal is no different. The protests started after a temporary social media ban, layered on years of frustration with corruption and slow political reforms.\n\nWhat made these protests stand out was their energy, but also their risks. School children in uniform joined, raising ethical and legal questions, as Nepali law forbids children from participating in political activity. Were they manipulated, or were they genuinely expressing frustration? The truth may never be fully known.\n\nWhen the protesters entered restricted zones, things turned violent. Lives were lost. Initially, security forces were restrained, but later actions were widely criticised as excessive. The attacks on state institutions-the legislature, judiciary, and executive showed that this was more than a protest.\n\nEven before the protests, Nepal’s political landscape was shifting. New actors were emerging. The Rastriya Swatantra Party (RSP), led by Rabi Lamichhane, and independent figures like Kathmandu Mayor Balendra (Balen) Shah and Dharan Mayor Harka Sampang had started capturing public imagination.\n\nGlobally, populism thrives in moments like this. Leaders such as Donald Trump or Volodymyr Zelenskyy show that people respond to authenticity and decisive action, even if the leader lacks traditional experience. Yet scholars caution about its dangers. As political theorist Jan‑Werner Müller notes- “The danger to democracies today is not some comprehensive ideology that systematically denies democratic ideals. The danger is populism—a degraded form of democracy that promises to make good on democracy’s highest ideals.”\n\nNepal’s youth-heavy electorate seems to favour this same style; direct, hands-on leadership rather than long-established party hierarchies. For old parties, this is an existential challenge.\n\nThe protests and political shifts have also drawn attention to Nepal’s southern neighbour. Officially, non-interference is emphasised, but public perception is different. Many observers believe the popularity of Kathmandu Mayor Balendra (Balen) Shah and the organisational strength of the Rastriya Swatantra Party (RSP) have grown in ways that may align with external interests.\n\nBalen’s rising projection against CPN-UML chair KP Sharma Oli is especially symbolic. Many view this as a backlash against Oli’s nationalist stance, most visibly reflected in the publication of Nepal’s new political map and, for some, even as an attempt to curtail his political trajectory.\n\nInterestingly, Balen, who earlier downplayed his connections with Madhesh, is now increasingly presenting himself as a dhartiputra of Madhesh, mobilising Madheshi political sentiment. This rapid shift, along with his projection as a potential prime ministerial candidate, has raised questions about how organic this political transformation truly is. Public debate increasingly points to the possible role of the southern neighbour in facilitating this alignment. Whether organic or encouraged, this shift has undeniably fueled political speculation.\n\nAs political commentator C.K. Lal cautions, “Populism in Nepal risks replacing institutions with personalities, making the state more vulnerable to external influence.” In Nepal’s fragile democracy, perception alone is already shaping voter behaviour.\n\nPopulism often comes at a cost. Globally, it tends to sideline gender equality, proportional representation, and minority rights and Nepal is no exception. Current federal election data shows male candidates outnumber female candidates nearly eight to one.\n\nFrom a feminist perspective, this imbalance is not accidental. As feminist political theorist Anne Phillips argues, “When politics is reduced to personality and charisma, women are the first to be pushed out.” Populist politics, which often glorifies strong, individual leaders, tends to marginalise collective struggles for equality and representation.\n\nThis trend threatens hard-won constitutional gains. If elections prioritise popularity over institutions and safeguards, Nepal risks undoing years of progress in federalism, inclusion, and representative democracy—progress achieved largely through sustained feminist and social justice movements rather than populist appeal.\n\nNepal’s elections are more than a contest between old and new parties. They are a test: will democratic change strengthen institutions, or weaken them? Old parties are regrouping. New forces are mobilising. Young voters are energised. Regional geopolitics looms large. Something is cooking in Nepal’s politics, but whether it strengthens democracy depends on leadership.\n\nThe new generation of leaders is energetic and popular, but many lack parliamentary experience. Can young leaders without legislative or executive experience navigate complex geopolitics, manage relations with neighbouring powers, and safeguard national interests?\n\nIn a parliamentary democracy, a prime minister without parliamentary experience faces extraordinary challenges balancing governance and diplomacy.\n\nYet this is also an opportunity. Nepal can embrace political change without sacrificing democratic substance. Federalism, proportional representation, gender equality, and inclusion must remain intact. History shows that populist waves often erode these very pillars first.\n\nThe real test is not just who comes to power, but whether Nepal’s democracy emerges stronger, inclusive, accountable, and resilient or louder, flashier, and fragile. Leadership, maturity, and respect for institutions will determine if the country can navigate these turbulent times and transform unrest into constructive change.\n\n",
        "url": "https://english.onlinekhabar.com/nepals-election-something-is-cooking.html",
        "scraped_at": "2026-01-27T20:31:36.559136"
    },
    {
        "title": "WordCamp Nepal 2026 to be held in Butwal on January 23–24",
        "tag": "Technology",
        "content": "Kathmandu, January 21\n\nButwal will hostWordCampNepal 2026 on January 23 and 24 at Manigram Bishram Batika, marking the first time the national WordPress conference is being organised in the Lumbini Province. Organisers say the event aims to expand WordPress knowledge and opportunities beyond Kathmandu and support Nepal’s growing digital economy.\n\nAccording to the organisers, Butwal was selected due to its emergence as a technology and business hub and its proximity to major destinations such as Bhairahawa and Lumbini, which are expected to attract participants from the Tarai region as well as other parts of the country.\n\nThe two-day event will begin with Contributor Day on January 23, where participants will work in teams to directly contribute to the global WordPress project while gaining hands-on learning and collaboration experience. January 24 will feature the Conference Day, including expert talks, panel discussions, and practical workshops focused on new trends, best practices, and recent developments in WordPress.\n\nWordCamp Nepal 2026 is expected to bring together WordPress enthusiasts, developers, designers, content creators, entrepreneurs, students, and users from across the country. Organisers say the conference will provide opportunities for learning, networking, community building, and career development, while also offering updates on the latest activities within the WordPress ecosystem.\n\n\n\n",
        "url": "https://english.onlinekhabar.com/wordcamp-nepal-2026-to-be-held-in-butwal-on-january-23-24.html",
        "scraped_at": "2026-01-27T20:31:41.803862"
    },
    {
        "title": "Turkish Airlines aircraft returned to parking after emergency halt on runway",
        "tag": "Society",
        "content": "Kathmandu, January 25\n\nA Turkish Airlines flight from Kathmandu to Istanbul was halted on the runway and returned to the parking bay. The aircraft, operating flight TK-727, was scheduled to depart Kathmandu at 12:35 pm.\n\nAccording to Tribhuvan International Airport Acting Director General Tek Nath Sitoula, the aircraft had already begun its take-off run after receiving clearance when an indicator signalled a technical issue, prompting the crew to stop the aircraft.\n\n“After an indication showed a problem, the aircraft, which had already started its run, was halted and brought back,” he said, adding that the plane will resume its flight after a technical inspection.",
        "url": "https://english.onlinekhabar.com/turkish-airlines-aircraft-returned-to-parking-after-emergency-halt-on-runway.html",
        "scraped_at": "2026-01-27T20:31:46.350840"
    },
    {
        "title": "Fake helicopter rescues in Nepal net millions in insurance claims",
        "tag": "Crime",
        "content": "An investigation by theCentral Investigation Bureau(CIB) of Nepal Police found evidence that chartered helicopter flights, and in some cases even regular commercial flights, were misrepresented as medical evacuations in order to claim insurance money.\n\nThe findings were disclosed on Sunday at a press briefing at the CIB office in Lazimpat. The bureau’s chief,  Manoj K.C., an Additional Inspector General of police, informed that the so-called rescues were fabricated.\n\n“Even charter flights were shown as rescues to obtain insurance payments,” K.C. says. “These were not genuine rescues but fake ones.”\n\nInvestigators said regular flights were also falsely labelled as rescue operations, with fabricated rescue schedules and passenger records submitted to support insurance claims.\n\nAccording to officials, in some cases, multiple tourists travelling on a single charter flight were billed as having been rescued separately and at different times, a practice known as “single flight, multiple billing.”\n\nAs per the investigation, trekking tourists returning along the same route after completing their journeys were persuaded to fly back to Kathmandu on chartered helicopters, which were later presented as emergency evacuations.\n\nThe CIB said it had received multiple complaints in recent years, including one as recently as December 16, 2024, and another on September 28, 2025. The Ministry of Home Affairs also formally requested an investigation into fake rescues earlier this winter.\n\nAuthorities allege that the scheme involved illegal collusion among trekking and travel companies, helicopter rescue firms, hospitals and tourist guides, primarily targeting foreign trekkers.\n\nThe CIB is currently investigating fake rescues carried out since 2022.\n\nAfter conducting a separate investigation over the past two and a half months, including during public holidays, the CIB announced the arrest of six people accused of orchestrating the fraud.\n\nThose arrested include Jayaram Rimal, owner of Mountain Rescue Service Pvt. Ltd., and its manager, Bibek Pandey, Rabindra Adhikari, owner of Nepal Charter Service, and operations manager Bibek Raj Thapaliya, and Mukti Pandey, owner of Everest Experience and Assistance Pvt. Ltd., along with its manager, Subash K.C.\n\nAll six are affiliated with three companies that investigators say were involved in at least 317 fake rescues.\n\nAccording to the CIB, the Mountain Rescue Service reported evacuating 1,248 tourists between 2022 and 2025. Of those, 171 were found to be fraudulent, resulting in insurance claims totalling $10.31 million.\n\nNepal Charter Service reported 417 rescues, of which 75 were found to be fake, with insurance payouts of approximately $8.23 million.\n\nEverest Experience and Assistance reported 601 rescues, including 71 fraudulent cases, with insurance claims amounting to $1.15 million.\n\nIn total, investigators estimate that the three companies obtained $19.69 million through fake rescue claims.\n\n“This is preliminary data, and the figures could increase,” a CIB investigation officer says toOnlinekhabar.\n\nAs fake rescues increased, insurance companies covering foreign trekkers began suspending premium payments, according to CIB officials.\n\nAt least three insurance companies have completely halted premium payments, citing mounting losses from fraudulent claims. Some claims submitted by rescue companies were also rejected outright.\n\nThe six suspects are being investigated under multiple provisions of Nepal’s criminal code, including organised crime, forgery, fraud and offences against the state.\n\nInvestigators said the case falls under Section 51 of the Criminal Code, which prohibits acts detrimental to national interest, as well as Section 249 (fraud), Section 253 (illegal financial gain), and Section 276 (document-related offenses).\n\nAuthorities allege that fake medical reports and helicopter invoices were forged, fraudulent insurance bills were submitted, and tourists were falsely warned of life-threatening altitude sickness to justify evacuations, damaging Nepal’s international reputation in the process.\n\nThe case is being treated as an organised crime involving collusion among trekking agencies, hospitals and helicopter companies. Money laundering charges may also apply.\n\nForeign tourists travelling to Nepal typically purchase insurance before trekking in high-altitude regions. Investigators say travel agencies first verified the tourists’ insurance policies before planning fake rescues.\n\nOnce in the mountains, guides allegedly exaggerated minor symptoms commonly associated with altitude, pressuring tourists into helicopter evacuations that were medically unnecessary.\n\nIn many cases, officials said, tourists would recover simply by descending to a lower altitude, yet were still flown to Kathmandu and taken to specific hospitals favoured by the rescue operators.\n\nRescue companies and hospitals then submitted separate or lump-sum bills to insurance providers.\n\nWhile the current investigation covers cases since 2022, authorities acknowledged that fake rescues had been reported as early as 2018. However, the lack of documentation has made older cases difficult to prosecute.\n\nIn 2017, a travel assistance firm reported that nearly 35 percent of rescues were fraudulent. That same year, reports emerged of trekkers being deliberately made ill through food contamination to trigger evacuations and earn commissions.\n\nA government investigation committee formed in 2018 recommended further police inquiry and led to the introduction of new rescue monitoring guidelines. But officials say the absence of records has hindered retrospective investigations.\n\nThe CIB warned that fake rescues risk tarnishing Nepal’s international image and could eventually make the country a “no-go destination” for tourists.\n\nOfficials also cautioned that fraudulent evacuations could delay or obstruct genuine rescue operations, potentially putting lives at risk.",
        "url": "https://english.onlinekhabar.com/fake-helicopter-rescues-in-nepal.html",
        "scraped_at": "2026-01-27T20:31:51.714852"
    },
    {
        "title": "Echoes in the Valley, where the valley sings",
        "tag": "Music",
        "content": "Prior to 2017, Nepal already had several music festivals that not only provided platforms for national artists but also invited international artists to perform. However, none of these festivals took place in public spaces, collaborated closely with local communities, or were dedicated to promoting folk and cultural artists, artists who hold the potential to represent Nepal on the global music stage.\n\nRecognising the absence of such a festival, musician and music educator Riju Tuladhar envisioned an event that would bring local communities and artists together in public spaces for a common purpose: to perform folk and cultural music representing different parts of Nepal and the world. After the idea took shape, he shared it with other like-minded individuals, who agreed to support the initiative. Later in 2017, they collectively foundedEchoes in the Valley, a festival of folk music, intending to bring together a wide range of folk, traditional, and indigenous sounds from Nepal and beyond.\n\nThis year, Echoes in the Valley (EITV), scheduled for January 23 -24 in Khokana, Lalitpur, marks its 10th edition.\n\nAs the dates for the 10th edition approach, Tuladhar and his team have been working relentlessly over the past few days, managing the venue, logistics, promotional materials, artist coordination, and other arrangements.\n\nWhile preparing for the milestone edition, Tuladhar recalls the festival’s first edition, which was held in Ason and nearby areas. The inaugural edition primarily focused on delivering strong performances and reviving the tradition ofdabali, a traditional open-air public stage.\n\n“The first edition went better than our expectations,” recalls Tuladhar, co-founder and director of the EITV.Talking about the first edition, Tuladhar recalls the hardship of managing the space for the festival. He says the festival team held 44 different meetings to manage the venue.\n\nFor the inaugural festival, the EITV team successfully brought together artists from Finland, Sweden, and France.\n\nOver the years, the festival has undergone numerous changes, including those in terms of artists, sound, audiences, spaces, and challenges.\n\nRecently, as global politics has changed drastically, the issue of getting funding from international organisations has added additional challenges to the organisers of the festival. Similarly, finding local artists has remained another challenge for the festival.\n\n“In Nepal, most bands do not sustain for the long run; the band which formed last year do not exist currently. Such situations create challenges in finding the artist for the festival,” saysRajan Shrestha, who oversees the Learning and Education Initiatives of the festival.\n\nOver the years, the festival has undergone many changes in terms of artists, sounds, audiences, spaces, and challenges. Recently, with global politics shifting drastically, securing funding from international organisations has become an additional challenge for the festival organisers. Similarly, finding local artists has also proven difficult.\n\n“In Nepal, most bands do not sustain in the long run. Many bands formed last year no longer exist today. Such situations create challenges in finding appropriate artists for the festival,” says Rajan Shrestha, a member of the organising team.\n\nTo overcome this challenge, the EITV team has also begun reaching out to universities and music institutes. Although most local artists participate through an open call announced by EITV, the festival team believes it is equally important to proactively seek out artists on their own.\n\nThe other challenge, according to Tuladhar, that the festival often faces, is to convince people about the genuineness of the festival.\n\n“Since the festival has always been a free event, we have often been questioned about our intentions behind organising it,” says Tuladhar. “People ask, ‘Why would someone organise an event of this scale for free? ‘ and they sometimes doubt our genuineness.”\n\nWhile music festivals come and go each year, their impact on the community often remains a matter of concern. The EITV team believes that merely organising a festival does not meaningfully contribute to the music scene. With this understanding, EITV has, over the years, developed several initiatives aimed at contributing to the overall growth of Nepal’s music landscape.\n\nThese initiatives includeConfluence, a platform where musicians, teachers, students, music enthusiasts, and supporters gather to share and exchange stories, experiences, ideas, and inspirations around music-related projects;AmplifiHer, a free music production course for women and non-binary individuals;Kaleidoscope, a three-week residency programme focused on cross-cultural collaboration and creative exchange; and theNepal Music Archive, an initiative dedicated to digitising materials related to Nepali music.\n\n“With such initiatives, EITV is not merely allowing artists to perform and entertain audiences, but is also enhancing music literacy in the country,” says Shrestha.\n\nTuladhar, who has travelled to numerous international music festivals across different parts of the world, says that the representation of Nepali music remains very limited. In this context, he believes that festivals like EITV can help support Nepali artists in reaching international music platforms and festivals.\n\nEITV is the only music festival in Nepal that has taken place across various corners of the Kathmandu Valley. From Dagu Baha in Kathmandu to Madhyapur Thimi in Bhaktapur, EITV has resonated with echoes of folk music. However, the festival has yet to travel beyond the Valley.\n\n“We would love to take EITV outside the Kathmandu Valley, but due to financial constraints and a lack of the resources required to organise such a festival beyond the Valley, we have not been able to do so,” says Tuladhar.\n\nDue to the lack of music festivals outside the Kathmandu Valley, the EITV team has not been able to engage in collaborative work beyond the Valley.\n\nPreviously, EITV was held in March, but this year the organisers have changed the schedule due to the upcoming House of Representatives elections, slated for March 5. This shift in timing is one of the major factors that sets this edition apart from previous ones. Additionally, residents of Khokana will manage the stalls at the venue, further enhancing community engagement. Popular artist Arko Mukherjee & Friends feat. Gaboo from India will be headlining the final day of the edition.\n\n“This year’s EITV will be even more raw,” says Tuladhar.\n\n​\n\n​\n\n​\n\n​",
        "url": "https://english.onlinekhabar.com/echoes-in-the-valley.html",
        "scraped_at": "2026-01-27T20:31:57.186483"
    }
]