[
    {
        "title": "Application at Kaski Court to amend money laundering and organized crime charges against Lamichhane",
        "tag": null,
        "content": "An application has been filed at the Kaski District Court to withdraw the money laundering and organized crime case filed by the District Attorney's Office against Rashtriya Swatantra Party (RSP) President Rabi Lamichhane.\n\nAccording to Information Officer at the Kaski District Court Ram Bahadur Kisan, the application for amendment of the charges submitted by the District Attorney's Office was registered on Monday. Kisan stated that the court has not yet made any decision regarding the application.\n\n\"We will now present the application to the bench,\" Kisan said. \"It will be presented on the day the case is scheduled for a hearing. It hasn't been scheduled yet.\"\n\nThe application for charge amendment will be presented on the day the bench sits for the case involving the Pokhara-based Suryadarshan Savings and Credit Co-operative fraud allegations. He pointed that a lottery system is used to assign hearings in court, and the hearing has not yet been assigned.\n\nIn the Suryadarshan Savings and Credit Co-operative fraud case, the District Attorney's Office had also leveled charges of money laundering and organized crime against Lamichhane, former chairman of the cooperative and chairman of Galaxy Television (run by Gorkha Media Network Pvt Ltd) GB Rai, promotor of Nature Herbs International Pvt Ltd Ram Bahadur Thapa, and Lila Pachhai.\n\nAttorney General Sabita Bhandari had granted approval to amend the charges for all five individuals accused of cooperative fraud, money laundering, and organized crime, thereby withdrawing the money laundering and organized crime cases.\n\nDistrict Attorney Kamala Kafle stated that the District Attorney's Office filed the application in court to withdraw the case based on the approval granted by Attorney General Bhandari.\n\nWhile Lamichhane faces cooperative fraud charges in five different districts across the country, the money laundering case is sub judice only at the Kaski District Court. Lamichhane, who is also a former deputy prime minister and home minister, had spent 84 days in Kaski police custody during the investigation of the same case.\n\nCooperative fraud and organized crime cases against Lamichhane remain sub judice in the Kathmandu and Rupandehi District Courts as well.\n\nLamichhane held 15 percent shares in Galaxy Television, which had illegally been funded by the cooperative, and he served as the company's managing director. On January 9, 2025, a bench of Kaski District Court Judge Nitij Rai ordered Lamichhane's release on a bail of Rs 6.5 million. Lamichhane was released the same day after depositing the bail amount.\n\nIn the case pending at the District Court, a recovery claim of Rs 33,765,000 for cooperative embezzlement and Rs 278,944,705 for money laundering has been sought against Lamichhane.\n\nIn the charge sheet submitted to the court by the District Attorney's Office regarding the embezzlement of savings kept by nearly 17,000 ordinary depositors in the Suryadarshan Savings and Credit Co-operative, there are 63 defendants including Lamichhane. The charge sheet seeks to recover a total amount of Rs 1.51 billion from them.",
        "url": "https://en.setopati.com/political/165874",
        "scraped_at": "2026-01-31T09:59:27.693830"
    },
    {
        "title": "Corruption case against ex-VC and 19 others in procurement of CT machine",
        "tag": "Society",
        "content": "Former vice-chancellor of Rapti Academy of Health Sciences (RAHS) Dr Sangita Bhandari has been implicated in corruption during procurement of health equipment.\n\nThe Commission for Investigation of Abuse of Authority (CIAA) filed a corruption case on Thursday against 20 individuals including Dr Bhandari.\n\nAccording to CIAA spokesperson Suresh Neupane, there was corruption of Rs 73,182,985 during the purchase of a CT scan machine for the RAHS.\n\nSpokesperson Neupane informed that the corruption case was filed at the Special Court on Thursday against 20 individuals including Dr Bhandari and other former employees of the RAHS.\n\nThe then acting registrar Kailash Prasad Dev, director Dr Sagar Panthi, head of the radiology department Dr Bom BC, biomedical engineers Sharad Bhandari and Ashutosh Bhandari, consultant biomedical engineer Amit Kumar Chaudhary, and lecturer Dr Shrisiya Pokharel have also been implicated in the case.\n\nNeupane added that the then section officers Jhankar Lamichhane, Leela Kumari Devkota, and Megh Bahadur Adhikari, IT officer Hira Lal Bhandari, accounting officer Rajiv Basnet, pharmacy supervisor Krishna Prasad Joshi, staff nurse Bindu Paudel, physiotherapist Puja Thakur, computer assistant Satish Bahadur Shah, Himalayan Meditech Pvt Ltd., and the company's promoters Amar Shrestha and Sanju Rajkarnikar have also been named defendants in the case.\n\nThe CIAA has also demanded recovery of Rs 73,182,985 from each of the defendants.",
        "url": "https://en.setopati.com/social/165873",
        "scraped_at": "2026-01-31T09:59:27.999700"
    },
    {
        "title": "Cloudy Kathmandu (in pictures)",
        "tag": "Society",
        "content": "The Meteorological Forecast Division has stated that the country is currently under the partial influence of a western low-pressure system.\n\nAccording to the division, the high-hilly and mountain regions of the country will be completely cloudy Wednesday afternoon, while the hilly and Tarai areas of the remaining regions will experience cloudy weather. Additionally, there is a possibility of moderate snowfall and rain at some places of the high-hilly and mountain regions of the country.\n\nThere is a possibility of moderate rain in some places of Gandaki, Lumbini, Karnali, and Far West provinces, light rain in some places of the hilly regions of Bagmati, Madhesh, and Koshi provinces, and light rain in one or two places of the Tarai region in Koshi province.\n\nSimilarly, tonight, the hilly and mountain regions of the country will be partially cloudy, while the weather will remain clear in the remaining parts. There is a possibility of light snowfall and rain in one or two places of the high-hilly and mountain regions of Koshi, Bagmati, and Gandaki provinces.\n\nIn Kathmandu, there has only been light drizzles at some places. Meteorologist Binod Pokharel stated that light rain has been occurring in western Nepal until Tuesday and the system causing the rain has reached Gorkha on Wednesday.\n\nHe mentioned that there is a possibility of this causing rain in most places throughout Wednesday. The division has stated that from Thursday onward, the weather will start to clear up, although it may remain cloudy in some places.\n\n",
        "url": "https://en.setopati.com/social/165868",
        "scraped_at": "2026-01-31T09:59:28.295896"
    },
    {
        "title": "Advocate Yuva Raj Safal arrested",
        "tag": "Politics",
        "content": "Advocate Yuva Raj Paudel (Safal) has been arrested on Tuesday.\n\nThe police arrested him on charges of spreading rumors and engaging in verbal abuse via social media. A team from the District Police Range, Kathmandu arrested him on Tuesday, according to SSP Ramesh Thapa.\n\n\"He was arrested on charges of verbal abuse and spreading rumors. We have extended his remand and moved forward with the investigation,\" he said.\n\nSafal had leveled allegations targeting the Office of the Attorney General and Attorney General Sabita Bhandari, involving negative remarks, profanity, abuse, defamation, and claims of withdrawing cases in exchange for money.\n\nThe office had sent a letter on January 21 requesting action against him.\n\nThe police arrested Safal after videos were also made available. The Kathmandu District Court has granted a three-day remand to proceed with the investigation.",
        "url": "https://en.setopati.com/political/165865",
        "scraped_at": "2026-01-31T09:59:28.629060"
    },
    {
        "title": "Dahal and Gautam may face problem if traditional NC, UML voters return home",
        "tag": "Politics",
        "content": "The upcoming House of Representatives (HoR) election in Chitwan-3 is interesting for two reasons.\n\nFirst, there is a competition between two high-profile female candidates from two different political parties in this constituency. Many assess that the main competition will be between 49-year-old Renu Dahal of Nepali Communist Party (NCP), who served two terms as mayor of Bharatpur Metropolitan City, and 29-year-old Sobita Gautam of Rastriya Swatantra Party (RSP) who won from Kathmandu-2 in her first attempt in the last general election in 2022.\n\nSecond, since promulgation of the Constitution in 2015, the traditional big parties, Nepali Congress (NC) and CPN-UML, have fielded their own party candidates without forming an alliance with anyone for the first time. In 2017, there was a UML-Maoist alliance, while NC supported Bikram Pandey of Rastriya Prajatantra Party (RPP).\n\nIn 2022, there was an alliance between NC, Maoists, and CPN (Unified Socialist) formed after split in UML. This time, NC has fielded Tek Prasad Gurung while UML has put forward Shankar Thapaliya. Similarly, after RPP leader Pandey, who three years ago, exited the competition this time, Deepak Thapa Magar has made an entry for the monarchist party.\n\nThis parliamentary constituency includes 19 wards of Bharatpur Metropolitan City (wards 6, 8, 9, and 13-28) and all wards of Madi Municipality. More than half of this area consists of Bharatpur and the other half of Madi Municipality.\n\nLooking at the votes obtained by parties in the first-past-the-post and proportional representation (PR) electoral systems during the last election in 2022, an interesting aspect emerges. Although RPP’s Pandey won by securing 35,000 votes, RPP received just 16,700 votes, less than half of that in the PR category.\n\nBhoj Raj Adhikari of the then Maoist Center, who was defeated by Pandey, secured 25,800 votes, while the Maoist party received 16,000 votes in the PR category. The PR votes of NC and UML also decreased by more than half compared to the previous election in 2017. NC, which received more than 26,000 PR votes in 2017 election, secured just 10,500 votes in 2022.\n\nSimilarly, UML had received 24,155 PR votes in 2017 but got 14,500 votes in 2022. RSP, which was formed only four months before the election in 2022, had not even campaigned properly in this area. Despite that, RSP candidate Jita Baral received nearly 15,000 votes in the constituency.\n\nRSP, which received the most PR votes from Chitwan district, secured the highest PR votes even in the constituency with 28,401 votes.\n\nPrior to the parliamentary elections, there was also an alliance during the local elections. Maoist candidate Renu Dahal won mayoral election in Bharatpur with votes of NC and Unified Socialist. In Madi Municipality, however, Tara Kumari Mahato of UML won.\n\nIn the local elections, 28 ward chair candidates from the NC-Maoist-Unified Socialist alliance in this area received 45,172 votes. Ward chairs from UML received 30,609 votes, and RPP ward chair candidates received 7,454 votes.\n\nJagannath Paudel, who led dissatisfied NC cadres and ran for mayor of Bharatpur, received 8,253 votes from the 19 wards falling under the constituency. Six months later, NC received just 10,000 PR votes from the entire constituency.\n\nLet’s analyze what might happen in this election based on these data. NC leaders and cadres interpret the 10,000 votes they received in the previous election, despite a rebel candidate, as the votes that will not go elsewhere. NC leaders claim that since they have not formed an alliance with anyone and no rebel candidate has emerged, the votes of traditional NC voters will return.\n\nSimilarly, based on the PR votes received in the previous election, UML also claims that 14,000 votes will not go anywhere. After promulgation of the Constitution in 2015, UML voters were also forced to vote for the Maoists in 2017. Now they have their own candidate. UML leaders say this has significantly improved the atmosphere.\n\nIf NC and UML protect their votes, both Renu Dahal of NCP and RSP’s Gautam will come under pressure. Even when the Maoists fielded Chairman Pushpa Kamal Dahal in 2017, the votes received in the PR category were 22,000. In the last election in 2022, this dropped to 16,000.\n\nMany estimate that Dahal went to Gorkha in 2022 precisely because he saw this place as unsafe after winning due to alliance with UML. The Maoists eventually lost even when fielding a popular candidate in Bhoj Raj Adhikari and aligning with NC and Unified Socialist. Therefore, for Renu Dahal to win this time, she must not only protect the votes the Maoists received in previous elections but also increase them.\n\nThe question remains whether she can win the election by showcasing the work she has done in Bharatpur. There are many in this area who praise her for the development of the metropolis, such as bringing paved roads everywhere in the constituency and constructing six-lane roads.\n\nRSP, which became the first party last time despite not campaigning, has fielded Gautam who went there from Kathmandu, this time. In the case of Gautam, who has performed well in parliament and earned fame within the party, the strongest point is that the person who was active in Renu Dahal’s campaign during the metropolitan election is her husband.\n\nHe has field experience in this constituency. Many often say that Chitwan is a favorable ground for RSP. Moreover, Gautam might have been sent to Chitwan based on the assessment that the election can be won if a young candidate is fielded there.\n\nHowever, she faces the challenge of pulling votes from NC and UML and keeping new voters under her influence.",
        "url": "https://en.setopati.com/political/165862",
        "scraped_at": "2026-01-31T09:59:28.936947"
    },
    {
        "title": "Balen Shah draws huge crowd in Nepalgunj (with photos)",
        "tag": "Politics",
        "content": "Senior leader of Rastriya Swatantra Party (RSP) Balen Shah reached Nepalgunj, Banke, for the first time on Monday.\n\nA large crowd of people gathered to welcome him when he landed at Nepalgunj Airport. RSP leaders and cadres, including Khagendra Sunar, who is a House of Representatives candidate from Banke, reached the airport to receive Shah.\n\nThe police are finding it difficult to manage the escorting due to the crowd. According to Sunar's secretariat, Shah is heading to the Bageshwori Temple in Nepalgunj for worship. After that, he will travel westward via Kohalpur. He reportedly reached Nepalgunj with a plan to travel through Bardiya and reach as far as Kailali.\n\n\n\n",
        "url": "https://en.setopati.com/political/165858",
        "scraped_at": "2026-01-31T09:59:29.247359"
    },
    {
        "title": "Balen Shah has courage, integrity, and illegal arrogance",
        "tag": "Politics",
        "content": "Balen Shah's first political address in Janakpur, the capital of Madhesh, carries three significant messages.\n\nOne, for the first time, he publicly declared himself a \"son of Madhesh.\" Second, he did not just express support for federalism for the first time but also advocated for making provincial governments stronger than they currently are and bringing centralized powers from Kathmandu to the provinces. Third, in Janakpur—the land where Ram and Janaki married—he shared a plan to bring in 10 million tourists annually.\n\nIn this story, we critically analyze Shah’s socially established image by revolving around these three messages. We also critically examine his actions and performance as the mayor of Kathmandu Metropolitan City over the past three years. This analysis is necessary because Shah has begun his parliamentary political journey as a future prime minister of the country. When he joined Rastriya Swatantra Party (RSP) as a senior leader, his sole condition was that if the RSP wins a majority, he must be the prime minister.\n\nThis analysis is also vital because, although he has been tested through three years as mayor, many do not have clear information about who Shah is, what kind of person he is, his political ideology, or his vision for socio-economic transformation.\n\nMany say Kathmandu underwent a metamorphosis after he became mayor. They praise him, saying he achieved progress that Kathmandu had never seen before in a short three-year tenure.\n\nMany credit him for liberating Kathmandu from piles of garbage, expanding sidewalks to create a model city, enforcing rules and laws strictly, providing relief from dust and smoke, stopping public encroachments, building public parks everywhere, and ending irregularities in public schools.\n\nTo brand Kathmandu as having made unprecedented progress under Shah’s rule, his supporters have even nicknamed this cultural city \"Balen City.\" Many wonder: if someone could transform Kathmandu in just three years, what could they achieve for the country as prime minister? These voices come not only from people within Kathmandu but also those without.\n\nHowever, while saying this, we must not forget that much is hidden behind the black sunglasses he always wears. As we envision him as a future prime minister, it is essential to uncover what lies behind those glasses and evaluate his three years of work as mayor. This story is an attempt to know and introduce Shah personally and politically based on his performance over the last three years.\n\nThe Positive Side: Courage and Integrity\n\nBefore critically analyzing Shah's personality, let’s discuss his positive aspects. Shah’s most positive traits are his courage and his integrity.\n\nA structural engineer by training and profession, and a rapper by hobby, Shah is someone who had never done politics in his life. In Nepal, most leaders begin their careers in their student days. Many started their political journeys by participating in movements for democracy. In Shah's case, he neither did politics as a student nor participated in democratic movements. For someone who never did politics to enter the electoral field claiming he will become mayor of Kathmandu is no small feat of courage.\n\nHe also appears courageous because, unlike many other candidates in the mayoral race, he wasn't just contesting. He moved forward with a strategy to win. He and his team worked day and night to implement that strategy. He didn't have a large team. He didn't have the support of a whole party organization like other leaders do. He didn't have a mass of cadres to campaign for him.\n\nHe only had his close associate Kumar Ben (Byanjankar) and a few well-wishing friends. Three years ago, in an interview with Setopati, Kumar Ben said, \"We met 150 to 200 people a day starting five months before the election. We probably met 30,000 people directly in those five months. Sometimes we'd go to a neighborhood, sometimes a tea shop. We’d sit there and talk to local youths for hours. Shah would explain his vision to those youths.\" He continued, \"Since he was a rapper, he was already popular among the youth. When he stepped forward to talk, youths flocked to hear him. This made it easier to get our message across to the local community, especially the youth.\"\n\nSome youths voting for the first time would listen to Shah and say, \"Brother, our vote is for you. We will also try to convince our parents and siblings to vote for you.\" While visiting neighborhoods, Shah and Ben didn't just pick voters. They shared their plans with whoever they met. Some were from outside Kathmandu, living here as tenants. Those people would say, \"Brother, we can’t vote for you, but we will convince our landlords to vote for you this time.\"\n\nThus, Shah showed the courage to campaign by walking the neighborhoods, squares, and alleys of Kathmandu with fewer than a dozen well-wishers—and he won.\n\nFor an individual with no prior political or social image to believe he could defeat party representatives as an independent, and then to actually do it, is no mean feat. Initially, many thought Shah's attempt was reckless audacity, but he proved it was genuine courage. Shah is a living example of how much a person can achieve if s/he tries honestly.\n\nEven after winning and becoming mayor, he did not bow down to any leader of the old political parties. He made no compromises. Instead, throughout his tenure, he didn't give a damn to almost any leader of any party. At times, he even challenged them. In the municipal executive, where every representative was elected from a political party, he stood alone, defended his decisions solo, and fearlessly implemented them.\n\nEven when friction occurred with ward chairs on various issues during executive meetings, he never seemed to back down from his stance. There are many instances where he moved forward by convincing ward chairs to agree with his plans. Specifically, in the plan to remove parking from New Road to widen the sidewalk, he had a fallout with some ward chairs. He was criticized in executive meetings. New Road businessmen protested against him. But he didn't flinch out of fear that ward chairs would get angry or businessmen wouldn't support him. Instead, he rapidly advanced the work of widening the New Road sidewalk, the result of which is before us today. Kathmandu residents have praised this work highly.\n\nNot only this, despite being the independent mayor of just one of the 753 local levels across the country, Shah took public fights with political leaders across the country like an opposition leader, criticized Singha Durbar while taking responsibility for the country's mismanagement, and cursed leaders of both new and old parties as thieves on Facebook. Many have praised this behavior as rebellious and courageous.\n\nHowever, within this courage was a cocktail of unilateralism, audacity, and arrogance—the belief that there is no one else besides him and no one else can do it. His Facebook posts were heavily criticized. But Shah never learned from criticism or deleted his status out of fear. He treated what he spoke or wrote as absolute truth. He constantly sent the message: \"I am different from other leaders.\"\n\nThe pedestal that Shah is on today, his popularity among the common people, and his status as a heartbeat of the youth are largely due to that rebellion, courage, or audacity. Because of this, he became established in the eyes of society as a Messiah who wasn't afraid to expose veteran leaders. He became a hero who didn't bow to the parties or leaders the society viewed as corrupt, and criticized them sharply. He became sort of a sole savior to liberate Nepal from decades of corruption, bad governance, and irregularities.\n\nMost importantly, the way he is now contesting the election against the powerful CPN-UML Chairman and former Prime Minister KP Sharma Oli in Oli’s own political stronghold is also, in a way, his courage or audacity. He could have won easily had he contested from any constituency in Kathmandu. There is no doubt about that. But he chose Jhapa-5, the most difficult constituency in the country for him to win. Behind this choice lies a \"courageous\" ambition to become prime minister by defeating Oli and advancing as a national leader. He wants to establish his central-level politics by defeating the prime minister who was ousted by the Gen-Z Movement, using the strength of that same Gen-Z Movement.\n\nFor Shah, who is contesting a parliamentary election for the first time with only three years of mayoral experience, this is courageous in itself.\n\nAfter courage, financial integrity is his other strong suit. During his three-year mayoral tenure, Shah was not implicated in any form of corruption or financial embezzlement. There is no example of him serving his own interests when passing or rejecting plans. Because of this financial integrity, he made several decisions swiftly. At a time when cases of even small and big leaders being involved in corruption and financial transactions are made public daily, Shah has set a \"rare\" example that public work can be done without misappropriating a single paisa and one can be a leader without corruption.\n\nHis own party president Rabi Lamichhane is facing allegations of cooperative fund embezzlement. There are allegations that Lamichhane’s past personal financial life was not clean either. In comparison, there is no room to raise questions about corruption or irregularities against Shah. Shah has stood firm on this standard of good governance, which even the president of the newly emerged RSP could not establish. This integrity is one reason Shah is popular among the youth.\n\nHowever, as he joined the RSP as a senior leader, he has remained silent about the charges of financial embezzlement against President Rabi Lamichhane and the tens of millions of rupees in bail requested by four or five courts, while acknowledging the seriousness of those charges.\n\nOther Side of the Coin: Performance and Style\n\nThese were Shah's positive aspects, but there is another side to the coin. Just as there is a bright side to his performance and style of work, there is an equal dark side. Now, based on the three messages from his Janakpur address, let’s examine the flaws hidden in his personality.\n\nThe first message of the Janakpur address is linked to Balen Shah’s Madheshi identity. It is significant that Shah, wearing a white kurta-paijama with a gamchha on his shoulder and addressing the public in Maithili, declared \"I am a son of Madhesh.\" This is because he had not only kept this identity hidden until now but had also flatly denied it in interviews.\n\nHe never used the surname \"Sah\" commonly used by Madheshis. Instead, he used \"Shah,\" used by Thakuris or royalty. In a conversation with Setopati three years ago, he explicitly stated that he was not a \"Teli Sah of Madhesh\" but a \"descendant of the Suryavanshi King, a pure King.\"\n\nAt that time, Setopati had projected that Shah would be elected mayor of Kathmandu. In the third week of May 2022, while the victory was already certain and the final counting was underway, we had a long conversation with Shah. Countering public statements about his ethnic identity, he told us that day, \"I never wanted to link ethnic identity to my name. The people also never raised questions about my identity. This came up only after Keshav Sthapit (mayoral candidate from UML) said I was from Madhesh. After that, many called me a Teli Sah of Madhesh. I accepted it happily. Some called me a Thakuri of Jumla, I accepted that happily too.\"\n\nClarifying further, he said, \"I am not a Teli Sah of Madhesh. I am also not a Thakuri Shah of Jumla. I am not a Shah like former King Gyanendra. I am a descendant of the Suryavanshi royal family. I am the son of a pure King.\" There was intensity in his voice as he said this. His gestures seemed very agitated. When we asked how he knew this, he replied, \"It is in our genealogy.\"\n\nWhen asked if their history links to Simraungadh, he said, \"Older than Simraungadh. Older than King Harisinha Dev. Our kingdom included Mithila, Hetauda, Kathmandu, and many places here.\" While Shah said this with full confidence, he couldn't say for sure when we asked for more details about his genealogy. He said, \"It’s from a very long time ago. Before Prithvi Narayan Shah.\"\n\nThe details of the Suryavanshi royal family shared by Shah and the claim that they ruled Kathmandu, Mithila, and Hetauda do not align with our history. Lichchhavis called themselves Suryavanshi, but that is a history over a thousand years old. No one has been seen so far claiming to be of the Suryavanshi Lichchhavi clan. After that, no other Suryavanshi clan is seen to have ruled this region.\n\nAt that time, it was natural for Shah to hide his Madheshi identity as the mayoral candidate of the Newar-majority Kathmandu Metropolitan City. His close aides say he never identified as Madheshi even before entering politics. Especially when running for mayor of Kathmandu, there was no political gains to be made in identifying as Madheshi. Had he carried a Madheshi identity, he might have found it difficult to win the mayor's office.\n\nBut today, as he begins his parliamentary political journey from the capital of Madhesh, he needs that very Madheshi identity. This is because, compared to other provinces, RSP is currently weakest in Madhesh. It appears he is presenting that ethnic identity with pride to build a national leader persona, present himself as a future prime minister, contest against Oli in Jhapa-5, and bolster the RSP’s weak standing in Madhesh.\n\nThe topic of federalism mentioned in Shah's Janakpur address is linked to a political issue close to the heart and soul of Madhesh. This is an issue on which Madhesh province never compromises because federalism is a contribution of the Madhesh Movement. Two movements occurred in Madhesh to achieve federalism, and a third ensued against an \"incomplete Constitution\" when the Constitution was issued. About a hundred Madheshis were martyred in these movements. The two phases of the Madhesh Movement is a major reason the Constitution of Nepal embraced federalism.\n\nFor Kathmandu and other provinces, especially for the so-called upper castes like Brahmins and Chhetris, federalism might just be a political slogan. But for Madheshis, it is linked to their existence, their identity, and the blood shed for that identity. However, as the mayor of Kathmandu, Shah had not accepted federalism until now. Not only did he not accept it, but when he voted in the 2022 parliamentary elections, he only voted for the House of Representatives. He even refused to take the ballot paper for the provincial assembly.\n\nThus, for Shah—who had been denying the existence of the provincial government—to go to the capital of Madhesh and say that the provincial government must be strengthened and that \"one should go to Kathmandu for travel, not to ask for rights\" is meaningful in itself. Even more significant is that Shah started his parliamentary political campaign by laying wreaths at the statues of the Madhesh Movement martyrs who sacrificed their lives to establish the very provincial assembly for which he didn't even cast a vote in 2022.\n\nIt is unclear how much of Shah's presentation in favor of federalism is for electoral purposes, and how much he has genuinely grown to understand that federalism is needed in Nepal and accepted its political importance from his heart. This will only become clear from the policies RSP will adopt if Shah becomes prime minister or RSP comes to power in the future.\n\nThe third point of the Janakpur address connects to the romantic imagination Shah sold Kathmandu three years ago. He said in Janakpur, \"Hundred million tourists annually visit Ayodhya, the birthplace of Ram. Ten million tourists can also be brought to Janakpur, the land of Ram and Janaki (marriage).\"\n\nShah shared the dream of bringing 10 million tourists to Janakpur, but the annual figures for tourist arrivals in Nepal show how romantic this dream is. According to the Nepal Tourism Board, only slightly more than one million tourists enter Nepal annually. In this, the number of Indian tourists is about 300,000. Indian tourists mostly come to visit Kathmandu and Pokhara, while tourists from third countries mostly come for mountaineering and trekking.\n\nWith these figures in mind, claiming that 10 million tourists can be brought to Janakpur alone shows how fluffy the claim is. The majority of those who come to Janakpur are Indian tourists. When and how will the number of Indians be drastically increased from 300,000 to 10 million? What magic wand does Shah have that he can achieve the goal of 10 million at once by waving it?\n\nThe dream of 10 million tourists shown to Janakpur doesn't seem new if we remember the promises Shah made while contesting the election for mayor of Kathmandu. Three years ago, he sold similar romantic dreams and plans to Kathmandu. Kathmandu residents have not tasted most of the plans he announced back then. Some plans were so fantastical that they had no relation to practicality whatsoever.\n\nWe had even questioned him, citing examples from various countries, about how some of those plans were practically impossible. But he didn't accept that his plans were impossible to implement. Instead, he kept claiming, \"I will fulfill them anyway.\" None of the fantastical plans included in Shah's election manifesto have materialized. In his three-year tenure, he not only failed to start those plans but didn't even utter a word about them. He didn't provide an explanation as to why they couldn't be implemented.\n\nFirst among these is the waste management plan. Shah put forward short-term and long-term plans for waste management. He said, \"600 tons of waste is produced daily in Kathmandu Metropolitan City. 70% of it is biodegradable. My plan is to make organic fertilizer from such biodegradable waste and sell it not only within Kathmandu but also in districts like Dhading and Kavre.\"\n\n\"We can make money from this waste,\" he said, \"We can export organic fertilizer to Dhading and Kavre.\" In some television interviews, he even said this organic fertilizer could be exported nationwide, after which Kathmandu could eat pesticide-free vegetables, and the youth across the country would get jobs and wouldn't have to go abroad.\n\nWhere the Shah’s plan for organic fertilizer production and export in Kathmandu has reached, no one knows. No one knows whether he even made a small effort to implement this plan.\n\nNot only this, Shah had claimed in his election manifesto and in conversation with us that he would install incinerator machines to burn the remaining 30% of waste. This was an impossible plan to implement in itself.\n\nDiscussions had previously been held about placing similar incinerators at the Banchare Danda dumping site built to manage waste in the Kathmandu Valley. It wasn't implemented after environmental experts said burning waste in incinerators could lead to pollution problems.\n\nAccording to environmentalists, while making organic fertilizer from biodegradable waste is possible, burning it in an incinerator is a very complex process. This is because the waste collected in Kathmandu during the monsoon is wet. To burn it, the temperature must be around 1,000 degree Celsius. If the temperature isn't perfectly maintained, toxic gases harmful to health are emitted.\n\nWhile this plan is well-operated in countries like China and Singapore, it had been opposed in India due to pollution problems. India brought a plan to place about a hundred incinerator machines a decade ago. They were installed at some places but didn't work well. Problems were seen in such machines in various places in Delhi, and they were shut down. India's technical capacity is much stronger than ours. But if even they couldn't successfully use the method of burning waste, environmentalists' opinion was that using incinerators in Nepal on a whim could be fatal.\n\nWe had questioned Shah about the problems of installing incinerators, citing the failed experiments in Delhi and the arguments of environmentalists. Shah shrugged them off. \"It’s because Delhi didn't implement it properly. We can make such incinerators ourselves,\" he said. He was extremely confident in his opinion. He showed the confidence that we could easily do what Delhi couldn't.\n\nTechnical complexity is a harsh reality. Shah tried to generalize that harsh reality. This reflects his nature of not accepting facts contrary to his own and sticking to his own words, no matter how baseless his claims are. Ultimately, the confidence he showed by saying \"We will show how to do what Delhi couldn't\" proved to be just a water bubble. He didn't utter the word incinerator even once during his three-year tenure. He didn't make an effort to implement that plan in which he had shown extreme confidence. Had he tried and failed, one could say \"he tried, but couldn't\" but he didn't even try. He never admitted that what he said back then was wrong. He never brought up the subject again.\n\nRegarding waste management, Shah had said he would implement a system of keeping biodegradable and non-biodegradable waste separate in every household. He shared a plan where Kathmandu Metropolitan City (KMC) would send trucks on different days to collect these two types of waste. Though challenging to implement practically, this plan was possible. KMC had even issued a notice for this. Based on that notice, Kathmandu residents even started keeping biodegradable and non-biodegradable waste separate for some time. But the trucks to collect that separated waste never came. Shah never seemed serious about realizing a plan that was possible to implement.\n\nWe had discussed the practical difficulties of this with Shah three years ago during the conversation. We said it might be hard to form this habit suddenly. But he said with great confidence, \"Our citizens are very obedient. When told not to blow the car horn, no one did. If such people are told to keep biodegradable and non-biodegradable waste separate, they will surely obey.\" What Shah said was correct—the citizens of Kathmandu had obeyed. The irony is that he himself did not stick to and implement what he called upon the city residents to do.\n\nKathmandu's waste problem remains the same today as it was three years ago. But many are under the illusion that as soon as Shah arrived, the piles of garbage disappeared and the city suddenly became clean.\n\nThere is a reason for this illusion. A happy coincidence for Shahwas that the Banchare Danda dumping site, built by the federal government for the Kathmandu Valley, was ready exactly when he became mayor. That’s why the garbage piled up in Kathmandu before his arrival started being collected automatically and managed at Banchare Danda.\n\nBut because he didn't work to separate biodegradable/non-biodegradable waste as mayor, both types of waste are still being dumped together at Banchare Danda. This has caused the Banchare Danda dumping site to fill up. Had the biodegradable waste been separated and only non-biodegradable waste taken, Banchare Danda wouldn't have filled up so quickly. The problems of stench and pollution wouldn't have arisen. Because of that problem, Banchare Danda is still disgruntled with Kathmandu. The locals block the path of waste trucks from time to time. The day a dissatisfied Banchare Danda protests again as before, Kathmandu will again become foul-smelling with garbage. Shah has left this waste problem pending and shifted it onto the head of the mayor who follows him.\n\nShah had also announced he would have vehicles entering the city washed near Thankot to make Kathmandu dust-free and would continuously clean the city streets. Cleaning the streets wasn't a new task. As for the plan to wash vehicles entering Kathmandu, that has also not been implemented to date.\n\nTrue, in these three years, Kathmandu isn't shrouded in dust and smoke as before. Many have credited Shah for this too. But the real reason is that before he took charge, work on the eight-lane Ring Road expansion was happening rapidly. Work on laying the Melamchi project pipeline was also ongoing. That had shrouded Kathmandu and Lalitpur in dust. Once both those tasks were completed, a large portion of the dust naturally disappeared. Shah's contribution to this is zero.\n\nReturning the heritage and culture of Kathmandu's core city to its old form was also in Shah's plan. He said he would lay bricks instead of stones on the streets of inner settlements from New Road and Basantapur to Thamel and Thahiti. He also shared a plan to prohibit vehicles in inner settlements and encourage every household there to run businesses of local delicacies in front of them. He promised to increase spending for all festivals and guthis because of the lack of money to celebrate local festivals, and to create an environment where the whole of Kathmandu participates in these festivals.\n\nHe said, \"The Kathmandu I saw as a child is not what today's children get to see. Kathmandu has a distinct scent. With the aarati in the temples, the sound of bells, and the vibrancy of festivals, it feels as if music is always echoing through the city. I want to show today's kids the Kathmandu I saw when I was young. I want to introduce the world to the original scent of Kathmandu.\"\n\nHe shared a plan to build Kathmandu's heritage sites through public participation using local artisans, much like Bhaktapur has done. \"Temples and heritage have their own meaning. If a contractor brings in hired labor to do the work, that spirit does not remain alive. For this, you need artisans who understand the local art style. Therefore, heritage work must be done through public participation,\" he had said.\n\nHow successful these plans were, and how much they failed, is clear before us.\n\nYes, he took the initiative to increase the budget for Kathmandu's festivals. He assisted in reconstruction of some guthi buildings. He extended a helping hand on behalf of the metropolis to celebrate festivals. However, the start of this work was actually made by his predecessor Bidya Sundar Shakya. Shah merely continued it.\n\nThe work of culture and heritage conservation in Kathmandu is not particularly extraordinary as evidenced by the work done by Mayor Sunil Prajapati of Bhaktapur Municipality and Mayor Chiri Babu Maharjan of Lalitpur Metropolitan City. Even today, compared to the Basantapur Durbar Square area, Patan’s Mangal Bazar Durbar Square and Bhaktapur Durbar Square are far more beautiful and authentic. Even people from Kathmandu say \"Wow\" when they visit Mangal Bazar in the evening. They are mesmerized if they go to Bhaktapur on holidays.\n\nIn terms of core-city conservation as well, Patan and Bhaktapur are far ahead and much more enriched than Kathmandu. Bhaktapur has even revived Malla-era architecture in private houses within the core city. This work could have been done in Kathmandu as well. While Shah has enriched the culture and heritage of this federal capital city, Patan, Bhaktapur, or Bungmati have become equally, if not more, enriched.\n\nShah had also put forward traffic management plans. His plan was to lease department stores and malls that were running at a loss and convert them into multi-story parking lots. For traffic management, he said he would also shift the opening and closing times of various offices. \"Right now, Kathmandu wakes up all at once and tires all at once. If this schedule is changed and all schools open by 8:00 in the morning, then school buses would have already dropped off students and returned to their places before that. Two hours after that, government offices would open. After that, if markets, shopping complexes, New Road's gold shops, and clothing stores open only around noon, the traffic problem would be solved to some extent,\" he had said.\n\nSimilarly, he claimed that if Information Technology (IT) companies and other similar offices opened only around 2:00–3:00 in the afternoon, the traffic pressure would ease. This was the Balen-vision to keep the city awake until late at night. To keep the city awake, he said he would arrange security by adding more city police and monitor the city round the clock by installing tens of thousands of CCTV cameras.\n\nBut Kathmandu still wakes up at its own pace and sleeps at its own pace. Neither did the city's schedule change as Shah said, nor could this city stay awake all night.\n\nAnother major problem in Kathmandu is public transport. People are forced to travel in crowded dilapidated vehicles. Shah had announced a way to solve this as well. His plan was to bring all public vehicles under one company and have that company operate vehicles as a single brand. He said that by doing this, a prepaid-card system could be implemented, and by paying daily, weekly, or monthly, one could travel throughout the city with a single card. \"The metropolis itself will promote electric vehicles,\" he had said. \"Existing entrepreneurs involved in public transport will also be encouraged to retire old vehicles and buy electric ones.\"\n\nHow much the Balen-plan to improve the public transport system was fulfilled is well known to the residents of Kathmandu. Even those who only come to visit Kathmandu have experienced it.\n\nOne very good piece of work done during Shah's tenure is the expansion of sidewalks in various parts of the city, including New Road. I have already mentioned above how he even fought with ward chairs to expand the New Road sidewalk. Beyond that, the Kathmandu metropolis has made good progress in the plan to widen the sidewalks of other major roads and pave them with patterned bricks. This is the biggest achievement of Shah's three-year tenure. However, similar achievements have also been made by Lalitpur and Bhaktapur.\n\nRunning a campaign to remove roadside parking and emphasizing underground parking are also positive works by Shah. Similarly, he has implemented programs such as providing scholarships to students in Kathmandu's schools and providing skill development training. Our law states that scholarships must be given to poor and marginalized students. In the past, this law was not properly implemented. Now, after even private schools came under the local level according to the law, Shah implemented this effectively in Kathmandu. And, compared to other local levels, he made good progress.\n\nWhen talking about whether development has happened in Nepal, financial resources should also be considered. After the country moved to a federal structure and the local levels became empowered, local governments across the country have made good progress in physical infrastructure. Especially in metropolises and municipalities, exemplary works such as tidying up sidewalks, building gardens along the roadside, and urban sanitation have happened throughout the country. Some rural municipalities have also made good progress in education, health, and other areas. The office buildings of local levels across the country have become much better than before.\n\nTherefore, from the perspective of urban infrastructure, saying that extraordinary work was done within Kathmandu during Shah's tenure would be an exaggeration. Looking at the ratio of resources and means, the Kathmandu metropolis actually did much less work compared to the budget it had. In its capacity as the federal capital, Kathmandu has no shortage of development budget. Billions in budget sit idle because work cannot be done. This is not a problem that started after Shah became mayor to be fair. It has existed since before that.\n\nBut a mayor like Shah, who came with fantastical plans and claimed to have good knowledge of development and construction as a structural engineer, also could not increase development spending. Compared to other metropolises in the country, Kathmandu is the one that spends the least of its development budget. In the year Shah started his tenure, the capital budget of KMC was Rs 14.48 billion, of which only Rs 3.75 billion was spent. In the same year, Lalitpur spent Rs 2.53 billion out of a Rs 5.11 billion budget, while Bharatpur spent Rs 2.34 billion out of a Rs 3.18 billion budget.\n\nKathmandu does not seem to have made much progress in capital expenditure even by the last fiscal year 2024/25. During that period, Kathmandu spent only Rs 6.73 billion out of a Rs 15 billion budget. In comparison, data shows Lalitpur spent Rs 2.70 billion out of a Rs 4.5 billion budget, while Bharatpur spent Rs 1.68 billion out of Rs 2.72 billion.\n\nDuring our conversation with Shah three years ago, we raised many questions about the development plans he brought. Shah gave answers to every question without hesitating. He spoke as if he had the answer to all questions. Not all the answers or arguments he gave us were correct. But he seemed absolutely confident in the answers he gave. A person who knows is good, but sometimes a person who knows too much or knows everything is not very good. Shah has gone on to prove this during his three-year tenure.\n\nThe darkest side of Shah is that he shows inhumane arrogance backed by power. There are dozens of examples of the inhumane arrogance he has shown as the mayor of Kathmandu. He has shown such arrogance equally toward the rich and the poor, and he has also shown it toward his rivals.\n\nLet's first talk about the inhumane suppression of street vendors in Kathmandu during his three-year tenure. In the last three years, under Shah's direction and the leadership of Raju Pandey, whom he appointed the Kathmandu City Police Chief, the carts of small businesses trading on the roadsides were chased and seized. Many such videos are viral on the social media. The people of Kathmandu directly saw and experienced those incidents, and people outside Kathmandu can still watch such videos on the social media.\n\nSome scenes of the crackdowns Shah carried out on small and subsistence businesses selling vegetables, food, and miscellaneous items are heartbreaking. Those vendors plead with folded hands and shed tears, but their efforts are futile against the inhumanity of the city police. Shah left no stone unturned in displacing the street vendors, who had come to the capital city for their livelihood, by uprooting their carts and the foundation of the business they had built upon them.\n\nWatching those videos, Shah seems like a sadist who is making the poor living in Kathmandu cry. And he is killing the harmonious, inclusive, and participatory civilization of Kathmandu. Those videos also reflect the pride and ego that has blossomed in Kathmandu's city police, who threaten citizens by pointing fingers right at their faces. They push and shove citizens. They engage in scuffles with them. The source of this level of arrogance and ego in the city police is Shah himself, who never showed any pity, love, or sympathy toward those street vendors.\n\nTwo types of economies run in parallel in any city. One is the economy of the affluent class who shop in big malls and department stores. The other is the economy of the lower-middle class and the poor whose consumption needs are met cheaply through street vendors. By seizing the carts of street vendors and making them jobless, Shah was attacking not only their livelihood but also the lives of all the lower-middle class and poor people living in Kathmandu.\n\nA great irony of life for Kathmandu's street vendors is that the Mayor Shah sitting in the revolving chair of the metropolis did not understand the value of their struggle, their compulsion, and their tears which the rapper Shah understood.\n\nBefore coming into politics, Shah sang many raps. Among them, one rap created hiss image—\"Garibko Chameli boldine kohi chhaina. (There is no one to speak for the poor's)...\" Created by the Ralfa group during the political movement against the Panchayat regime, this song carries the sentiment of liberating the poor from centuries of poverty and oppression. Shah brought that fire against poverty and oppression to the new generation through rap. Perhaps that also helped him reach the chair of the Kathmandu metropolis.\n\nBut Shah's actions as mayor sought to free Kathmandu city not from poverty, but from the poor. His campaign killed the soul of Kathmandu city, which for centuries had been giving shelter and hope of survival to the poor. Lately, the crackdown on street vendors has decreased. The reason for this is not a sense of compassion that blossomed in Shah, but the voice raised in favor of street vendors by some social activists like Iih. It is the voice continuously raised by the media. It is the movement launched by the street vendors themselves against the KMC. Because of that movement, a rule has now been set where street business in Kathmandu can be done early in the morning and after 9:00 in the evening.\n\nEven for such a simple thing, Shah caused many to shed tears for three years, snatched away many people's livelihoods, and kicked many in the stomach. Meanwhile, this very rule already existed in Lalitpur, Bhaktapur, and other local levels.\n\nAnother inhumane arrogance shown by Shah was taking bulldozers to uproot the shacks of squatters. There is no doubt that fake squatters, who have illegally encroached on the riverbank land, should be removed. But displacing genuine squatters in the name of removing the fake ones is not justifiable. As the mayor of Kathmandu, Shah ignored the method and process of distinguishing between genuine and fake squatters. And in the spirit of \"I am the court, I am the state, I am the one to give justice, and I am the one to punish,\" he tried to crush the entire squatter settlement under bulldozers.\n\nAlmost all metropolises in the country have a squatter problem. All metropolises have genuine and fake squatters. To solve this, it is necessary to distinguish who are squatters and who are not. For that, data collection must be done by going into the squatter settlements. That is the responsibility of the metropolis, not anyone else. In Kathmandu's case, it was Shah's responsibility. The state has made a policy to identify genuine squatters and manage their housing. The state has accepted that it has a responsibility toward them. From the perspective of social justice, this is a fundamental responsibility of the state.\n\nToday, many metropolises/municipalities, including Bharatpur and Surkhet, have moved forward in solving the problem by collecting data on squatters. Kathmandu, however, is not yet ready to collect data on squatters. Its stance is—since all are encroachers, data will not be collected. Shah insisted that everyone should be removed using bulldozers and police through use of force, even if it meant a bloody clash. He tried that many times. Every time Kathmandu Metropolis was forced to pull back after a confrontation with the squatters.\n\nIt’s not that Shah didn't sign an agreement with the Land Commission to solve the squatter problem. He did it at the beginning of his tenure. But later, he himself backed away from the agreement he had signed. He became intent on cursing leaders and misleading the public by saying he stepped forward because the state did nothing to identify squatters. No one has the liberty to curse others without doing their own work and to mock the policies and laws of the state. Not even Balen Shah.\n\nHe showed such arrogance that he harbored a grudge against the Singha Durbar because police were not provided to use force against squatters. At one point during his three-year tenure, he had instructed to stop collecting garbage from the Singha Durbar and the President's Office. Giving notice of stopping garbage collection, he wrote on his Facebook handle, \"From today, garbage from Singha Durbar will not be collected. If the country really needs to be cleaned, the leaders there need to be dumped in Sisdol (dumping site).\"\n\nBoth that expression and action by Shah were irresponsible and anarchic. It had mocked the limits of official dignity. A person sitting in a public position must fulfill her/his responsibility and maintain the dignity of that position. Simultaneously, a person in a public position must also care for the dignity of others. Saying everyone in Singha Durbar is a \"thief\" and deserves to be thrown in Sisdol was nothing more than Shah's ego and eccentricity.\n\nWhether it is Singha Durbar or Bag Durbar (the KMC office), the leaders who sit there have weaknesses as well as strengths. The people elect and send them to both these places. The people's expectation is that everyone should work together by staying within their own limits and dignity, and then solve the country's problems. Shah, however, showed a psychological ailment of thinking only he is right and everyone else is \"fit to be thrown in Sisdol.\"\n\nHe has the right to criticize others' work, can suggest \"let's do this,\" and can even extend a hand, but he cannot run away from his responsibility by cursing others and piling blame on others. At that time, while defending his decision not to collect Singha Durbar's garbage, he had published a list showing how 14 ministries of the federal government did not cooperate with him in various tasks. The majority of the issues he raised were not within his jurisdiction. As a citizen and mayor, he may have a concern in them, and he can speak and give suggestions on them, but he cannot stop the garbage collection of the Prime Minister's Office and the President's Office because others did not cooperate in a matter that was not even his responsibility.\n\nJust as it would be inconceivable and irresponsible for the federal government to stop the budget going to Kathmandu metropolis or not send employees because the mayor did not cooperate, it is equally inconceivable and irresponsible for the metropolis to not collect the garbage of the prime minister's and president's offices. Balen Shah had done such inconceivable things during his tenure.\n\nIf the country's problems were to be solved by a \"magic trick\" as Shah says, and if everything would be fine just with the right intention, why do many problems that the KMC itself could solve remain unresolved today? Has Shah resigned after finishing all the work that the KMC could do in the last three years?\n\nNow let's talk about the arrogance Shah showed in excavation of the Tukucha stream in Kathmandu. During his tenure, the Kathmandu metropolis operated bulldozers on houses from the Jai Nepal Cinema Hall at Hattisar to the Kathmandu Plaza to excavate the underground portion of Tukucha flowing inside a brick-dome-style tunnel 15 feet below the ground level. Tukucha is not visible on the surface after it emerges from the Narayanhiti Palace Museum premises. It only emerges after flowing underground to reach under the Kathmandu Plaza on Tridevi Marg. In the intervening approximately 500-meter section, Tukucha flows underground.\n\nWhile excavating this underground section of Tukucha, Shah created a narrative that land mafias filled the stream and built physical structures. Based on that narrative, he operated illegal bulldozers even on houses that were bought according to the law and built by getting design maps passed by the metropolis itself. That step by Shah was stopped by the Supreme Court which ruled it illegal. At that time, Shah not only had the audacity to operate bulldozers on the houses of those living legally, but he also ignored a historical fact of Kathmandu city.\n\nThis underground section of Tukucha was not built by any land mafia. No individual or group could dig such a dome-style tunnel and make a stream flow through it. This is not possible without state involvement. Shah either did not accept or did not want to accept even such a small thing.\n\nThe historical reality of that underground section of the Tukucha stream is that it was commissioned by Rana prime minister Bir Shumsher in 1892. Bir Shumsher had the Tukucha stream flow underground and built an open courtyard (patangini) over it. The design and construction of the approximately 500-meter tunnel structure were done by the then engineer Jogbir Sthapit. The Archaeology Act also prohibits digging up or demolishing archaeological structures built during the Rana era. Shah mocked this law to show his power and arrogance.\n\nNot only this, he also sold a fantastical plan to demolish the Tukucha tunnel, open the stream, and build a park around it. To implement that plan, at least 50 houses would have had to be demolished, the cost of which was very high. The KMC itself had said structures worth Rs 6 billion would have to be demolished.\n\nWe can say Shah showed meaningless arrogance in Tukucha also because during his tenure, he never worked on cleaning the Bagmati, Bishnumati, Dhobikhola, and other rivers, and freeing them from sewage. Shah never even said he would implement the Bagmati river cleaning plan that Kathmandu has been hearing about in the past. If the intention was indeed to restore Tukucha, then out of the approximately six kilometers of Tukucha, 5.5 kilometers are already open. The water in places where it was possible could have been cleaned leaving aside the digging of the underground tunnel. His plan to build a park and have boat rides in the remaining possible places, leaving the Hattisar area, could have been implemented. After showing work in those places and having clear water flow there, the KMC could have finally won everyone's trust.\n\nBut leaving aside all the work of river restoration that could be or should be done, Shah remained fixated on the obstinacy of clearing that 500-meter section of Tukucha. He remained fixated until the Supreme Court itself stopped him. Not just in Hattisar, he demolished houses built with approval from the state and the metropolis in many places in Kathmandu without compensation and without the consent of those homeowners. Before operating a bulldozer in a place where someone was living or doing business, he did not even give a chance for a legal appeal. He showed an illegal arrogance of not following any method, law, institution, or process and not respecting anyone but himself.\n\nThe peak of Balen Shah's arrogance was reflected when he gave a threat on social media to \"set the Singha Durbar on fire\" after traffic police stopped a vehicle his wife was riding in. This incident happened on September 2, 2023. It was a Saturday. Around 9:00 in the evening, after seeing a vehicle with a government number plate speeding from Balkumari, Lalitpur, toward Koteshwor, the traffic police on duty stopped it. Those traffic police inquired, saying, \"Are you carrying a permit to drive a government vehicle on a holiday?\"\n\nThat was a routine traffic check. During that process, after finding out that the wife of Kathmandu mayor Balen Shah was riding in the government vehicle, the traffic let the vehicle go. Even the number of the government vehicle moving on a holiday was not noted.\n\nIn that fit of rage, Shah vented his anger on the social media that night: \"Nothing happened for today. But from tomorrow, if any vehicle of our metropolis is stopped by the government, I will set Singha Durbar on fire. Remember, thief government!\"\n\nLooking back, that was when the seed of the idea that the Singha Durbar could be set on fire, or even should be, was planted in the minds of the common people.\n\nAfter the vehicle his wife was riding in was stopped, Shah had called the then Chief District Officer of Kathmandu Jitendra Basnet that very night and inquired about the reason for checking the KMC vehicle. Such an intention that no one should ever stop a KMC vehicle on the road is itself the height of arrogance. Traffic police on duty have the right to stop and inquire about all vehicles. If common people's vehicles are stopped, and if other government vehicles moving on a holiday are stopped, there is no reason to give an exemption to a KMC vehicle.\n\nIn such a case, far from apologizing in his capacity as a responsible people's representative, Shah instead had the audacity to call the government a \"thief\" and threaten to set the Singha Durbar on fire. Who gives such an eccentric expression just because the vehicle his wife was riding in was caught in a traffic check? What kind of personality gives it? Doesn't it clearly show how much power-driven arrogance was riding in the mind of the person giving such an expression?\n\nIn the matter of showing arrogance, Shah did not spare even his own employees. He had harbored a grudge against the then chief administrative officer of KMC Saroj Guragain over the design approval of the Kathmandu Tower under construction at the Old Bus Park. After the dispute escalated, he prohibited Guragain from entering the office. Shah's allegation was that Guragain committed corruption while passing the design map for Kathmandu Tower. That was only his personal allegation. It had not been confirmed by any investigation. The federal government did not accept that allegation. Since it was not proven that corruption was committed by Guragain, the federal government's stance was that he should be returned to work.\n\nWhen Setopati investigated the Kathmandu Tower design map approval case, it was found that Shah himself as mayor had given approval to pass that map. Shah himself had signed the decision regarding the approval. According to the initial agreement, Kathmandu Tower should have been built by 2019. But the fact that the map for Kathmandu Tower, which was being built with repeated time extensions, had not even been passed was found only when Shah entered the KMC after being elected mayor.\n\nAfter finding out the design map was not passed, Shah slapped a fine of Rs 500,000 on the contractor Jaleshwor Swachchhand Bkoi JV on December 18, 2023. At that time, along with the fine, a decision was also made to grant map approval for Kathmandu Tower by paying the fee according to the law. Shah himself had signed the decision.\n\nThus, by creating a dispute over a map he himself had signed and accusing his chief administrative officer Guragain of corruption, Shah did not let him enter the KMC premises. After works ranging from the salaries of KMC employees to development and construction came to a standstill because of this, ward chairs and employees allowed Guragain to enter the metropolis office against Shah's instruction.\n\nAt that time, to prevent Guragain from entering the office, Shah had deployed a team of city police under the leadership of his confidant Raju Pandey on the KMC office premises. Ward chairs and employees, however, reached the office chamber from the office premises by pushing and shoving with the city police while escorting Guragain. Deputy Mayor Sunita Dangol also provided support and backing in this.\n\nDangol started the meeting with the chief administrative officer after Mayor Shah failed to show up. She urged Shah to seek a solution through discussion by coming to the meeting rather than sitting in his room.\n\n\"The chief administrative officer has come to report for duty after being sent by the ministry,\" Deputy Mayor Dangol had said. \"It is not a good thing that clash ensues when he comes to report for duty. A fight among employees is not a good thing.\"\n\nStating that all people's representatives are aware of every sequence of events, she also urged the mayor not to give instructions while sitting in his room. \"We have to watch this spectacle?\" she said. \"If it is the mayor's order, the mayor must come forward. Otherwise, one cannot give orders sitting in a room.\"\n\nIn this same incident, Dangol had scolded the then KMC police chief Raju Pandey, asking \"Are you accountable to the mayor or also to the KMC?\"\n\nThe most recent example of Shah's arrogance and habit of not respecting anyone but himself was seen last November, when Prime Minister Sushila Karki invited the mayors of the Kathmandu Valley to Baluwatar for a collective talk. Shah did not participate in that discussion. Not only this, Shah participated in the meetings of the \"Mayors' Forum\"—which was formed to solve the problems of the Valley through collective discussion and to exchange experiences—a total of only three times throughout his tenure. He even left one meeting midway. This means that during his tenure, he did not really consult and cooperate with other local level heads of the Valley. Meanwhile, some of Kathmandu's problems are impossible to solve without cooperation with other municipalities of the Valley.\n\nThus, if one examines the three-year tenure as mayor of Kathmandu, Balen Shah seems afflicted with a mindset that everything he sees and thinks is right and everything others think and say is wrong. And that he is right and everyone else is wrong. Any leader must have courage and integrity, which Shah has. But a leader must have many other things besides courage and integrity. Along with courage and integrity, a leader must also have tolerance, equanimity, and judicial wisdom.\n\nAt the beginning of his first political address in Janakpur, Shah gave a glimpse of his informal rapper style by throwing a \"flying kiss\" toward the audience eager to see and hear him. The younger generation is a fan of this style. With this style, he has settled in the hearts of the youth and become their heartbeat. A glimpse of his popularity was seen not only in the Janakpur program but also when he went to register his nomination papers in Jhapa-5.\n\nSeen walking rapidly without giving a damn to anyone in his well-known style amidst the surging crowd, Shah discussed with voters of Jhapa the next day and took photos. Youths seemed eager to shake hands with him, take photos, hear his words, and tell him their words. One old man even gave Shah a \"kiss of love.”\n\nWhether the current political attraction seen toward him will bring RSP to power and make him prime minister will be known only after the election. More important than that is—what kind of leader will Shah become after the election? Will he move forward unilaterally, riding on courage, audacity, pride, and overconfidence as before, or will he also bring tolerance, equanimity, and judicial wisdom into his nature along with courage and integrity? Will he walk the humble path of dialogue, cooperation, and compromise needed with his opponents and other political parties in central politics? Will he show illegal arrogance of not following any system, law, institution, or process and not respecting anyone but himself? Shah's political future will be decided by this.",
        "url": "https://en.setopati.com/political/165854",
        "scraped_at": "2026-01-31T09:59:29.577769"
    },
    {
        "title": "Baburam Bhattarai withdraws candidacy from Gorkha-2",
        "tag": "Politics",
        "content": "Baburam Bhattarai has withdrawn his candidacy from Gorkha-2 on Tuesday.\n\nRastriya Swatantra Party (RSP) General Secretary Kabindra Burlakoti and Lekhnath Neupane of Nepali Communist Party are also candidates there.\n\nBhattarai was a candidate from the Progressive Democratic Party in Gorkha-2. Bhattarai was contesting for the fourth time having won elections in 2008, 2013 to 2017.\n\nBhattarai announced withdrawal of his candidacy through the social media. According to the Election Officer of Gorkha-2, Mohan Belbase Bhattarai submitted an application for withdrawal of his candidacy through his representative Narayan Khatri. Previously, RSP President Rabi Lamichhane and Vice President Swornim Wagle had requested Bhattarai to withdraw his candidacy and support the party in Gorkha.\n\nRSP President Lamichhane requested Bhattarai, who has been consistently winning elections from there, to support the party’s General Secretary Kabindra Burlakoti this time. According to Burlakoti, Lamichhane called Bhattarai to make the request. \"Bhattarai is a voice for change. He has always stood firmly in favor of transformation. At a time when the country is on the threshold of change, RPP president has requested Bhattarai, both personally and institutionally, to support us this time by withdrawing his candidacy,\" Burlakoti said.\n\nBurlakoti is a candidate from that constituency for the second time. Burlakoti was defeated by the then Chairman of CPN (Maoist Center) Pushpa Kamal Dahal in 2017.\n\nRSP Vice President Wagle also requested Bhattarai through the social media to withdraw his candidacy expressing hope that Bhattarai can fulfill a role of senior guardian in guiding RSP as a former prime minister.\n\nWagle stated that the RSP-led federal government that could be formed after the election has much to learn from his experience in the political-administrative, good governance, and development-related transitional management.",
        "url": "https://en.setopati.com/political/165844",
        "scraped_at": "2026-01-31T09:59:29.904045"
    },
    {
        "title": "RSP seeks support of Baburam Bhattarai in Gorkha",
        "tag": "Politics",
        "content": "Rastriya Swatantra Party (RSP) has sought the support of Baburam Bhattarai in Gorkha-2.\n\nBhattarai is a candidate from the Progressive Democratic Party in Gorkha-2. Bhattarai is contesting for the fourth time this time having won elections in 2008, 2013 to 2017.\n\nRSP President Rabi Lamichhane has requested Bhattarai, who has been consistently winning elections from there, to support the party’s General Secretary Kabindra Burlakoti this time. According to Burlakoti, Lamichhane called Bhattarai to make the request. \"Bhattarai is a voice for change. He has always stood firmly in favor of transformation. At a time when the country is on the threshold of change, RPP president has requested Bhattarai, both personally and institutionally, to support us this time by withdrawing his candidacy,\" Burlakoti said.\n\nBurlakoti is a candidate from that constituency for the second time. Burlakoti was defeated by the then Chairman of CPN (Maoist Center) Pushpa Kamal Dahal in 2017.\n\nRSP Vice President Wagle has also requested Bhattarai through the social media to withdraw his candidacy expressing hope that Bhattarai can fulfill a role of senior guardian in guiding RSP as a former prime minister.\n\nWagle stated that the RSP-led federal government that could be formed after the election has much to learn from his experience in the political-administrative, good governance, and development-related transitional management.",
        "url": "https://en.setopati.com/political/165843",
        "scraped_at": "2026-01-31T09:59:30.207135"
    },
    {
        "title": "UML, RPP candidates apply to withdraw candidacies in Manang",
        "tag": "Politics",
        "content": "CPN-UML and Rastriya Prajatantra Party (RPP) candidates from Manang have submitted applications to withdraw their candidacies for the upcoming House election.\n\nAccording to Chief Election Officer Ram Prasad Paudel, UML candidate Polden Chhopang Gurung and RPP candidate Kubi Singh Gurung submitted their withdrawal applications a short while ago. \"They submitted applications a while ago requesting to withdraw their candidacies. Those applications have been registered, and a decision will be made regarding this after one in the afternoon,\" Chief Election Officer Paudel told Setopati.\n\nThe deadline for withdrawing candidacies finishes at one Friday afternoon.\n\nNC and UML candidates decided whose candidacy would stand by drawing lots.\n\nAccording to UML Vice Chairman Prithvi Subba Gurung, NC candidate Tek Bahadur Gurung and UML candidate Polden Chhopang settled candidacy for the federal parliament and provincial assembly by drawing lots.\n\nHe stated that the UML has not received formal information regarding this. \"We have heard that candidacies for the federal and provincial levels were finalized by drawing lots. The party has no formal information, and this was not done under the party's instruction. It could be a matter of mutual understanding between the two candidates. We are looking into this,\" Gurung told Setopati. \"After I found out about this, I told him not to do so.\"\n\nThere are two seats in the provincial assembly in Manang. One of them is vacant. The seat of Rajiv Gurung, who ran as an independent candidate in 2022, is vacant following an order from the Supreme Court. Although the Election Commission had set a date for the election, it was later postponed.\n\nAccording to UML leaders in Manang, there is an understanding that NC will support UML in two constituencies in the upcoming provincial assembly elections.\n\nMeanwhile, it has not yet been known why the RPP candidate submitted an application to withdraw his candidacy. RPP Spokesperson Mohan Kumar Shrestha stated that the party has no information as to why the party's candidate in Manang applied to withdraw the candidacy.",
        "url": "https://en.setopati.com/political/165842",
        "scraped_at": "2026-01-31T09:59:30.527905"
    },
    {
        "title": "United beats Arsenal for 4th win in row",
        "tag": "Sports",
        "content": "Remember that time, not so long ago, when there was a crisis at Manchester United?\n\nAfter four straight wins, it seems like a dim and distant memory.\n\nThe latest sign that United is well on the road to recovery came on Sunday with a 3-1 win over Arsenal, whose 100% start to the season came crashing to an end.\n\nThere were still anti-Glazer chants inside and outside Old Trafford — it feels like they are here to stay, whether the team wins or loses — but they are now accompanied by frequent and jubilant roars for goals.\n\nTwo of them were scored in the second half by Marcus Rashford to sweep United to victory after Arsenal pulled it back to 1-1 through Bukayo Saka, but the opening goal felt the most significant.\n\nAntony, United’s latest big signing from Ajax for $95 million, marked his first match in English soccer with a goal from a curling, first-time finish in the 35th minute, crowning a performance that featured a slew of jinks, feints and exaggerated stepovers that thrilled home fans. He came off in the 58th to a standing ovation to be replaced by Cristiano Ronaldo, who again had to settle for a starting spot on the bench.\n\nSince that humiliating 4-0 loss at Brentford that sparked a crisis and some doubts around the wisdom of hiring Erik ten Hag as manager, United has beaten Liverpool, Southampton, Leicester and now Arsenal, the league leader.\n\nAfter six games, United is only three points behind Arsenal and two behind Manchester City, the title favorite.\n\nHow quickly things have turned around.",
        "url": "https://en.setopati.com/sports/159515",
        "scraped_at": "2026-01-31T09:59:30.850222"
    },
    {
        "title": "Haaland hailstorm hits EPL, Gunners continue perfect record",
        "tag": "Sports",
        "content": "Erling Haaland is taking English soccer by storm.\n\nBack-to-back hat tricks. Nine goals in five games. No player has ever made as good a start to the Premier League as the towering Norway striker.\n\nHaaland’s latest three-goal haul came in the first half of City’s 6-0 thrashing of Nottingham Forest on Tuesday, three days after achieving the same feat in the second half against Crystal Palace.\n\nCity was banking on Haaland being the heir to long-time striker Sergio Aguero and it’s already looking as if that is the case.\n\nAguero previously held the record for most goals in a player’s first five Premier League appearances, with eight along with former Coventry striker Mick Quinn (from the early 1990s). Haaland has bettered that, and surely more scoring records will fall if he continues like this.\n\nFor example, can he become the first player to score 40 goals in a single top-flight campaign in England since Tottenham’s Jimmy Greaves in 1960-61?\n\n“What Haaland wants is to win titles,” Guardiola said of the striker who scored with his left foot, right foot and head against Forest. “Knowing him, he would not be happy to break records if we don’t win titles.\n\n“Sergio is a legend — no one can break his position in the hearts of Man City fans. But Erling has the quality to be there.”\n\nCity is the red-hot favorite to win the Premier League again with Haaland leading the line and is unbeaten with four wins from five games.\n\nEven its back-up striker is scoring, with Julian Alvarez — an offseason arrival from River Plate — marking his first start with two goals in the second half. Joao Cancelo also scored with a blast from outside the box.\n\nStill, the champions aren’t top. That honor remains with Arsenal.\n\nPERFECT START\n\nArsenal has matched its best ever start to a Premier League season after securing a fifth straight win to open the season by beating Aston Villa 2-1.\n\nGabriel Martinelli’s 77th-minute goal clinched victory at Emirates Stadium after Arsenal was pegged back by conceding a goal straight from a corner by Douglas Luiz, who did the same in an English League Cup match last week, too.\n\nThat came against the run of play, with Arsenal dominating the game but only having Gabriel Jesus’ 30th-minute goal — his third of the season — to show for it.\n\n“That is the spirit we need to keep for the whole season,” Martinelli said.\n\nVilla has lost four of its five games, leaving manager Steven Gerrard under pressure.\n\nLATE, LATE GOAL\n\nLiverpool is battling hard to keep up with the fierce pace set by Arsenal and City, needing a goal in the eighth minute of stoppage time by Fábio Carvalho to claim a dramatic 2-1 win over Newcastle.\n\nAlexander Isak gave Newcastle the lead in the 38th on his debut following a move from Real Sociedad on Friday for a club-record fee and was denied a second goal by narrow offside call.\n\nRoberto Firmino swept in a finish from Mohamed Salah’s cross to equalize before a penalty-box melee following a corner saw the ball pop up off the shoulder of Salah, and Carvalho — a summer signing from Fulham — reacted quickest to smash into the roof of the net.\n\n“I am not sure everyone in the stadium kept believing but from now on we have to,” Liverpool manager Jurgen Klopp said. “What a wonderful goal from the little one.”\n\nIt was a second straight victory for Liverpool, which opened the season without winning any of its first three games.\n\nSPURS UNBEATEN\n\nTottenham remained unbeaten after a 1-1 draw at West Ham, for whom club-record signing Lucas Paqueta missed a chance to score a late winner on his debut.\n\nWest Ham manager David Moyes said before kickoff that Paqueta had not so much as passed a ball to his new teammates after only completing his 52 million pound ($61.6 million) switch from Lyon on Monday.\n\nWith four minutes remaining, Vladimir Coufal pulled the ball back and Paqueta — on as a 67th-minute substitute — got in a mix-up with fellow new signing Emerson Palmieri as they left the ball to each other, 10 meters from goal, instead of taking a shot. Moyes fell to his knees on the touchline.\n\nAn own-goal from Thilo Kehrer gave Tottenham the lead before Tomas Soucek equalized.\n\nIn the other game, Bournemouth drew 0-0 at home to Wolverhampton, two days after firing manager Scott Parker.",
        "url": "https://en.setopati.com/sports/159489",
        "scraped_at": "2026-01-31T09:59:31.178715"
    },
    {
        "title": "Man United stuns Liverpool 2-1 to earn first points in season",
        "tag": "Sports",
        "content": "Finally, there are signs of life at Manchester United.\n\nAgainst a backdrop of protests against the club’s ownership, United delivered a performance of intensity and spirit to beat fierce rival Liverpool 2-1 on Monday and claim its first points in the Premier League this season.\n\nComposed finishes by Jadon Sancho in the 16th minute and Marcus Rashford in the 53rd earned a victory at Old Trafford that will bring some respite for under-pressure manager Erik ten Hag, who made a huge statement in his team selection by dropping star striker Cristiano Ronaldo and club captain Harry Maguire and was validated.\n\n“I wanted a different attitude and that is what I saw them bring on the pitch,” said Ten Hag, who has started his tenure at United amid something of a crisis at England’s biggest club. “But it’s only the start.”\n\nSuddenly, the heat is on Liverpool — widely expected to be a title contender again this season — with Jürgen Klopp’s team still waiting for a win after three games and now languishing behind United in the standings on just two points.\n\nMohamed Salah scored an 81st-minute consolation but it was another below-par display from Liverpool after draws with Fulham and Crystal Palace, even if this was a first league loss in 2022.\n\n“In the warm-up, it was the quietest I have heard this stadium and they wanted something to lift them,” Liverpool defender Andrew Robertson said. “And we gave them it.”\n\nWhat is historically the biggest game in English soccer was preceded by a pre-match protest by thousands of United fans angry at the direction and state of the club under its owners of 17 years, the Glazer family.\n\nThe supporters called for the U.S-based Glazers to sell the club as they walked to Old Trafford then gathered on the concourse outside the storied stadium, in front of a large police presence. Many lingered as the match began.\n\nThe pressure was on United after losses to Brighton (2-1) and Brentford (4-0) to open the season, and the players fed off a frenzied atmosphere that seemed to affect Liverpool early on.\n\n“The start of the game was exactly what everyone expected, what United fans expected. They were after us,” Klopp said. “They started slightly more aggressive than us.”\n\nLisandro Martinez, an offseason signing at center back who has come under enormous criticism in recent days, was particularly impressive and set the tone by clattering into Salah in the first minute, then barging into the Liverpool forward after getting up off the ground. Later in the first half, Raphael Varane, who replaced Maguire, virtually rugby-tackled Luis Diaz to the ground, to roars of approval from United’s fans even if it earned him a booking.\n\nSancho’s goal came in United’s best spell of the game, the winger showing great composure to trick James Milner by feigning to shoot, cut back inside and place a shot into the corner as Virgil van Dijk bizarrely stood motionless in front of him. It was the seventh straight Premier League match that Liverpool had fallen behind.\n\nThe stadium erupted again when Anthony Martial, a halftime substitute, played through Rashford and the striker sprinted toward the area before placing a calm finish inside the near post.\n\nUnited had to defend stoutly at times but hung on to end an eight-match winless run against Liverpool and a losing streak of four matches in the league stretching back to the end of last season.\n\nIt’s down to United to string a run of similar battling performances together, starting at Southampton next weekend. Ten Hag will have Casemiro, whose $60 million signing from Real Madrid was completed Monday, available for that game and the Brazil midfielder was presented on the field before kickoff.\n\nWith more signings potentially arriving before the end of the transfer window, things might be looking up for the record 20-time English champions.\n\n“We just have to produce like today in every single game,” Sancho said.",
        "url": "https://en.setopati.com/sports/159422",
        "scraped_at": "2026-01-31T09:59:31.487799"
    },
    {
        "title": "City bounces back to draw 3-3 at Newcastle",
        "tag": "Sports",
        "content": "Manchester City was given a major scare by Newcastle before coming from behind to draw 3-3 in a thrilling Premier League game on Sunday.\n\nCity needed goals in the space of four minutes after the hour mark from Erling Haaland and Bernardo Silva to salvage a point at St. James’ Park and maintain the unbeaten start to its title defense.\n\nNewcastle battered City for much of the first half and just after halftime, responding to going behind to Ilkay Gundogan’s fifth-minute strike with goals from Miguel Almiron, Callum Wilson and then a stunning free kick from Kieran Trippier in the 54th.\n\nRather than opt for damage limitation, Newcastle — inspired by the individual brilliance of Allan Saint-Maximin — decided attack was the best form of defense and it nearly paid off.\n\nUltimately it was a goal by Silva, starting for the first time in the league this season after being linked with a move to Barcelona in the summer, that saved City and it came off a brilliant through-ball from Kevin De Bruyne that took out three Newcastle players — going through the legs of one of them.\n\nNewcastle also stayed unbeaten after three games and, funded by the riches of Saudi Arabia, will be proud of a statement display against the champions.\n\nCity started strongly, and Silva and Haaland had already combined ominously to allow Rodri to whistle a long-range strike over Nick Pope’s crossbar when the midfielder was allowed time and space to deliver a cross for Gundogan to control and fire past Pope.\n\nThe England goalkeeper had to save with his legs from De Bruyne and Phil Foden in quick succession with the visitors utterly dominant, although the home side should have leveled when Saint-Maximin cut the ball back for Almiron, who skied his shot.\n\nThen Newcastle took over. Ederson had to save at full stretch to keep out Saint-Maximin before substitute Ruben Dias — on for the injured Nathan Ake — deflected Wilson’s attempt wide.\n\nThe respite proved temporary. Saint-Maximin tricked his way past Kyle Walker and Rodri down the left to cross to the far post where Almiron slid in to turn the ball home. The goal was ruled offside but it was overturned on review.\n\nThat Almiron was the scorer was poignant, given he was mocked by City midfielder Jack Grealish in post-title celebrations in May.\n\nJoao Cancelo had to come to Ederson’s rescue after he had rashly raced from his line to confront Almiron and was easily rounded, but the Brazil goalkeeper was picking the ball out of his net once again six minutes before the break. Saint-Maximin cut inside and fed Wilson, who touched the ball back inside past Dias before dispatching it into the net with the outside of his right foot.\n\nHaaland was unfortunate not to drag the visitors back level within seven minutes of the restart when his shot was tipped onto the foot of a post by Pope, and his misery was compounded two minutes later when the home side extended their lead.\n\nJohn Stones was penalized for bringing down the flying Saint-Maximin 22 meters out and Trippier’s free kick gave Ederson little chance.\n\nHaaland blasted City back into it from close range from Rodri’s flick back into the area and should have helped himself to a second three minutes later, but was denied by Pope’s legs.\n\nCity was level, however, seconds later when De Bruyne picked out Silva’s run.\n\nTrippier was shown a straight red card by referee Jarred Gillett for a cynical trip on De Bruyne, but the official was advised to review the incident and reduced the punishment to a yellow.",
        "url": "https://en.setopati.com/sports/159418",
        "scraped_at": "2026-01-31T09:59:31.804343"
    },
    {
        "title": "Chelsea collapses at Leeds after Mendy howler",
        "tag": "Sports",
        "content": "A bad error by goalkeeper Edouard Mendy prompted a collapse by Chelsea in a 3-0 loss at Leeds on Sunday featuring a first Premier League goal by American winger Brenden Aaronson.\n\nThe late sending-off of center back Kalidou Koulibaly completed a miserable afternoon at a lively Elland Road for Chelsea, which fell to a first loss of the season.\n\nIt was Aaronson who applied pressure on Mendy after the Senegal international received a back pass in the 33rd minute. Mendy took a slightly heavy touch and tried to go around Aaronson, who dispossessed him and walked the ball into the net to make it 1-0.\n\nRodrigo glanced home a header from Jack Harrison’s free kick in the 37th minute and the roles were reversed for the third goal in the 69th, when Rodrigo arrived in the area to meet a cross with a mis-hit shot that was turned in from close range by Harrison.\n\nKoulibaly, one of Chelsea’s offseason signings, received his second yellow card in the 84th for pulling back the jersey of substitute Joe Gelhardt.\n\nChelsea’s poor performance contrasted sharply with its impressive display in a 2-2 draw with Tottenham last weekend and highlighted a number of weaknesses in its squad.\n\nNotably in attack, where manager Thomas Tuchel looks to be short after letting go Romelu Lukaku and Timo Werner and only bringing in Raheem Sterling from Manchester City. Sterling had a goal disallowed in the first half and also missed a great early chance.\n\nChelsea also has a shortage of center backs — the suspension of Koulibaly won’t help — as well as issues in midfield, with N’Golo Kante and Mateo Kovacic injured.\n\nLeeds has opened with two wins and a draw in manager Jesse Marsch’s first full season in charge.\n\nSpain striker Rodrigo has four goals, making him the top scorer in the league.",
        "url": "https://en.setopati.com/sports/159415",
        "scraped_at": "2026-01-31T09:59:32.099287"
    },
    {
        "title": "Núñez sees red as Crystal Palace holds Liverpool for 1-1 draw",
        "tag": "Sports",
        "content": "Two glaring misses then a red card for a reckless headbutt.\n\nIt was a home debut to forget for Liverpool’s big offseason signing, Darwin Núñez.\n\nFortunately for the Reds, another South American came to the rescue at Anfield as a dazzling individual goal by Luis Díaz salvaged a 1-1 draw against Crystal Palace in the Premier League on Monday.\n\nIn his first competitive start for Liverpool, Núñez lost control after jostling with Joachim Andersen off the ball and thrust his head into the face of the Palace defender, with referee Paul Tierney watching on close by in the 57th minute.\n\nThe red card was immediately brandished and Núñez had to be calmed down by his teammates as he attempted to confront Tierney. Liverpool manager Jürgen Klopp blanked Núñez as the Uruguay striker headed down the tunnel.\n\n“It’s a red card,” Klopp said. “He was provoked all the time but that is not how to behave.”\n\nNúñez, an offseason signing from Benfica, earned his first start after a couple of impressive, goalscoring displays off the bench in the Community Shield against Manchester City and then against Fulham, and also because Roberto Firmino was missing through injury.\n\nHe missed a very presentable early chance against Palace by miscuing a close-range volley at the back post, and then hit the post from a similar range in the final minute of the first half.\n\nMaybe some frustration had set by the time he was red-carded. As they jostled at the edge of Palace’s penalty area, Núñez threw his head back at Andersen and missed. Then, when confronted moments later by the aggrieved defender, Núñez turned into Andersen and butted him square in the face.\n\nAlready trailing because of Wilfried Zaha’s 32nd-minute goal, Liverpool was really up against it. But even down to 10 men, Klopp’s team still dominated possession and Díaz earned his team a point by cutting in from the left, slipping between two defenders, and curling a shot into the far corner in front of the Kop. The Colombia international’s goal came four minutes after the red card.\n\n“Sometimes you need a moment of brilliance,” Liverpool midfielder James Milner said, “and when you have players like Luis on the pitch, he can create something out of nothing. It was an incredible goal.”\n\nPalace relied almost exclusively on the counterattack throughout the match and it was from that means that Zaha opened the scoring, breaking the offside trap to latch onto Eberechi Eze’s through-ball and curl a finish into the far corner.\n\nZaha missed a great chance to snatch a win when he stretched to meet a cross late in the game and hit the post.\n\nLiverpool has now drawn its first two games — Klopp’s team was held 2-2 by Fulham in the opening weekend — and is already four points behind Manchester City and Arsenal, the early pacesetters.\n\nIts third match will be at Old Trafford next Monday against a beleaguered Manchester United team that has lost both of its games.\n\nNúñez will be suspended for that, while Klopp is set to be without a slew of key players, with the likes of Thiago Alcantara, Diogo Jota, Ibrahima Konaté and Joel Matip currently out injured. Firmino missed the game as a precaution, according to Liverpool, so could be fit in a week’s time.\n\n“Everything went against us during the week,” Klopp said. “It was crazy — it was like a witch was in the building. Every time somebody else had problems and then putting in such a performance, especially in the circumstances, I’m really proud.”",
        "url": "https://en.setopati.com/sports/159377",
        "scraped_at": "2026-01-31T09:59:32.415400"
    },
    {
        "title": "Tuchel, Conte sent off as Chelsea, Tottenham draw 2-2 in EPL",
        "tag": "Sports",
        "content": "Antonio Conte and Thomas Tuchel were both sent off after clashing following the final whistle of a feisty 2-2 draw between Chelsea and Tottenham featuring an equalizer in the sixth minute of stoppage time by Spurs striker Harry Kane on Sunday.\n\nAs they shook hands on the field, Tuchel seemed to not let go of his grip and intimated that Conte look him in the eyes. Pushing and shoving ensued, just as there had been between the two managers in the technical area during the match at Stamford Bridge. They were then shown red cards.\n\nConte celebrated Tottenham’s first equalizer, by Pierre-Emile Højbjerg in the 68th minute, by barging into the chest of Tuchel, sparking a melee among the two sets of coaching staff.\n\nThen, after Reece James put Chelsea back in front in the 77th, Tuchel set off on a sprint past Conte and down the touchline, clenching his fist in pure delight.\n\nKane’s goal came in the sixth of seven added-on minutes, the striker glancing in a header that took a touch off the thigh of James before going into the net.\n\nKalidou Koulibaly had put Chelsea ahead in the 19th minute by meeting a deep corner from Marc Cucurella with a stunning volley that flew high into the net for his first goal since joining in the offseason from Napoli.\n\nTottenham, which only came to life after the introduction of Richarlison, ended a run of five straight losses to Chelsea in all competitions but remained stuck on just one victory at Stamford Bridge since the Premier League started in 1992.\n\nBoth teams have four points from two games.",
        "url": "https://en.setopati.com/sports/159369",
        "scraped_at": "2026-01-31T09:59:32.726169"
    },
    {
        "title": "Nepal not to host IIFA Awards",
        "tag": "Entertainment",
        "content": "The government has stepped back from the decision to host the International Indian Film Academy (IIFA) Awards in Kathmandu. Deepak Raj Joshi, Chief Executive Officer (CEO) of the Nepal Tourism Board (NTB) that has been handed responsibility to coordinate the hosting of event, told Setopati that it has decided to immediately stop all preparations. The International Relations Committee of the parliament has already instructed the government to not host the event. CEO Joshi said preparations will be stopped due to that instruction and in respect of public sentiments. \"We had taken the event as an opportunity for tourism promotion and branding. But we have decided to stop it feeling it is not the appropriate time to host the event due to the instruction of parliamentary committee and other political and social reasons,\" he added. Minister for Communication and Information Technology Gokul Baskota during the weekly press conference on Thursday had said the event will be hosted in a way that the NTB and the Kathmandu Metropolitan City (KMC) are joint co-organizers. The event was scheduled for the last week of August. The government had formed a high level committee under Minister of State for Culture, Tourism and Civil Aviation Dhan Bahadur Buda. The event would have cost the government almost Rs 1 billion. The organizers had demanded US$ 4 million from Nepal for getting to organize the event while Nepal would also have to provide air fares, accommodation and local transportation for the guests and participants, the majority of whom demanded business class tickets and five-star accommodation. The government's decision was widely criticized after revelation that the event will be hosted with taxpayers' money.",
        "url": "https://en.setopati.com/entertainment/149141",
        "scraped_at": "2026-01-31T09:59:33.040265"
    },
    {
        "title": "Govt will have to spend almost Rs 1 billion for IIFA Awards",
        "tag": "Entertainment",
        "content": "The government will have to spend almost Rs 1 billion to organize the International Indian Film Academy (IIFA) Awards. The organizers have demanded US$ 4 million from Nepal for getting to organize the event, according to Nepal Tourism Board (NTB) CEO Deepak Raj Joshi. The Cabinet has decided to organize the event in Nepal with NTB and Kathmandu Metropolitan City (KMC) the joint co-organizers. Coordinator of the Visit Nepal Year Suraj Vaidya and Joshi have been handed the responsibility to negotiate with the organizers about the event fee. \"We are in course of discussion. We have only held discussions on the venue and guests but have yet to sign agreement. We have yet to finalize event fee as well,\" Joshi told Setopati. Joshi revealed that the organizers have demanded the amount for technical preparations including event management to fees for the artistes. But both the NTB and KMC do not have working procedure to pay a foreign company in such manner. A member of the high-level committee formed by the government to organize the event confided that additional Rs 200 million will be needed for air fares, accommodation and local transportation for the guests and participants. \"The majority of them have demanded business class tickets while they will also want five-star hotels. Another Rs 200 million will have to be spent in that,\" the member told Setopati. Millions will also have to be spent on security for the guests and awards taking the expenditure to almost Rs 1 billion. NTB CEO Joshi, however, claimed that the money will be well-spent providing unprecedented promotion for Nepal. \"This is an event with a viewership greater than that of Oscars. This will create a brand for the city. We can also send a message that we are capable and safe to organize such huge events,\" he reasoned. \"They will name the event Nepal IIFA and many television channels will promote the event as Nepal IIFA.\" He said the event will also provide an opportunity to bring multiple stars. \"We have to spend around Rs 50 million to bring one star now. Around 100 stars of that level will arrive for the event. Videos about Nepali destinations will also be played during the event. We have almost agreed on that. Such videos will be useful for us even in the future.\"",
        "url": "https://en.setopati.com/entertainment/148910",
        "scraped_at": "2026-01-31T09:59:33.359857"
    },
    {
        "title": "Rolling Stones return to stage, tour after Mick Jagger mends",
        "tag": "Entertainment",
        "content": "Please allow them to reintroduce themselves: The Rolling Stones are set to return to the stage. The band plays Friday night at Chicago’s Soldier Field after postponing their North American tour because frontman Mick Jagger needed medical treatment. A second show is scheduled for Tuesday. St. Paul & The Broken Bones are expected to open Friday, and Whiskey Myers on Tuesday. The Rolling Stones said in a statement last month the concerts will feature classic hits such as “Sympathy For The Devil” and “Paint It Black.” The No Filter Tour was delayed after doctors told the 75-year-old Jagger in late March he couldn’t tour at the time.",
        "url": "https://en.setopati.com/entertainment/148654",
        "scraped_at": "2026-01-31T09:59:33.666951"
    },
    {
        "title": "Arnold Schwarzenegger assaulted during event in South Africa",
        "tag": "Entertainment",
        "content": "Actor Arnold Schwarzenegger was assaulted during a public appearance in South Africa on Saturday, but the 71-year-old quickly recovered and said, “I’m just glad the idiot didn’t interrupt my Snapchat.” Video shows the former California governor standing and filming children at a sporting event in Johannesburg when a man makes a flying kick into his back. Schwarzenegger stumbles forward. The man is quickly grabbed by security. Off camera a man shouts several times “Help me!” The video shortly afterward shows Schwarzenegger smiling and shaking hands with bystanders before walking out ringed by security. Schwarzenegger later posted on Twitter: “Thanks for your concerns, but there is nothing to worry about. I thought I was just jostled by the crowd, which happens a lot. I only realized I was kicked when I saw the video like all of you. I’m just glad the idiot didn’t interrupt my Snapchat.” Schwarzenegger also tweeted a second video of the incident “without whatever he was yelling so he doesn’t get the spotlight.” “By the way...” he joked, “block or charge?” Schwarzenegger had been attending his Arnold Classic Africa event, which features dozens of sports and fitness activities. In a separate Twitter post, the event blamed a “crazed fan” for the assault. The statement cited organizer Wayne Price as saying the assailant was “known to the police for orchestrating similar incidents in the past” and that Schwarzenegger was “fine and still in good spirits.” The actor confirmed he had no intention of pursuing charges and would continue with another appearance on Sunday as planned, the statement said.",
        "url": "https://en.setopati.com/entertainment/146850",
        "scraped_at": "2026-01-31T09:59:33.975312"
    },
    {
        "title": "Amitabh Bachchan in 'pain', cancels Sunday meet",
        "tag": "Entertainment",
        "content": "Megastar Amitabh Bachchan on Sunday afternoon informed his fans that he is cancelling the weekly meet and greet ritual due to ill health. The 76-year-old actor, who sees his admirers every Sunday at his house Jalsa in Juhu since past 36 years, said he might be in pain but fans need not worry. \"...Not doing the Sunday Darshan today... In bed... Pain .. Inform all, nothing to worry, but unable to come out,\" Bachchan wrote on his blog. The actor, who was last seen in \"Badla\", is currently working on Ayan Mukherji's \"Brahmastra\" and a bilingual project, titled \"Tera Yaar Hoon Main\". Bachchan is also teaming up with Emraan Hashmi for a mystery thriller.",
        "url": "https://en.setopati.com/entertainment/145829",
        "scraped_at": "2026-01-31T09:59:34.300722"
    },
    {
        "title": "Justin Bieber working with YouTube on ‘top secret project’",
        "tag": "Entertainment",
        "content": "Justin Bieber got his start posting cover songs on YouTube and now he’s working with the platform on a “top secret project.” YouTube announced Thursday that it is planning a project with the Grammy-winning Canadian pop star, set to premiere next year. No more details about the Bieber special were revealed. Before releasing his debut song in 2009, Bieber gained popularity from posting his performances on YouTube. He went on to top the pop charts with hits like “Sorry” and “Boyfriend,” win a Grammy Award and tour the world. YouTube announced a slate of new programming Thursday, including documentaries on Colombian singer Maluma and socialite Paris Hilton. They also said “Kevin Hart: What The Fit” would return for a third season next year.",
        "url": "https://en.setopati.com/entertainment/145561",
        "scraped_at": "2026-01-31T09:59:34.625449"
    },
    {
        "title": "Drake breaks Taylor Swift’s record at Billboard Music Awards",
        "tag": "Entertainment",
        "content": "Mother’s Day is in a couple weeks, but Drake gave his mom an early gift with a heartfelt speech at the 2019 Billboard Music Awards, where the rap star also broke Taylor Swift’s record for most wins. Drake turned up the love for his mom when he picked up top artist, besting Cardi B, Ariana Grande, Post Malone and Travis Scott. He won 12 awards Wednesday in Las Vegas, making his career total 27 (Swift has 23 wins). He looked up to the ceiling as he held the trophy, then said: “I just want to thank my mom for her relentless effort in my life. “I want to thank my mom for all the times you drove me to piano. All the times you drove me to basketball and hockey — that clearly didn’t work out. All the times you drove me to ‘Degrassi.’ No matter how long it took me to figure out what I wanted to do, you were always there to give me a ride, and now we’re on one hell of ride,” Drake said. Family bonding was a theme at the three-hour show, which aired live on NBC and was hosted by Kelly Clarkson Ciara’s young son and husband, NFL player Russell Wilson, danced along while she worked the stage, and Nick and Joe Jonas gave kisses to Priyanka Chopra and Sophie Turner of “Game of Thrones” fame when they sang in the audience before hitting the stage. Brendon Urie of Panic! at the Disco looked to his parents as he accepted top rock song, quoting the name of his current hit: “Hey look Ma, I made it!” Mariah Carey’s twins cheered her on as she sang a medley of her hits and accepted the Icon award. She was in diva form before taking the award from Jennifer Hudson, throwing her napkin on the floor after dabbing her face with it. “Without getting into all the drama, all the ups and downs of my career ... I guess I always felt like an outsider, someone who doesn’t quite belong anywhere, and I still feel like that lost interracial child who had a lot of nerve to believe I could succeed at anything at all in this world. But, and this is the truth, I did believe because I had to,” she said. “The truth is I dedicated my life to my music — my saving grace — and to my fans.” Cardi B, the night’s top nominee with 21, locked lips with husband Offset on the red carpet and the couple sat closely inside the venue. She won six awards, including top Hot 100 song for “Girls Like You” with Maroon 5. “I remember when Maroon 5 hit me up to do this song. I was like, ‘Bro I’m five months pregnant. I can’t even breathe.’ But this record to me was so amazing. I was like, ‘Oh this is going to be a hit.’ And now I sing this song to my daughter because she’s the girl that I need,” she said. Drake and Cardi B — who both won multiple awards during the live telecast — used their speeches to promote love and appreciation for their peers in the music industry. Others, too, brought on the positive energy when onstage. Imagine Dragons’ band leader Dan Reynolds used his speech to highlight the dangers of conversion therapy on LGBTQ youth. He earned rousing applause. Florida Georgia Line’s Tyler Hubbard followed suit, telling the audience after winning top country song: “In the spirit of so much truth being spoken tonight by so many talented artists, I think we should speak some truth.” “As artists we all get to experience so many unbelievable things, but in our opinion, at the end of the day, it’s all for nothing if you’re not using your platform for better ... to spread love, to help those in needs, to be a light to your community,” he said. Swift kicked off the show when she brought her new music video to life with a colorful, eye-popping performance of her song “ME!” Dancers wearing bright, pastel colors spun in the air holding umbrellas and a marching band kicked off Swift’s performance — like most of the world, maybe she was inspired by Beyonce’s new Coachella film? Madonna, wearing an eye-patch, teamed up with Colombian singer Maluma for a performance, but it was Grammy-winning Christian artist Lauren Daigle who had the night’s best performance. She sang “You Say,” giving the audience a calm, yet strong and powerful performance. She was backed by three awesome background singers and a pianist. BTS, who performed alongside Halsey, also had a major night. At the Billboard Awards and American Music Awards, the K-pop band had only previously won “social” awards based off their fanatic fan base, but on Wednesday BTS picked up top duo/group, besting Grammy-winning groups like Maroon 5, Imagine Dragons and Dan + Shay. “I still can’t believe we’re here on this stage with so many great artists,” RM said as fans screamed loudly. “We’re still the same boys from six years ago, we still have the same dreams ... we still have the same thoughts. Let us keep dreaming.” An unlikely winner at the Billboard Awards? “Game of Thrones” actress Maisie Williams, whose plays Arya Stark on the HBO series and shined brightly on last week’s episode. “Shout-out to Arya Stark for putting in that work last week,” Drake said onstage after winning his first award of the evening.",
        "url": "https://en.setopati.com/entertainment/145444",
        "scraped_at": "2026-01-31T09:59:34.950600"
    },
    {
        "title": "Adele splits from husband Simon Konecki",
        "tag": "Entertainment",
        "content": "Adele and her husband Simon Konecki have separated. The pop singer’s representatives Benny Tarantini and Carl Fysh confirmed the news Friday in a statement to The Associated Press. “Adele and her partner have separated,” the emailed statement said. “They are committed to raising their son together lovingly. As always they ask for privacy. There will be no further comment.” Adele gave birth to their son, Angelo, in 2012. The Grammy-winning British superstar has been private about her relationship, but confirmed she married Konecki when she won album of the year at the 2017 Grammys. In her acceptance speech, she said: “Grammys, I appreciate it. The Academy, I love you. My manager, my husband and my son — you’re the only reason I do it.” Konecki co-founded Life Water, an eco-friendly brand of bottled water in the U.K. Funds from the company assists the charity that Konecki runs, Drop4Drop, which provides clean water to countries in need. A representative for Konecki could not be reached.",
        "url": "https://en.setopati.com/entertainment/144414",
        "scraped_at": "2026-01-31T09:59:35.266778"
    },
    {
        "title": "Judge says Angelina Jolie and Brad Pitt are now single",
        "tag": "Entertainment",
        "content": "Angelina Jolie and Brad Pitt are officially single, though more work is left before the terms of their divorce are final. Los Angeles Superior Court documents show that Judge John W. Ouderkirk entered a judgment Friday, saying the couple is no longer married. Her name was also restored to just Jolie, not Jolie Pitt. The couple’s lawyers had asked for a bifurcated judgment, meaning that two married people can be declared single before all issues in the divorce are agreed upon. It’s not clear what issues remain unresolved in the divorce, but Jolie has filed papers saying Pitt wasn’t paying sufficient child support, which his attorneys disputed. The 43-year-old Jolie and the 55-year-old Pitt have six children. They were married in 2014, and Jolie filed for divorce in 2016.",
        "url": "https://en.setopati.com/entertainment/144189",
        "scraped_at": "2026-01-31T09:59:35.571851"
    }
]