[
    {
        "title": "Nepal consulate warns Nepalis in US against misuse of public benefits, visa violations",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nThe Consulate General of Nepal in New York has issued an urgent notice warning Nepali citizens residing in the United States against illegally accessing public benefits and misusing visa conditions, stating that such actions could lead to visa or Green Card cancellation.\nAccording to the notice, U.S. authorities have informed that foreign nationals who provide false or misleading information to obtain benefits meant for U.S. citizens, such as subsidized healthcare, housing, family assistance, or educational support, may face direct legal consequences affecting their immigration status.\nThe consulate noted that data from Nepali citizens who traveled to the U.S. in 2024 show Nepalis among the top groups availing subsidized services, prompting the U.S. government to issue a public notice temporarily suspending immigrant visas for Nepali nationals.\nIn addition, citing cases of overstaying and unauthorized employment by Nepali nationals on B1/B2 visas, the U.S. government has introduced a visa bond requirement ranging from USD 5,000 to USD 15,000, effective January 21, 2026.\nThe consulate warned that continued violations could further tighten U.S. visa policies toward Nepal, making visa approval more difficult and harming the country's international image. It urged all Nepali citizens in the United States to strictly comply with U.S. laws, avoid dependence on unauthorized public assistance, and refrain from misuse of visa privileges.",
        "url": "https://thehimalayantimes.com/nepal/nepal-consulate-warns-nepalis-in-us-against-misuse-of-public-benefits-visa-violations",
        "scraped_at": "2026-01-31T09:40:19.365011"
    },
    {
        "title": "Team Ventures invests in Soaltee Westend Itahari, marks hospitality foray",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nTeam Ventures, a leading private equity and venture capital firm has made its first investment in the hospitality sector through an investment in Hotel Garima Limited, the owner of Soaltee Westend Itahari, with Team Ventures and its affiliates acquiring a 27% equity stake in the company.\nSoaltee Westend Itahari, a five-star–level hotel, is located in an emerging commercial and transit hub in eastern Nepal and operates under the Soaltee Hotels & Resorts brand, Nepal's first international hotel chain.\n\"The investment is expected to support the company's next phase of growth by advancing expansion, strengthening governance, and enhancing institutional capabilities,\" said Kesang Shrestha, Chairman of Team Ventures. The investment is supported by Team Ventures' board and leadership team, which brings deep sectoral and hospitality experience, including senior leadership and board-level involvement with international hotel chains in Nepal and the region.\n\"We have been actively exploring opportunities in the hospitality sector, given its importance to Nepal's tourism ecosystem and the broader economy,\" said Dorje Gyaltsen Lama, Director of Team Ventures. \"Soaltee Westend Itahari combines a strong brand, an experienced operator, and clear growth potential, and we look forward to supporting the company as it continues to scale and strengthen its institutional foundation.\"\n\"As an equity partner, our role will go beyond capital,\" said Bijaya Bahadur Shrestha, Director of Team Ventures. \"We will focus on strengthening governance, building organizational capacity, and working alongside management to support long-term, professionally managed growth.\"\n\"We are pleased to welcome Team Ventures as an equity partner,\" said Binod Poudel, Managing Director of Soaltee Westend Itahari. \"The partnership brings institutional capital and experience that we believe will support our expansion initiatives and the company's continued growth.\"\nTeam Ventures is a leading alternative investment firm established in 2016, focused on investing in growth-oriented businesses across multiple sectors. Its investment portfolio spans clean energy, agriculture, manufacturing, technology, and media.",
        "url": "https://thehimalayantimes.com/business/team-ventures-invests-in-soaltee-westend-itahari-marks-hospitality-fth",
        "scraped_at": "2026-01-31T09:40:20.918350"
    },
    {
        "title": "Universal Health Coverage: The decisive election agenda",
        "tag": null,
        "content": "Ensuring Universal Health Coverage (UHC) is one of the defining policy challenges of the 21st century. In election periods, few issues resonate more powerfully with voters. Everywhere, people want the same simple assurance: access to good-quality health care for themselves and their family, and protection from the financial shock of illness. Health is personal, universal, and deeply political. When political leaders understand this-and act on it-they do not just improve lives; they also significantly increase their chances of electoral success.\nThe evidence that health tops voters' priorities is unequivocal. The UN75 global survey conducted in 2020 to mark the United Nations' 75th anniversary found that access to quality health care was the single most important issue for people worldwide.\nThe most effective response to this demand has been the creation of universal health systems underpinned by socialised financing. These systems pool resources so that the healthy and wealthy subsidise care for the sick and the poor. Today, all high-income countries-except the United States-have adopted some version of this model. Whether funded through general taxation, social insurance, or a mix of both, the principle is clear: no one should be denied care or pushed into poverty because they fall ill.\nCountries with strong UHC systems enjoy longer life expectancy, lower maternal and child mortality, and better management of chronic disease. A healthier population is also more productive and remains economically active for longer. UHC therefore supports sustainable economic growth as well as social welfare.\nUniversal health systems also reduce inequality. Heavy reliance on out-of-pocket payments disproportionately harms the poorest, who often delay care, sell assets, or fall into debt to pay medical bills. Publicly financed systems redistribute resources across society, narrowing health and income gaps. When citizens know they are all contributing to and benefiting from the same system, trust in public institutions grows and willingness to pay taxes increases.\nToo often overlooked is the contribution of UHC to peace and political stability. Access to basic services is a cornerstone of the social contract between citizens and the state. When governments deliver on health, they demonstrate responsiveness and legitimacy. When they fail, grievances deepen-particularly in fragile or post-conflict settings.\nPerhaps most importantly for politicians, universal health reforms are extremely popular. Leaders who deliver health security are frequently rewarded at the ballot box and remembered as nation builders.\nHistory offers powerful examples. In the United Kingdom, the Labour Party won a landslide victory in 1945 after promising universal health care following the devastation of the Second World War. The National Health Service, launched in 1948, transformed access to care and remains the country's most popular public institution. In Japan, post-war expansion to universal health insurance helped rebuild the nation and underpin decades of economic growth and social cohesion. In Thailand, following the Asian financial crisis, Prime Minister Thaksin Shinawatra's universal coverage scheme became one of the most popular policies in modern Thai history and a key factor in his party's repeated electoral success.\nNepal's own experience fits this pattern. Following the pro-republic people's movement, political leaders enshrined health as a fundamental right in the 2007 Interim Constitution. The government introduced free basic health care, essential medicines, and reproductive health services, making Nepal an early exemplar of UHC reform despite being a low-income country. These commitments featured prominently in the 2009 elections and were rewarded by voters. This precedent matters: Nepali citizens respond positively when leaders place health security at the centre of their political agenda.\nThe 2024 Chatham House Commission on Universal Health Coverage highlights that many transitions to UHC follow periods of national crisis-economic collapse, conflict or political instability. Such moments create space for bold reform.\nAs Nepal approaches elections this spring, universal health reform once again has the potential to be decisive. A clear path forward would be to guarantee free basic services for all while strengthening social health insurance for secondary and tertiary care, with contributions proportionate to income. Extending free hospital services nationwide-while ensuring quality-would be a bold and highly popular step.\nTo make this sustainable and address the current crisis in insurance payments, Nepal must increase domestic public financing for health. This can be achieved by raising government revenues and increasing the share of the national budget allocated to health from the current 4.9 per cent. Raising the health budget share to 10 per cent, typical for countries at Nepal's income level, would more than double available resources. Dedicated health taxes on alcohol, tobacco, and other harmful products could further fund these commitments.\nSuch reforms are neither unrealistic nor unprecedented. Countries across Asia-including Thailand, Sri Lanka, Indonesia, and China-have increased public health spending by 1-2 per cent of GDP to achieve or deepen universal coverage, with economic, social, and political returns consistently outweighing the costs.\nA new government in Nepal would not be acting alone. It could draw on global expertise through WHO-supported initiatives, academic institutions such as the London School of Economics, and peer learning from countries that have successfully implemented UHC reforms.\nThe political message is clear. Voters want universal health protection, and they reward leaders who deliver it. Smart political leaders should seize this opportunity-to improve the lives of millions through a winning election agenda.\nYates is Visiting Professor in Practice, The London School of Economics, and Dr Maskey is the Executive Chief of Nepal Public Health Foundation",
        "url": "https://thehimalayantimes.com/opinion/universal-health-coverage-the-decisive-election-agenda",
        "scraped_at": "2026-01-31T09:40:22.556704"
    },
    {
        "title": "History-chasing Djokovic and Alcaraz to meet in Australian Open final after epic wins",
        "tag": null,
        "content": "MELBOURNE, JANUARY 30\nNovak Djokovic finally beat one of the two men who've been blocking his path to an unprecedented 25th Grand Slam singles title when he edged Jannik Sinner in five sets to reach the Australian Open final Friday.\nTo get that coveted No. 25, he'll have to beat the other: Top-ranked Carlos Alcaraz.\nThey're both chasing history in Sunday's championship decider, with Alcaraz striving to become the youngest man at 22 ever to complete a career Grand Slam.\n\"There's always, for me, also for Carlos because of his age and everything he's achieved, history is on the line for both of us,\" Djokovic told reporters packed into a small room deep inside the stadium in a brief interview approaching 3 a.m. \"Finals of a Grand Slam. There's a lot at stake.\"\nThe top-ranked Alcaraz came through his own grueling five-setter. He overcame cramps and a sore right leg to fend off No. 3 Alexander Zverev 6-4, 7-6 (5), 6-7 (3), 6-7 (4), 7-5 in a match that started in the warmth of the afternoon and, 5 hours, 27 minutes later, became the longest semifinal ever at the Australian Open.\nThat pushed the scheduled start of the Sinner-Djokovic semifinal back a couple of hours, and the 38-year-old Djokovic finally won 3-6, 6-3, 4-6, 6-4, 6-4 just after 1:30 a.m.\n\"It feels surreal,\" Djokovic said of his 4-hour, 9-minute triumph. \"Honestly, it feels like winning already tonight. I know I have to come back ... and fight the No. 1 of the world. I just hope that I'll have enough gas to stay toe-to-toe with him.\n\"For me, this is a win that almost equals winning a Grand Slam.\"\nDjokovic conceded he was lucky to even get to the semifinals. He narrowly missed hitting a ball girl with a reckless swipe in the third round to be almost defaulted from the tournament, got a walkover in the fourth round, and felt he was heading home in the quarterfinals when he trailed Lorenzo Musetti by two sets until the Italian retired with an injured right leg.\nDjokovic hadn't won a set since the third round but against Sinner, the two-time defending champion, Djokovic was at the peak of his attacking and defensive powers. He fended off 16 of the 18 breakpoints he faced and stifled Sinner's opportunities. It ended a run of five losses to Sinner, and a run of four semifinal exits for Djokovic at the majors.\n\"Had many chances, couldn't use them, and that's the outcome,\" Sinner said. \"Yeah, it hurts, for sure.\"\nAlcaraz and Sinner have split the last eight major titles between them since Djokovic won his last title at the 2023 U.S. Open.\nBut nobody knows how to win more often at Melbourne Park than Djokovic. He has won all 10 times he's contested the Australian Open final. He has been saying for months that Alcaraz and Sinner have been playing at a higher level than everyone else. He also said he never doubted he could rise to that level.\n\"I never stopped doubting. I never stopped believing in myself,\" he said. \"There's a lot of people that doubted me ... a lot of experts all of a sudden that wanted to retire me.\n\"I want to thank them all because they gave me strength. They gave me motivation to prove them wrong, which I have tonight.\"\nFinal 4\nThe top four seeds reached the men's semifinals for just the fifth time and Day 13 was destined to produce some much-needed drama. The season-opening major had been a relatively slow burn until the back-to-back five-setters lasting a combined 9 hours, 36 minutes.\nAlcaraz and Zverev, the 2025 runner-up, surpassed the 2009 classic between Rafael Nadal and Fernando Verdasco as the longest ever Australian Open semifinal.\nMedical timeout\nAlcaraz was as close as two points from victory in the third set but was hampered by pain in his upper right leg and his medical timeout became contentious.\nHe said initially it didn't feel like cramping because the pain seemed to be just in one muscle, the right adductor, and he needed an assessment.\nHe endured the third and fourth sets and was behind in the fifth after dropping serve in the first game. He kept up the pressure but didn't break back until Zverev was serving for the match. He then won the last four games.\n\"Physically we pushed each other to the limit today. We pushed our bodies to the limit,\" Alcaraz said. \"I rank this one in the top position of one of the best matches that I have ever won.\"\nBelieve\nAlcaraz admitted he was struggling but he kept \"believing, believing, all the time.\"\n\"I knew what I had to do. I had to put my heart into the match. I think I did it.\"\nZverev was demonstrably upset about the time out in the third set, taking it up with a tournament supervisor. Later, he said that episode shouldn't overshadow the contest.\n\"I don't want to talk about this right now because this is one of the best battles there ever was in Australia,\" he said. \"It doesn't deserve to be the topic now.\"",
        "url": "https://thehimalayantimes.com/sports/history-chasing-djokovic-and-alcaraz-to-meet-in-australian-open-final-after-epic-wins",
        "scraped_at": "2026-01-31T09:40:24.332239"
    },
    {
        "title": "NC President Thapa calls for party unity",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nNepali Congress President Gagan Kumar Thapa has urged party cadres to strengthen the party's organizational structure in order to build greater public trust.\nAddressing a special meeting of the Nepali Congress Madhesh Province Committee and House of Representatives (HoR) election candidates in Janakpurdham on Friday, Thapa stressed that unity, discipline, and active engagement remain the party's core strengths.\n\"There are no factions in the Nepali Congress. We must move forward in unity,\" he said.\nThapa also noted that the party leadership is seeking guidance from immediate past Nepali Congress President Sher Bahadur Deuba, emphasizing continuity and collective decision-making within the party.\nHe reaffirmed the party's commitment to addressing the political, social, and developmental challenges facing Madhesh Province, and highlighted the importance of resolving internal differences ahead of the upcoming HoR elections.\nCalling for a unified campaign, Thapa urged NC candidates to engage closely with local communities, prioritize development and good governance, and effectively implement the party's strategies and policies.\nMeanwhile, Nepali Congress Madhesh Province Committee President Krishna Prasad Yadav emphasized the need to align the party's organizational strength with public concerns, stating that addressing grassroots issues is essential to strengthening voter confidence.",
        "url": "https://thehimalayantimes.com/kathmandu/nc-president-thapa-calls-for-party-unity",
        "scraped_at": "2026-01-31T09:40:26.176304"
    },
    {
        "title": "Home Ministry shares model of inclusive electoral management",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nThe Ministry of Home Affairs has unveiled a model aimed at making electoral management more effective through multi-stakeholder representation and engagement.\nTo ensure that the upcoming elections are conducted in a free, impartial, and peaceful environment, district-level subordinate bodies have been issued a framework for electoral management that involves political parties, civil society members, and intellectuals.\nThe model emphasizes strengthening coordination and collaboration down to the ward level to ensure a systematic and well-organized election process. The Ministry introduced the approach in recognition of the critical roles that political parties, civil society, the media, the private sector, and intellectuals can play in all phases of electoral management.\nThe Ministry has already issued directives to all District Administration Offices to implement the model. According to Ministry Spokesperson Anand Kafle, the framework aims to incorporate political representatives, officials, and intellectuals at the ward level, encouraging them to take ownership of the election process.\nHe expressed hope that this approach would foster an environment conducive to holding the upcoming House of Representatives (HoR) elections in a free and fair manner.\nChief District Officers and all office-bearers of the District Security Committees have been assigned responsibility for overseeing the implementation of the model.",
        "url": "https://thehimalayantimes.com/kathmandu/home-ministry-shares-model-of-inclusive-electoral-management",
        "scraped_at": "2026-01-31T09:40:27.850503"
    },
    {
        "title": "Unidentified assailant shoots man dead in Siraha",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nAn unidentified assailant shot and killed a man near a postal highway in Siraha on Friday afternoon. The deceased has been identified as 40-year-old Premnath Yadav of Siraha Municipality–1.\nYadav was reportedly working on his farmland, located approximately 1.5 kilometers from the district headquarters, when he was attacked. Police said he sustained a fatal gunshot wound to the chest and died at the scene.\nSpokesperson for the District Police Office, Deputy Superintendent of Police Ramesh Bahadur Pal, said a police team was immediately dispatched to the site upon receiving information about the incident, and an investigation is currently underway.\n\"Initial findings indicate that the victim was engaged in agricultural work at the time of the shooting,\" Pal said.\nAuthorities have not yet identified the suspect or established a motive behind the killing. According to police, the attacker fled the scene shortly after the incident.\nSecurity has been tightened along border areas in Siraha and at key checkpoints as part of efforts to track down the suspect.\nThe victim's body has been sent to Province Hospital, Siraha, for post-mortem examination.\n(With inputs from Rastriya Samachar Samiti)",
        "url": "https://thehimalayantimes.com/nepal/unidentified-assailant-shoots-man-dead-in-siraha",
        "scraped_at": "2026-01-31T09:40:29.575391"
    },
    {
        "title": "Laminar and Cresta Tiles receive Nepal Standard Product Certification",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nLumbini Ceramics Limited has received Nepal Standard (NS) Product Certification for its tile brands Laminar and Cresta under the newly implemented NS 617:2082 standard, marking a major milestone for Nepal's ceramic tile industry.\nAccording to the company, Laminar has been certified under the Fully Vitrified Tiles category (Group B Ia), while Cresta has received certification in the Porcelain Tiles category (Group B Ib). The certification was issued by the Department of Standards and Metrology.\nThe NS 617 standard is technically aligned with India's IS 15622 and, in certain parameters, exceeds international and European standards, providing Nepal with a nationally recognized and globally benchmarked quality framework. The standard introduces scientific classification of tiles based on water absorption, durability, and performance, offering greater transparency and protection for consumers.\nFully vitrified tiles, considered the highest category in ceramic tiles, feature extremely low water absorption and high resistance to wear, stains, and fading, making them suitable for high-traffic and outdoor areas. Porcelain tiles offer a balance of durability, design flexibility, and cost efficiency for residential and light commercial use.\nA key consumer-protection feature of NS 617 is the mandatory permanent marking of tile classification on each individual tile, enabling buyers and installers to verify product standards before installation.\nManaging Director of Lumbini Ceramics Limited, Ashutosh Khetan, described the certification as a landmark achievement for the domestic ceramic industry, stating that it establishes a clear national benchmark for quality while supporting domestic manufacturing and import substitution.\nLaminar and Cresta tiles are manufactured at the company's facility in Bardiya using advanced European technology and are available through authorized dealers nationwide.",
        "url": "https://thehimalayantimes.com/nepal/laminar-and-cresta-tiles-receive-nepal-standard-product-certification",
        "scraped_at": "2026-01-31T09:40:31.847793"
    },
    {
        "title": "Pakistan Embassy hosts art exhibition showcasing Pakistan through Nepali artist's work",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nThe Pakistan Embassy in Kathmandu hosted an art exhibition and artist talk titled \"Colours of Pakistan through the Brush of a Nepali Artist\" on January 28, highlighting the works of renowned Nepali artist Bidhata KC inspired by her artistic journey in Pakistan.\nThe exhibition, held at the Embassy premises, drew art enthusiasts, cultural practitioners, civil society representatives, media professionals, social media influencers, and members of the diplomatic community. The diverse attendance reflected growing interest in cultural exchange and people-to-people ties between Nepal and Pakistan.\nDuring the program, Bidhata KC shared her experiences from participating in the Artist Residency Program for South Asian Countries in Pakistan. She spoke about her travels across the country and how Pakistan's landscapes, heritage, and cultural diversity influenced her artwork. The artist expressed gratitude to the Government of Pakistan and the Pakistan Embassy in Kathmandu for the opportunity and appreciated the hospitality and cultural richness she experienced during her stay.\nAddressing the gathering, Ambassador of Pakistan to Nepal, Abrar Hashmi, praised the artist's creative interpretation of Pakistan through a Nepali perspective and emphasized the role of cultural diplomacy in strengthening bilateral relations. He reaffirmed the Embassy's commitment to promoting cultural understanding and shared heritage between the two countries.\nOn the occasion, the Embassy also announced that a Pakistan Food Festival will be held in Kathmandu from February 5 to 7, 2026, offering another platform to showcase Pakistan's culture and cuisine.",
        "url": "https://thehimalayantimes.com/kathmandu/pakistan-embassy-hosts-art-exhibition-showcasing-pakistan-through-nepali-artists-work",
        "scraped_at": "2026-01-31T09:40:33.610911"
    },
    {
        "title": "16 CSOs' appeals: Political parties must include concerns of citizens in their electoral manifestos",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nWhile political parties are currently writing manifestos for the upcoming elections, over a dozen civic organisations have made public their shared perspectives on the problems confronting Nepali society and the policies that can be implemented to address them.\nSixteen civil society organisations led by the NGO Federation of Nepal (NFN) outlined their concerns and priority issues for political parties to include in their manifestos for the upcoming March 5 House of Representatives election in a press conference here yesterday.\nIn light of the citizen dissatisfaction and demands exposed by the Gen Z uprising on September 8 and 9, they highlighted that the upcoming House of Representatives elections on March 5 are not only regular elections but also a historic turning point in guiding the direction of democracy.\nThe upcoming March 5 elections, according to them, are more than just a formal process of power transfer; they are a historic opportunity that should prove to be a decisive turning point in the direction of restoring and expanding civil rights, ensuring accountable governance, institutional development of social justice, and inclusive and sustainable prosperity.\nThe appeal reflects civil society voices, emphasising democratic values, accountable governance, inclusion, and people-centred policies, with the goal of strengthening Nepal's democratic process ahead of the March 5 elections.\nArjun Bhattarai, president of the NFN, stated that an appeal paper was prepared based on interactions with citizens across the country and a study of a wide range of topics, including issues raised by previous citizen movements.\nHe also stated that this Citizen Appeal Letter 2025 is being made public as a collective voice of civil society organisations, networks, campaigns, activists, and other stakeholders, in collaboration with the NFN, and is being distributed to political parties.\n\"We intend to submit these pressing concerns to each political party and stakeholder, and we urge political parties to include issues directly related to citizens' lives, rights, and futures in their manifestos for the upcoming House of Representatives election in 2025 in a clear, committed, and implementable manner,\" he stated.\nHe clarified that 16 organisations are submitting 24-page proposals to each party and stakeholder. Social and civic organisations, consumer interest groups, and civil society have all contributed their suggestions in preparing it.\nThe organisations that have made such suggestions include the Federation of Non-Governmental Organisations Nepal, the Federation of Nepali Journalists, the Association of Community Radio Broadcasters, Dalit NGO Federation (DNF), the National Federation of Disabled, the Beyond Beijing Committee, the National Federation of Irrigation Water Consumers Association, Federation of Community Electricity, Federation of Drinking Water and Sanitation Consumers, and the National Federation of Indigenous and National Women's Federation Nepal, Consumer Interest Protection Forum, Youth Organization Network, Federation of Sexual and Gender Minorities, Blind Association Nepal and National Network of Women Human Rights Defenders.\nAccording to Bhattarai, the aspirations of citizens for fundamental rights, inclusive democracy, social justice, equality, good governance, and prosperity guaranteed by the 2015 Constitution of Nepal have yet to be fully implemented.\nAs a result, the citizen appeal raises serious concerns about the quality of democracy by reflecting on the current reality of not making the expected progress on issues such as strengthening democratic institutions, ensuring civil liberties, accountability of state organs, and socioeconomic transformation.\n\"Strengthening democracy, administrative restructuring, ensuring civic space, protecting human rights, good governance and controlling corruption, effective implementation of federalism, economic growth, industrialisation and commercialisation of agriculture, environmental protection, climate justice, disaster risk management, and the abolition of all forms of inequality and discrimination are now mandatory obligations,\" Bhattarai stated.\nCONSTITUTION AMENDMENT\nStating that the constitution of Nepal is a dynamic document, civil society organisations have suggested that other shortcomings ought to be strengthened while maintaining the founding principles of federal democratic republican government, inclusive democracy, fundamental rights and social justice.\n\"Civil society believes that amending the constitution is inevitable in the current context where the experience of almost a decade of implementing the constitution has exposed some structural, institutional, and governance-related weaknesses,\" the appeal letter reads.\nIn order to amend the constitution, it has also been noted that all political parties, the government, the parliament, the provincial and local levels, constitutional bodies, expert communities, and civil society should have extensive discussions.\nThe parties have been urged to issue a manifesto outlining their commitment to advancing the constitutional amendment process based on national consensus. Instead of focusing on power interests or short-term political gains, they advocate for amending the constitution to improve democracy and good governance, strengthen federalism, and address issues that directly affect citizens' lives.\nThey concluded that the electoral system outlined in the constitution has resulted in frequent government changes.\n\"We urge you to express your commitment to amend the constitution to ensure a sustainable and stable constitutional system for the operation of the government by reviewing the provisions related to the size of the parliament, vote of confidence, motion of no confidence, electoral system, and government formation,\" the statement continues, citing the detrimental effects of this trend on policy continuity, development, service delivery, and good governance. They proposed that this be reviewed, claiming that the state's financial burden has increased due to an excessive number of representatives in the House of Representatives and Provincial Assemblies.\n\"Civil society appeals to political parties to express their commitment to amend the constitution to make arrangements to reduce the number of members of the House of Representatives, to reduce the number of lawmakers in the Provincial Assemblies appropriately, and to make the constitutional guarantee of proportional and inclusive representation in the National Assembly more clear and effective,\" the letter reads.\nBOLSTER PROVINCIAL AND LOCAL LEVELS\nThe work of empowering the provinces and local levels in line with the spirit of federalism has not yet been completed as anticipated, according to civic organisations.\n\"The federal governance system has become weak due to the persistence of centralised thinking and practice,\" they state.\nPolitical parties should now implement a policy that gives the provinces constitutional authority by granting them rights, resources, and responsibilities. They believe that in order to make the federal governance system straightforward, economical, and efficient, structures with dual roles and ambiguous powers must be reviewed.\nThe citizens' appeal letter reads: 'Civic society warmly calls for amending the constitution to review and abolish the District Coordination Committee and to appropriately reduce the number of local levels and increase the number of wards.'\nIMPLEMENTATION OF FUNDAMENTAL FREEDOMS\nIn the 24-page, 13-point 'Citizens' Appeal Letter 2025', the parties are urged to clearly state when the implementation of citizens' constitutionally acquired fundamental rights will finally begin.\nIt has been emphasised that the manifestos presented by the parties at this time should address the issue of the implementation of fundamental rights, which are guaranteed to citizens by the constitution of Nepal promulgated in 2015.\nThe citizens' appeal states that the state should assume direct responsibility for basic health and education.\n\"The manifesto should include a clear policy commitment to ensure free and compulsory health and education.\"\nAdditionally, the parties have been asked to adopt a policy of progressively reducing and controlling the excessive privatisation of the health and education sectors and transforming these sectors into services focused on rights rather than profit. It has also been suggested that universities end widespread political bias and implement a policy of autonomy.\nAccording to the statement, the aspirations of inclusive democracy, social justice, equality, good governance, and prosperity have yet to be fully realised, with the implementation of fundamental rights being cited as an important factor.\nFREEDOM OF EXPRESSION MUST NOT BE HINDERED\nThrough the citizens' appeal, the parties have been made aware that the right to free speech should not be restricted.\n\"Tolerance towards criticism, dissent, caution, and alternative views should be maintained,\" reads the letter. 'Freedom of expression is the soul of liberal democracy. State entities should stop suppressing, threatening, or punishing people for exercising their right to free speech.'\nIt has been urged to declare a commitment to end excessive use of force, arbitrary arrests, and repressive practices, as well as to recognise peaceful protests, sit-ins, meetings, and protest programmes as democratic rights.\n\"Protect the rights of expression, organisation, and participation in digital media. Censorship, digital surveillance, and unnecessary restrictions ought to be eliminated. Data security, privacy, and internet freedom need to be safeguarded as fundamental rights,\" the letter reads.\nEASY ACCESS TO JUSTICE\n\"Easy and equal access to justice should be ensured,\" the appeal letter says. In order to prevent the impoverished, marginalised, and weak classes from being denied access to justice, the legal system should be made straightforward, transparent, and citizen-friendly.\nFurthermore, they have requested that human rights be upheld as every citizen's inherent, unalienable, and universal right. They contend that defending an individual's political, social, economic, and cultural rights is the state's primary duty.\nThe rights of children, women, youth, sexual and gender minorities, people with disabilities, Dalits, Madhesis, Muslims, Tharus, senior citizens, indigenous peoples, other underprivileged classes and communities, and marginalised groups should all be protected, according to civil society.\nThus, the election manifesto must include the issue of implementing special policies, budgets, and programmes.",
        "url": "https://thehimalayantimes.com/nepal/16-csos-appeals-political-parties-must-include-concerns-of-citizens-in-their-electoral-manifestos",
        "scraped_at": "2026-01-31T09:40:35.675413"
    },
    {
        "title": "Joint patrol for election security in Kathmandu",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nThe District Police Range, Kathmandu, has launched a joint patrol as part of security arrangements for the upcoming House of Representatives (HoR) election.\nChief of the District Police Range, Senior Superintendent of Police Ramesh Thapa, said that the joint patrol-conducted with sniffer dogs-has been deployed during both morning and night hours in accordance with the decision of the District Security Committee and the District Police Range.\nThapa stated that the mobilization of sniffer dogs has been intensified to detect explosives and drug-related activities. He added that surprise inspections are being carried out at various locations to ensure public safety.\nSpeaking at a press briefing on Thursday, Thapa noted that suspicious individuals are taken into custody for thorough investigation and released once cleared.\n\"A joint patrol involving the Nepali Army, the Armed Police Force, and the Nepal Police is being carried out in sensitive areas,\" he said.\nHe further explained that police personnel have been mobilized to gather intelligence on individuals or groups attempting to disrupt the election, and appropriate action is being taken accordingly.",
        "url": "https://thehimalayantimes.com/kathmandu/joint-patrol-for-election-security-in-kathmandu",
        "scraped_at": "2026-01-31T09:40:37.375741"
    },
    {
        "title": "India provides second tranche of election assistance to Nepal",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nIndia has provided the second tranche of election-related assistance to Nepal, with over 250 vehicles handed over to support preparations for the upcoming elections.\nThe handover ceremony took place at the Ministry of Finance in Kathmandu, attended by Nepal's Finance Minister Rameshore Prasad Khanal and Charge d'affaires a.i. of India, Dr. Rakesh Pandey.\nSpeaking at the event, Finance Minister Khanal highlighted the longstanding cooperation and friendly ties between India and Nepal, thanking the Government and people of India for the supplies and acknowledging their significance in preparations for upcoming elections.\n\n\nThe first tranche of India's election-related assistance was delivered to Nepal on January 20, 2026, and additional batches are expected in the coming weeks, according to the press release issued by the Indian Embassy in Kathmandu.\nThe ongoing cooperation and support from the Indian side is not only an apt reflection of the multi-faceted and multi-sectoral development partnership that exists between both countries, but also symbolizes the deep mutual trust and friendship between the people of India and Nepal, the embassy said.",
        "url": "https://thehimalayantimes.com/kathmandu/india-provides-second-tranche-of-election-assistance-to-nepal",
        "scraped_at": "2026-01-31T09:40:39.091663"
    },
    {
        "title": "EC submits National Assembly election report to Prez Paudel",
        "tag": null,
        "content": "KATHMANDU, JANUARY 28\nThe report on the National Assembly election held on January 25 has been formally submitted to President Ramchandra Paudel.\nOfficiating Chief Election Commissioner Ram Prasad Bhandari presented the report to the President at a ceremony held today at the Rastrapati Bhawan in Shital Niwas.\nSenior officials, including the Commission's commissioners Sagun Shamsher JBR and Dr. Janaki Kumari Tuladhar, as well as Secretary Krishna Bahadur Raut, were present at the event.",
        "url": "https://thehimalayantimes.com/kathmandu/ec-submits-national-assembly-election-report-to-prez-paudel",
        "scraped_at": "2026-01-31T09:40:40.890696"
    },
    {
        "title": "Israeli Embassy in Nepal marks International Holocaust Remembrance Day in Kathmandu",
        "tag": null,
        "content": "KATHMANDU, JANUARY 28\nThe Embassy of Israel in Nepal marked the United Nations International Holocaust Remembrance Day by hosting a memorial programme titled \"Zikaron Bassalon – Memory in the Living Room\" in Kathmandu on Wednesday.\nHeld under this year's global theme, \"Holocaust Remembrance for Dignity and Human Rights,\" the event commemorated the six million Jewish people who were systematically murdered during the Holocaust and reflected on the enduring responsibility to uphold human dignity and confront hatred and antisemitism.\nThe programme was attended by senior government officials, members of the diplomatic corps, media representatives and friends of Israel.\nAddressing the gathering, Israeli Ambassador to Nepal Shmulik Arie Bass said racial discrimination and genocidal ideologies must never be allowed to re-emerge. \"Racial discrimination and the desire to exterminate a people must not happen again. The Holocaust is a black mark on human history,\" he said.\nChairperson of the National Human Rights Commission, Top Bahadur Magar, said the Holocaust had a profound impact on the development of international human rights law. \"The Holocaust has had profound impact on International Human Rights Law, resulting in the United Nation's adoption of foundational documents in 1948: the Universal Declaration of Human Rights and the Convention on the Prevention and Punishment of the Crime of Genocide, in which Nepal is a state party,\" he said. He added, \"We seek a world of hope, tolerance and social justice where people live with dignity and equality.\"\nAmbassadors Udo Volz of Germany and Simon Ernst, Ambassador Designate of Australia, also shared reflections during the programme.\nA moving testimony was delivered by Holocaust survivor Sophia Geller, who recounted her personal experiences during the Nazi persecution. The programme also featured musical performances by two Nepali students and a video screening of Holocaust survivor Mr. Dugo, who marks freedom and life by eating falafel every January 18.\nThe Embassy of Israel reaffirmed its commitment to Holocaust education and to promoting peace, tolerance and mutual respect, noting that with very few survivors remaining, preserving their testimonies is essential for future generations.",
        "url": "https://thehimalayantimes.com/kathmandu/israeli-embassy-in-nepal-marks-international-holocaust-remembrance-day-in-kathmandu",
        "scraped_at": "2026-01-31T09:40:42.586576"
    },
    {
        "title": "Martyr Day being observed today",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nMartyr Day is being observed across the country today with various programmes to honor those who sacrificed their lives for the nation and its people.\nThe day commemorates the contributions and sacrifices of martyrs, including Shukra Raj Shastri, Dharma Bhakta Mathema, Dasharath Chand, and Ganga Lal Shrestha, along with other known and unknown martyrs who played a vital role in Nepal's struggle for democracy. Martyr Week is observed annually from Magh 10 to 16 by various organizations in memory of those who fought against the Rana regime.\nIn 1997 BS, Shukra Raj Shastri was executed at Pachali, Teku, on Magh 10; Dharma Bhakta Mathema at Shifal on Magh 13; and Ganga Lal Shrestha and Dasharath Chand at Shobha Bhagawati on Magh 15 for demanding independence and civil liberties.\nIn a message on the occasion, Prime Minister Sushila Karki paid tribute to all martyrs, stating that the country stands at a historic turning point due to their courage, awareness, and determination. She emphasized that the responsibility of building a nation grounded in ethics, good governance, and respect for citizens must remain a guiding principle for all leaders.\nSimilarly, President Ramchandra Paudel urged political parties, the public, and all stakeholders to work sincerely to fulfill the aspirations of the martyrs. In his message, he said Martyr Day should inspire efforts toward sustainable peace, good governance, development, and prosperity achieved through the federal democratic republican system.\nBoth leaders called for honoring the martyrs not only through remembrance but also by translating their sacrifices into meaningful progress for the nation.",
        "url": "https://thehimalayantimes.com/nepal/martyr-day-being-observed-today-40040",
        "scraped_at": "2026-01-31T09:40:44.284161"
    },
    {
        "title": "Laminar and Cresta Tiles receive Nepal Standard Product Certification",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nLumbini Ceramics Limited has received Nepal Standard (NS) Product Certification for its tile brands Laminar and Cresta under the newly implemented NS 617:2082 standard, marking a major milestone for Nepal's ceramic tile industry.\nAccording to the company, Laminar has been certified under the Fully Vitrified Tiles category (Group B Ia), while Cresta has received certification in the Porcelain Tiles category (Group B Ib). The certification was issued by the Department of Standards and Metrology.\nThe NS 617 standard is technically aligned with India's IS 15622 and, in certain parameters, exceeds international and European standards, providing Nepal with a nationally recognized and globally benchmarked quality framework. The standard introduces scientific classification of tiles based on water absorption, durability, and performance, offering greater transparency and protection for consumers.\nFully vitrified tiles, considered the highest category in ceramic tiles, feature extremely low water absorption and high resistance to wear, stains, and fading, making them suitable for high-traffic and outdoor areas. Porcelain tiles offer a balance of durability, design flexibility, and cost efficiency for residential and light commercial use.\nA key consumer-protection feature of NS 617 is the mandatory permanent marking of tile classification on each individual tile, enabling buyers and installers to verify product standards before installation.\nManaging Director of Lumbini Ceramics Limited, Ashutosh Khetan, described the certification as a landmark achievement for the domestic ceramic industry, stating that it establishes a clear national benchmark for quality while supporting domestic manufacturing and import substitution.\nLaminar and Cresta tiles are manufactured at the company's facility in Bardiya using advanced European technology and are available through authorized dealers nationwide.",
        "url": "https://thehimalayantimes.com/nepal/laminar-and-cresta-tiles-receive-nepal-standard-product-certification",
        "scraped_at": "2026-01-31T09:40:45.786954"
    },
    {
        "title": "16 CSOs' appeals: Political parties must include concerns of citizens in their electoral manifestos",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nWhile political parties are currently writing manifestos for the upcoming elections, over a dozen civic organisations have made public their shared perspectives on the problems confronting Nepali society and the policies that can be implemented to address them.\nSixteen civil society organisations led by the NGO Federation of Nepal (NFN) outlined their concerns and priority issues for political parties to include in their manifestos for the upcoming March 5 House of Representatives election in a press conference here yesterday.\nIn light of the citizen dissatisfaction and demands exposed by the Gen Z uprising on September 8 and 9, they highlighted that the upcoming House of Representatives elections on March 5 are not only regular elections but also a historic turning point in guiding the direction of democracy.\nThe upcoming March 5 elections, according to them, are more than just a formal process of power transfer; they are a historic opportunity that should prove to be a decisive turning point in the direction of restoring and expanding civil rights, ensuring accountable governance, institutional development of social justice, and inclusive and sustainable prosperity.\nThe appeal reflects civil society voices, emphasising democratic values, accountable governance, inclusion, and people-centred policies, with the goal of strengthening Nepal's democratic process ahead of the March 5 elections.\nArjun Bhattarai, president of the NFN, stated that an appeal paper was prepared based on interactions with citizens across the country and a study of a wide range of topics, including issues raised by previous citizen movements.\nHe also stated that this Citizen Appeal Letter 2025 is being made public as a collective voice of civil society organisations, networks, campaigns, activists, and other stakeholders, in collaboration with the NFN, and is being distributed to political parties.\n\"We intend to submit these pressing concerns to each political party and stakeholder, and we urge political parties to include issues directly related to citizens' lives, rights, and futures in their manifestos for the upcoming House of Representatives election in 2025 in a clear, committed, and implementable manner,\" he stated.\nHe clarified that 16 organisations are submitting 24-page proposals to each party and stakeholder. Social and civic organisations, consumer interest groups, and civil society have all contributed their suggestions in preparing it.\nThe organisations that have made such suggestions include the Federation of Non-Governmental Organisations Nepal, the Federation of Nepali Journalists, the Association of Community Radio Broadcasters, Dalit NGO Federation (DNF), the National Federation of Disabled, the Beyond Beijing Committee, the National Federation of Irrigation Water Consumers Association, Federation of Community Electricity, Federation of Drinking Water and Sanitation Consumers, and the National Federation of Indigenous and National Women's Federation Nepal, Consumer Interest Protection Forum, Youth Organization Network, Federation of Sexual and Gender Minorities, Blind Association Nepal and National Network of Women Human Rights Defenders.\nAccording to Bhattarai, the aspirations of citizens for fundamental rights, inclusive democracy, social justice, equality, good governance, and prosperity guaranteed by the 2015 Constitution of Nepal have yet to be fully implemented.\nAs a result, the citizen appeal raises serious concerns about the quality of democracy by reflecting on the current reality of not making the expected progress on issues such as strengthening democratic institutions, ensuring civil liberties, accountability of state organs, and socioeconomic transformation.\n\"Strengthening democracy, administrative restructuring, ensuring civic space, protecting human rights, good governance and controlling corruption, effective implementation of federalism, economic growth, industrialisation and commercialisation of agriculture, environmental protection, climate justice, disaster risk management, and the abolition of all forms of inequality and discrimination are now mandatory obligations,\" Bhattarai stated.\nCONSTITUTION AMENDMENT\nStating that the constitution of Nepal is a dynamic document, civil society organisations have suggested that other shortcomings ought to be strengthened while maintaining the founding principles of federal democratic republican government, inclusive democracy, fundamental rights and social justice.\n\"Civil society believes that amending the constitution is inevitable in the current context where the experience of almost a decade of implementing the constitution has exposed some structural, institutional, and governance-related weaknesses,\" the appeal letter reads.\nIn order to amend the constitution, it has also been noted that all political parties, the government, the parliament, the provincial and local levels, constitutional bodies, expert communities, and civil society should have extensive discussions.\nThe parties have been urged to issue a manifesto outlining their commitment to advancing the constitutional amendment process based on national consensus. Instead of focusing on power interests or short-term political gains, they advocate for amending the constitution to improve democracy and good governance, strengthen federalism, and address issues that directly affect citizens' lives.\nThey concluded that the electoral system outlined in the constitution has resulted in frequent government changes.\n\"We urge you to express your commitment to amend the constitution to ensure a sustainable and stable constitutional system for the operation of the government by reviewing the provisions related to the size of the parliament, vote of confidence, motion of no confidence, electoral system, and government formation,\" the statement continues, citing the detrimental effects of this trend on policy continuity, development, service delivery, and good governance. They proposed that this be reviewed, claiming that the state's financial burden has increased due to an excessive number of representatives in the House of Representatives and Provincial Assemblies.\n\"Civil society appeals to political parties to express their commitment to amend the constitution to make arrangements to reduce the number of members of the House of Representatives, to reduce the number of lawmakers in the Provincial Assemblies appropriately, and to make the constitutional guarantee of proportional and inclusive representation in the National Assembly more clear and effective,\" the letter reads.\nBOLSTER PROVINCIAL AND LOCAL LEVELS\nThe work of empowering the provinces and local levels in line with the spirit of federalism has not yet been completed as anticipated, according to civic organisations.\n\"The federal governance system has become weak due to the persistence of centralised thinking and practice,\" they state.\nPolitical parties should now implement a policy that gives the provinces constitutional authority by granting them rights, resources, and responsibilities. They believe that in order to make the federal governance system straightforward, economical, and efficient, structures with dual roles and ambiguous powers must be reviewed.\nThe citizens' appeal letter reads: 'Civic society warmly calls for amending the constitution to review and abolish the District Coordination Committee and to appropriately reduce the number of local levels and increase the number of wards.'\nIMPLEMENTATION OF FUNDAMENTAL FREEDOMS\nIn the 24-page, 13-point 'Citizens' Appeal Letter 2025', the parties are urged to clearly state when the implementation of citizens' constitutionally acquired fundamental rights will finally begin.\nIt has been emphasised that the manifestos presented by the parties at this time should address the issue of the implementation of fundamental rights, which are guaranteed to citizens by the constitution of Nepal promulgated in 2015.\nThe citizens' appeal states that the state should assume direct responsibility for basic health and education.\n\"The manifesto should include a clear policy commitment to ensure free and compulsory health and education.\"\nAdditionally, the parties have been asked to adopt a policy of progressively reducing and controlling the excessive privatisation of the health and education sectors and transforming these sectors into services focused on rights rather than profit. It has also been suggested that universities end widespread political bias and implement a policy of autonomy.\nAccording to the statement, the aspirations of inclusive democracy, social justice, equality, good governance, and prosperity have yet to be fully realised, with the implementation of fundamental rights being cited as an important factor.\nFREEDOM OF EXPRESSION MUST NOT BE HINDERED\nThrough the citizens' appeal, the parties have been made aware that the right to free speech should not be restricted.\n\"Tolerance towards criticism, dissent, caution, and alternative views should be maintained,\" reads the letter. 'Freedom of expression is the soul of liberal democracy. State entities should stop suppressing, threatening, or punishing people for exercising their right to free speech.'\nIt has been urged to declare a commitment to end excessive use of force, arbitrary arrests, and repressive practices, as well as to recognise peaceful protests, sit-ins, meetings, and protest programmes as democratic rights.\n\"Protect the rights of expression, organisation, and participation in digital media. Censorship, digital surveillance, and unnecessary restrictions ought to be eliminated. Data security, privacy, and internet freedom need to be safeguarded as fundamental rights,\" the letter reads.\nEASY ACCESS TO JUSTICE\n\"Easy and equal access to justice should be ensured,\" the appeal letter says. In order to prevent the impoverished, marginalised, and weak classes from being denied access to justice, the legal system should be made straightforward, transparent, and citizen-friendly.\nFurthermore, they have requested that human rights be upheld as every citizen's inherent, unalienable, and universal right. They contend that defending an individual's political, social, economic, and cultural rights is the state's primary duty.\nThe rights of children, women, youth, sexual and gender minorities, people with disabilities, Dalits, Madhesis, Muslims, Tharus, senior citizens, indigenous peoples, other underprivileged classes and communities, and marginalised groups should all be protected, according to civil society.\nThus, the election manifesto must include the issue of implementing special policies, budgets, and programmes.",
        "url": "https://thehimalayantimes.com/nepal/16-csos-appeals-political-parties-must-include-concerns-of-citizens-in-their-electoral-manifestos",
        "scraped_at": "2026-01-31T09:40:47.342687"
    },
    {
        "title": "Govt working to systematise Health Insurance Programme: Minister Gautam",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nMinister for Health and Population Dr Sudha Gautam Sharma has said that reform initiatives targeting the health insurance programme are underway.\nAddressing the 30th anniversary of the Shahid Gangalal National Heart Centre here today, the Minister said the government is working on initiatives aimed at further systematising the health insurance programme.\nShe said problems emerged after the budget allocated to the health insurance scheme became larger than the Ministry's overall budget itself.\nAccording to the Minister, doctors prescribing medicines beyond actual necessity and patients making unnecessary claims contributed to the problem, and the government is working to address these issues.\nThe Minister added that the federal government is currently bearing the sole financial burden of the health insurance programme, stressing the need for coordination among all three tiers of government to make the programme successful and sustainable.\nShe further clarified that the government will immediately provide funds to hospitals treating patients from indigent communities and for social service budgets. She also applauded the Centre's contribution to the treatment and prevention of heart diseases.\nHospital Executive Director Prof Dr Rabi Malla said the hospital provides quality services in the control, prevention, and treatment of heart diseases. The hospital, which began heart treatment with just nine beds in 2056 BS, has now expanded to 305 beds.\nSenior heart surgeon Dr Ramesh Koirala said the hospital recorded 1,990 heart surgeries last year alone, and urged the government to give it additional priority for further promotion.",
        "url": "https://thehimalayantimes.com/nepal/govt-works-to-systematise-health-insurance-programme-minister-gautam",
        "scraped_at": "2026-01-31T09:40:49.194953"
    },
    {
        "title": "Bangladesh's ousted leader Hasina denounces the upcoming election from her exile in India",
        "tag": null,
        "content": "DHAKA, JANUARY 30\nFrom her exile in India, Bangladesh's ousted leader Sheikh Hasina has slammed the country's upcoming election after her party was barred from the polls, remarks that could deepen tensions ahead of the pivotal vote next month.\nHasina, who was sentenced to death for her crackdown on a student uprising in 2024 that killed hundreds of people and led to the toppling of her 15-year rule, warned in an email to The Associated Press last week that without inclusive and free and fair elections, Bangladesh will face prolonged instability.\nShe also claimed that Bangladesh's interim government led by Nobel Peace Prize laureate Muhammad Yunus deliberately disenfranchised millions of her supporters by excluding her party - the former ruling Awami League - from the election.\n\"Each time political participation is denied to a significant portion of the population, it deepens resentment, delegitimizes institutions and creates the conditions for future instability,\" she wrote.\n\"A government born of exclusion cannot unite a divided nation,\" Hasina added.\nA fraught election\nMore than 127 million people in Bangladesh are eligible to vote in the Feb. 12 election, widely seen as the country's most consequential in decades and the first since Hasina's removal from power after the mass uprising.\nYunus' interim administration is overseeing the process, with voters also weighing a proposed constitutional referendum on sweeping political reforms. Campaigning started last week, with rallies in the capital, Dhaka, and elsewhere.\nYunus returned to Bangladesh and took over three days after Hasina fled to India on Aug. 5, 2024, following weeks of violent unrest. He has promised a free and fair election, but critics question whether the process will meet democratic standards and whether it will be genuinely inclusive after the ban on Hasina's Awami League.\nThere are also concerns over security and uncertainty surrounding the referendum, which could bring about major changes to the constitution.\nYunus' office said in a statement to the AP that security forces will ensure an orderly election and will not allow anyone to influence the outcome through coercion or violence. International observers and human rights groups have been invited to monitor the process, the statement added.\nThe Election Commission says some 500 foreign observers, including from the European Union and the Commonwealth, are expected to watch the polls on Feb. 12.\nWorries over what's ahead\nSince Hasina's ouster, Bangladesh has faced a slew of political and security challenges.\nHuman rights and minority groups have accused the interim authorities of failing to protect civil and political rights. Hasina's party has alleged arbitrary arrests and deaths in custody of its members, claims that the government has denied.\nCritics have also voiced alarm over the growing influence of Islamist groups and attacks on minorities, particularly Hindus.\nThere are also growing concerns over press freedoms under Yunus, with several journalists facing criminal charges and the offices of the country's two leading dailies coming under attack by angry protesters.\nMeanwhile, the Bangladesh Nationalist Party, led by Tarique Rahman, 60, has emerged as the leading contender in the vote.\nRahman, the son of former Prime Minister Khaleda Zia - Hasina's chief rival who died last month - returned home in December after more than 17 years in self-imposed exile. He has promised to work for the stability of this South Asian nation of 170 million people.\nRahman's main rival in the February vote is a coalition of 11 allied groups headed by an Islamist party, the Jamaat-e-Islami.\nUnder Hasina, Jamaat-e-Islami was under severe pressure and barred from elections. Its top leaders faced executions or prison terms on war crimes charges related to Bangladesh's independence war against Pakistan 1971.\nThe Bangladesh Nationalist Party, or BNP, boycotted elections in 2014 and 2024. It took part in 2018 but later accused Hasina of rigging the polls.\nHasina says the nation must 'heal its wounds'\nCritics have long accused Hasina of presiding over an increasingly authoritarian system. She also faced criticism over suppression of dissent and of her political opponents, with security agencies under her government facing charges of enforced disappearances.\nStill, Hasina has dismissed the Bangladesh court that sentenced her to death in absentia on charges of crimes against humanity over the uprising killings as a \"kangaroo court.\"\nInternational rights groups have raised concerns about the fairness of the trial.\nIn her email to the AP, Hasina said that to move forward, Bangladesh needs to break the cycle of political bans and boycotts. She contended that under her government, some elections were \"not truly participatory because major political parties chose to boycott democratic processes.\"\n\"I recognize this was far from ideal,\" she said, adding that Bangladesh's political parties must now end that cycle. \"Otherwise, there will be no redemption.\"\nThe country, she added, \"needs a legitimate government\" that would govern \"with the genuine consent of the people.\"\n\"That is the best way for the nation to heal its wounds,\" she said.",
        "url": "https://thehimalayantimes.com/world/bangladeshs-ousted-leader-hasina-denounces-the-upcoming-election-from-her-exile-in-india",
        "scraped_at": "2026-01-31T09:40:50.912939"
    },
    {
        "title": "What is causing defoliation in Shorea robusta in Nepal's Dailekh district?",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nFollowing reports of widespread defoliation in sal (Shorea robusta) forests in Dailekh district, the Forest Research and Training Centre (FRTC), under the Ministry of Forests and Environment, has conducted a field investigation to determine the causes.\nA three-member team led by Sunita Ulak, Undersecretary at FRTC, included Dr. Prem Budha, an entomologist at Tribhuvan University, and FRTC researcher Pratik Pandey. The study was carried out in coordination with the Ministry of Industry, Tourism, Forests and Environment of Karnali Province, the Karnali Province Forest Directorate, and the Forest Division Office in Dailekh.\nLocal accounts from Kimugaun Community Forest indicate that a similar outbreak occurred approximately three years ago but subsided naturally following timely winter rainfall.\nScope of the Damage\nAccording to Ulak, Nepal's sal forests host a wide range of insect species, including defoliators, sap-sucking insects, leaf miners, and wood borers. Among them, defoliators-primarily moths and butterflies in their larval (caterpillar) stage-pose the greatest threat, as they feed intensively on sal leaves, weakening tree health and reducing forest productivity.\nPreliminary observations show that sal forests in Kimugaun, Chupra, Kotila, Sristhan, and Belpata have been severely affected. The outbreak is believed to have been triggered by a prolonged dry season and insufficient winter rainfall, which created favorable conditions for insect proliferation.\n\"Due to delayed reporting of the outbreak, we were unable to collect live larvae or adult insects, making species-level identification difficult,\" Ulak said.\n\n\nEarly Observations\nLocal communities reported that the insects first appeared around five months ago (around Aswin) and gradually began feeding on sal leaves. At present, foliage in most affected areas has been almost entirely destroyed, Ulak noted following her field visit.\nDelayed communication with authorities allowed the infestation to progress to an advanced stage, complicating both management efforts and scientific assessment. This highlights the critical need for early detection and timely reporting in future outbreaks.\n\"We observed extensive damage caused by hairy leaf-eating larvae, particularly in the western and southern forest blocks,\" Ulak added.\nAlthough no live larvae, pupae, or adult insects were found during the survey, large quantities of exuviae (molted skins) and pupal cases were recorded. Preliminary findings suggest the infestation is likely caused by a single species or a small group of closely related species.\nThe larvae are believed to belong to the Erebidae and Lasiocampidae families; however, laboratory analysis will be required for definitive taxonomic identification, lead investigator Dr Budha said.\nProbable Causes and Climatic Influence\nSpeaking to The Himalayan Times, Dr. Prem Budha stated that there is no conclusive evidence directly linking the outbreak to climate change, though climatic factors appear to have played a contributing role.\n\"Prolonged drought, inadequate winter rainfall, and seasonal irregularities seem to have created conditions favorable for insect population growth,\" Budha said. He noted that southern and western forest areas were more vulnerable due to their warmer microclimate.\n\n\nHistorical records show a similar outbreak occurred three years ago, but insect populations declined naturally following winter rains, indicating that precipitation plays a key role in regulating pest cycles. In some heavily affected zones, sal trees have already begun early budding, suggesting the forest is undergoing natural regeneration despite the damage, Budha added.\nExpert Insights\nDr. Budha explained that the outbreak is caused by moth larvae classified as defoliators. \"Sal forests host between 300 and 400 species of leaf-eating insects, but only one or two species typically trigger large-scale outbreaks,\" he said. \"Our field observations confirmed intense larval activity, with abundant molted skins and pupal cases.\"\nInsects in sal forests are categorized based on the type of damage they cause, including leaf chewers, sap suckers, leaf borers, flower and fruit feeders, and wood borers. \"However, the current outbreak is clearly driven by defoliators that feed directly on leaves,\" he said.\nAdult moths typically emerge during Chaitra–Baisakh (March–April), laying eggs on sal leaves. The larvae undergo five to six molting stages before pupating and eventually emerging as adult moths.\nManagement Measures\nUlak warned that similar outbreaks could occur in other sal forest regions and urged community forest user groups to remain vigilant and report infestations at an early stage.\nShe recommended light forest cleaning and pruning during Bhadra–Ashoj (August–October) to reduce infestation risks. She also suggested scientific control measures such as light traps during the adult emergence period to limit pest populations.\nDr. Budha concluded that the defoliation crisis in Dailekh is driven by multiple factors, including seasonal conditions, insect life cycles, and broader climatic trends. He emphasized the importance of early intervention, community participation, and long-term scientific monitoring to prevent future outbreaks.\n''We plan to return to the affected areas next season to conduct further studies and determine the precise cause of the infestation,\" Ulak said.",
        "url": "https://thehimalayantimes.com/nepal/what-is-causing-defoliation-in-shorea-robusta-in-nepals-dailekh-district",
        "scraped_at": "2026-01-31T09:40:52.722332"
    },
    {
        "title": "Gold price drops after record high, silver also declines",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nGold price in the domestic market declined on Friday after reaching a historic high a day earlier.\nThe price of gold, which surged by Rs 20,500 per tola on Thursday to a record Rs 339,300 per tola, fell by the same margin on Friday to Rs 313,800 per tola, according to the Federation of Nepal Gold and Silver Dealers' Association.\nThe latest price is the same as Wednesday's rate, which had itself marked a historic high following a Rs 9,500 per tola increase.\nMeanwhile, silver price also eased in the domestic market. Silver, which had climbed to Rs 7,300 per tola on Thursday, declined by Rs 235 per tola on Friday and is being traded at Rs 7,065 per tola, the federation said.",
        "url": "https://thehimalayantimes.com/business/gold-price-drops-after-record-high-silver-also-declines",
        "scraped_at": "2026-01-31T09:40:54.389473"
    },
    {
        "title": "Russia and Ukraine's combined war casualties could reach 2 million soon, report estimates",
        "tag": null,
        "content": "KYIV, JANUARY 29\nThe number of soldiers killed, injured or missing on both sides of Russia's war on Ukraine could be 2 million by spring, with Russia sustaining the largest number of troop deaths for any major power in any conflict since World War II, a report warned Tuesday.\nThe report from the Center for Strategic and International Studies came less than a month before the fourth anniversary of Moscow's full-scale invasion of Ukraine on Feb. 24.\nAs the war grinds through another bitterly cold winter, Russian strikes damaged an apartment block Wednesday on the outskirts of Kyiv, killing two people. Nine others were injured in attacks in the Ukrainian cities of Odesa and Kryvyi Rih and in the front-line Zaporizhzhia region.\nThe CSIS report said Russia suffered 1.2 million casualties, including up to 325,000 troop deaths, between February 2022 and December 2025.\n\"Despite claims of battlefield momentum in Ukraine, the data shows that Russia is paying an extraordinary price for minimal gains and is in decline as a major power,\" the report said. \"No major power has suffered anywhere near these numbers of casualties or fatalities in any war since World War II.\"\nIt estimated that Ukraine, with its smaller army and population, had suffered between 500,000 to 600,000 military casualties, including up to 140,000 deaths.\nNeither Moscow nor Kyiv gives timely data on military losses, and each side seeks to amplify the other side's casualties.\nCommenting on the report, Kremlin spokesperson Dmitry Peskov said Wednesday that the research could not be considered \"reliable information\" and that only Russia's Ministry of Defense was authorized to provide information on military losses.\nThe ministry has not released figures on battlefield deaths since a statement in September 2022 that said just under 6,000 Russian soldiers had been killed.\nThe Ukrainian government had no immediate comment on the report. In an interview with NBC in February 2025, Ukrainian President Volodymyr Zelenskyy said that more than 46,000 Ukrainian soldiers had been killed since the war began.\nThe CSIS report estimated that at current rates, combined Russian and Ukrainian casualties may be as high as 1.8 million and could reach 2 million by spring.\nThe figures from the CSIS were compiled using the Washington-based think tank's own analysis, data published by independent Russian news site Mediazona with the BBC, estimates by the British government and interviews with state officials.\nA war of attrition\nReports about military losses have been repressed in Russian media, activists and independent journalists say.\nMediazona, together with the BBC and a team of volunteers, has so far collected the names of more than 160,000 troops killed by scouring news reports, social media and government websites.\nThe report also said Russian forces were advancing at a sluggish pace since they seized the initiative on the battlefield in 2024, despite their much larger size.\nRussia's advance in Ukraine has largely settled into a grinding war of attrition, and analysts say Russian President Vladimir Putin is in no rush to find a settlement, despite his army's difficulties on the roughly 1,000-kilometer (600-mile) front line.\nThe report said Russian forces have advanced at an average rate of between 15 and 70 meters (49 to 230 feet) per day in their most prominent offensives.\nThat is \"slower than almost any major offensive campaign in any war in the last century,\" the report said.\nPutin told his annual news conference last month that 700,000 Russian troops are fighting in Ukraine. He gave the same number in 2024, and a slightly lower figure - 617,000 - in December 2023. It was not possible to verify those figures.\n2 killed in attack in Kyiv region\nOfficials said Wednesday that two people were killed near the Ukrainian capital and at least nine others were injured in attacks across Ukraine.\nA man and a woman died in an overnight attack in the Bilohorodka area on the outskirts of Kyiv, according to Mykola Kalashnyk, head of the regional military administration.\nOfficials in the Ukrainian cities of Odesa and Kryvyi Rih, as well as the Zaporizhzhia region, also reported Russian strikes overnight, wounding at least nine people and damaging infrastructure.\nUkraine's air force said that Russia attacked overnight with one ballistic missile and 146 strike drones, 103 of which were shot down or destroyed using electronic warfare.\nMeanwhile, Russia's Ministry of Defense said its air defenses destroyed 75 Ukrainian drones overnight. Twenty-four were shot down over Russia's southwestern Krasnodar region, with 23 more shot down over the Crimean Peninsula, which Russia illegally annexed in 2016.\nTwo drones were reportedly shot down over Russia's Voronezh region, where Ukraine's General Staff said Wednesday that it had struck the Khokholskaya oil depot. Regional Gov. Alexander Gusev wrote on Telegram that falling drone debris sparked a fire involving oil products, but did not give further details.",
        "url": "https://thehimalayantimes.com/world/russia-and-ukraines-combined-war-casualties-could-reach-2-million-soon-report-estimates",
        "scraped_at": "2026-01-31T09:40:56.186842"
    },
    {
        "title": "Starmer and Xi call for deeper UK-China ties as Trump shakes up global relations",
        "tag": null,
        "content": "BEIJING, JANUARY 29\nThe leaders of Britain and China called Thursday for a \"strategic partnership\" to deepen ties between their nations at a time of growing global turbulence as they sought to thaw relations after years of chill.\nNeither Prime Minister Keir Starmer nor President Xi Jinping publicly mentioned Donald Trump, but the U.S. president's challenge to the post-Cold War order was clearly on their minds.\n\"I think that working together on issues like climate change, global stability during challenging times for the world is precisely what we should be doing as we build this relationship in the way that I've described,\" Starmer told Xi at the start of their meeting in Beijing.\nThe two met for 80 minutes - double the scheduled time - in the Great Hall of the People as their nations try to improve relations after several years of acrimony. Relations have deteriorated over allegations of Chinese spying in Britain, China's support for Russia in the Ukraine war and the crackdown on freedoms in Hong Kong, the former British colony that was returned to China in 1997. Starmer is the first British prime minister to visit in eight years.\nXi said that \"China-U.K. relations experienced twists and turns in previous years, which was not in the interests of either country.\"\n\"In the current turbulent and ever-changing international situation ... China and the U.K. need to strengthen dialogue and cooperation to maintain world peace and stability,\" he said.\nChinese state broadcaster CCTV said Xi had stressed, without mentioning the U.S. directly, that \"major powers\" must adhere to international law or the world would regress into a \"jungle.\"\nRelationship is in 'a good place'\nStarmer's Downing Street office said Britain wanted \"a consistent, long-term, and strategic partnership that will benefit both countries.\"\nAfter the meeting, Starmer said the leaders had made \"really good progress\" on issues including slashing Chinese tariffs on Scotch whisky and introducing visa-free travel for British visitors.\n\"The relationship is in a good place, a strong place,\" the British leader said.\nXi appeared to acknowledge the criticism that Starmer has faced for reaching out to China despite national security and human rights concerns. The U.K. recently approved controversial plans for a huge Chinese Embassy in London, removing a sticking point in relations but also overriding fears that the \"mega-embassy\" would make it easier for China to conduct espionage and intimidate dissidents.\n\"Good things often come with difficulties,\" Xi said. \"As long as it is the right thing to do in accordance with the fundamental interests of the country and its people, leaders will not shy away from difficulties and will forge ahead bravely.\"\nStarmer's visit comes less than two months after a Hong Kong court convicted Jimmy Lai, a former newspaper publisher and British citizen, under a national security law that Beijing imposed on the territory after massive pro-democracy protests in 2019.\nStarmer said he raised human rights issues with Xi and the two men had a \"respectful discussion.\"\nStarmer, who was elected in July 2024, has said he will protect national security while keeping up diplomatic dialogue and economic cooperation with China. He told Xi that it has \"been far too long\" since a U.K. prime minister visited.\n\"I made a promise 18 months ago when we were elected into government, that I would make Britain face outward again,\" the leader of the center-left Labour Party said. \"Because as we all know, events abroad affect everything that happens back in our home countries, from prices on the supermarket shelves to how secure we feel.\"\nStarmer's government has struggled to deliver the economic growth it promised and ease a cost-of-living crisis for millions of households and he sees China as a potential source of growth.\nMore than 50 U.K. business executives have joined him on the trip, along with the leaders of major cultural organizations, as he seeks to expand opportunities for British companies in China and secure Chinese investment in the U.K.\nTrump tariffs spur new trade talks\nThe disruption to global trade under Trump has made expanding trade and investment more imperative for many governments. Vietnam and the European Union upgraded ties to a comprehensive strategic partnership Thursday, two days after the EU and India announced a free trade accord.\n\"At a moment when the international rules-based order is under threat from multiple sides, we need to stand side by side as reliable and predictable partners,\" European Council President Antonio Costa said in Hanoi, Vietnam.\nStarmer is the fourth leader of a U.S. ally to visit Beijing this month, following those of South Korea, Canada and Finland. The German chancellor is expected to visit next month.\nThe U.K. leader also met Thursday with Zhao Leji, the chairman of China's legislature, the National People's Congress, and Premier Li Qiang, who told Starmer his efforts to improve relations had been \"widely welcomed\" in both countries.\nThe two countries were expected to sign a number of agreements. One will try to disrupt the trade in Chinese boat engines used by smugglers to bring people across the English Channel to Britain. More than half the engines come from China, the British government said. Under the agreement, U.K law enforcement agencies will work with Chinese authorities and manufacturers to prevent engines from ending up in the hands of criminal gangs.",
        "url": "https://thehimalayantimes.com/world/starmer-and-xi-call-for-deeper-uk-china-ties-as-trump-shakes-up-global-relations",
        "scraped_at": "2026-01-31T09:40:57.877015"
    },
    {
        "title": "Senior state official among 5 dead after private plane crash in western India",
        "tag": null,
        "content": "NEW DELHI, JANUARY 28\nA private plane carrying a senior state official crashed in western India on Wednesday, killing all five people on board, aviation authorities said.\nThe Learjet 45 was en route from India's financial capital of Mumbai to Ajit Pawar's home city Baramati when it crash-landed and burst into flames in an open field near the runway, 254 kilometers (159 miles) from Mumbai. Television footage showed smoke rising from the wreckage.\nLocal media cited poor visibility as a possible cause of the crash, which is being investigated by India's Aircraft Accident Investigation Bureau.\nBaramati is an uncontrolled airfield, meaning it doesn't have a dedicated air traffic control tower, according to a statement from the Ministry of Civil Aviation. Traffic information at the airstrip is provided by instructors from nearby flying training organizations.\nThe ministry said the aircraft's crew enquired about winds and visibility with a local instructor before attempting to land. The crew initially reported that the runway wasn't visible despite calm winds and visibility being around 3,000 meters.\nPawar, 66, was the deputy chief minister of India's western Maharashtra state. He was traveling to Baramati to campaign in a local election.\nTwo of his staff and two crew members on board the mid-size aircraft also died, the directorate general of civil aviation said in a statement.\nPawar was a key figure in state politics and served as the second highest elected official in Maharashtra as part of Indian Prime Minister Narendra Modi's ruling coalition. He wielded considerable influence in the the state's sugar belt and was known for his ability to mobilize rural voters.\nModi described Pawar as a committed public servant.\n\"His understanding of administrative matters and passion for empowering the poor and downtrodden were also noteworthy,\" Modi said on X. \"His untimely demise is very shocking and saddening. Condolences to his family and countless admirers.\"",
        "url": "https://thehimalayantimes.com/world/senior-state-official-among-5-dead-after-private-plane-crash-in-western-india",
        "scraped_at": "2026-01-31T09:40:59.603542"
    },
    {
        "title": "India and EU clinch the 'mother of all deals' in a historic free trade agreement",
        "tag": null,
        "content": "NEW DELHI, JANUARY 27\nIndia and the European Union reached a free trade agreement to deepen economic and strategic ties, officials said Tuesday, after nearly two decades of negotiations.\nThe accord, which the head of the EU's executive branch described as the \"mother of all deals,\" could affect as many as 2 billion people. It will likely take several months before the agreement takes effect.\nThe deal between two of the world's biggest markets comes as Washington targets both the Asian powerhouse and the EU bloc with steep import tariffs, disrupting established trade flows and pushing major economies to seek alternate partnerships.\n\"This agreement will bring major opportunities for the people of India and Europe,\" Indian Prime Minister Narendra Modi said in a virtual address to an energy conference. \"It represents 25% of the global GDP and one-third of global trade.\"\nThe accord will see free trade on almost all goods between the EU's 27 members and India, covering everything from textiles to medicines, and bringing down high import taxes for European wine and cars.\nIndia and the EU also agreed on a framework for deeper defense and security cooperation, and a separate pact aimed at easing mobility for skilled workers and students, signaling that their partnership extends beyond commerce.\nU.S. pressure propels deal\nThe negotiations for the India-EU deal got a new impetus after U.S. President Donald Trump's strong-arm trade tactics, including threatening his European allies with punitive tariffs over their objections to Trump's threats to take control of Greenland.\nModi, speaking at a joint news conference in New Delhi with European Commission President Ursula von der Leyen and European Council President António Costa, said that the partnership with the EU \"will strengthen stability in the international system\" at a time of \"turmoil in the global order.\"\n\"Europe and India are making history today. We have concluded the mother of all deals,\" von der Leyen posted on X.\nIn a speech later, she said that the accord was a tale of \"two giants\" who chose partnership \"in a true win-win fashion.\" She also said that it sends \"a strong message that cooperation is the best answer to global challenges.\"\nThe deal is expected to further integrate supply chains and strengthen joint manufacturing power between the two economies. It will also cut up to 4 billion euros ($4.7 billion) in annual tariffs for exporters and create jobs for millions of workers in India and Europe.\nEasing regulation\nA formal signing of the deal could come later this year after officials go through the legal details of the text and the European Parliament ratifies it. India's trade minister, Piyush Goyal, said that he expected the deal to take effect by the end of the year.\nIndia is expected to reduce or eliminate tariffs for 96.6% of EU exports, while Brussels will reciprocate with similar reductions in phases that eventually cover nearly 99% of India's shipments by trade value, according to statements from both sides.\nIndia's sectors poised to gain from the deal include textiles, apparel, engineering goods, and leather, handicraft, footwear and marine products, while the EU's gains will be in wine, automobiles, chemicals and pharmaceuticals, among others.\nA quota system for automobiles, wines and whisky has been agreed upon, bringing down steep duties.\nThe European Commission said that tariffs charged by India on EU-made cars will gradually go down from 110% to as low as 10%, while they will be fully abolished for car parts after five to 10 years. Tariffs ranging up to 44% on machinery, 22% on chemicals and 11% on pharmaceuticals will also be mostly eliminated.\nOn European wine, the tariffs in India would come down from 150% to 20% for premium wines.\nNew Delhi has excluded dairy products such as milk and cheese from the deal, along with cereals, citing \"domestic sensitivities\" about those products. For its part, the EU won't allow concessional tariffs on imports of Indian sugar, meat, poultry and beef products, Indian Trade Ministry officials said.\nOffsetting U.S. tariffs impact\nIndia is looking to diversify its export destinations as part of a strategy to offset the impact of higher U.S. tariffs, including an extra 25% levy on Indian goods for its unabated purchases of discounted Russian oil, bringing the combined tariffs imposed by the United States on its Asian ally to 50%.\nFor the EU, the deal offers the bloc expanded access to one of the world's fastest-growing major economies, and helps European exporters and investors reduce their reliance on more volatile markets.\n\"This is the most comprehensive trade deal India has ever signed, which gives European companies a first mover advantage into this market and gives them a strategic upper hand that other players do not,\" said Garima Mohan, a senior fellow at the German Marshall Fund.\nTrade between India and EU stood at $136.5 billion in 2024 to 2025. The two sides hope to increase that to about $200 billion by 2030, Indian officials said.\n\"Ultimately, the agreement is about creating a stable commercial corridor between two major markets at a time the global trading system is fragmenting,\" Indian trade analyst Ajay Srivastava said.\nThe EU is still reeling from the aggressive approach of its once-stalwart ally across the Atlantic. There's a widespread sense of betrayal across the bloc from Trump's onslaught of higher tariffs, embrace of far-right parties and belligerence over Greenland, a semiautonomous territory of EU member Denmark.\nBrussels has accelerated its outreach to markets around the world. Over the past year, von der Leyen has signed deals with Japan, Indonesia, Mexico and South America under the catchphrase \"strategic autonomy,\" which in practice is akin to decoupling from a U.S. seen by most European leaders as erratic.",
        "url": "https://thehimalayantimes.com/world/india-and-eu-clinch-the-mother-of-all-deals-in-a-historic-free-trade-agreement",
        "scraped_at": "2026-01-31T09:41:01.354903"
    },
    {
        "title": "Gold price drops after record high, silver also declines",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nGold price in the domestic market declined on Friday after reaching a historic high a day earlier.\nThe price of gold, which surged by Rs 20,500 per tola on Thursday to a record Rs 339,300 per tola, fell by the same margin on Friday to Rs 313,800 per tola, according to the Federation of Nepal Gold and Silver Dealers' Association.\nThe latest price is the same as Wednesday's rate, which had itself marked a historic high following a Rs 9,500 per tola increase.\nMeanwhile, silver price also eased in the domestic market. Silver, which had climbed to Rs 7,300 per tola on Thursday, declined by Rs 235 per tola on Friday and is being traded at Rs 7,065 per tola, the federation said.",
        "url": "https://thehimalayantimes.com/business/gold-price-drops-after-record-high-silver-also-declines",
        "scraped_at": "2026-01-31T09:41:02.861050"
    },
    {
        "title": "Nepal consulate warns Nepalis in US against misuse of public benefits, visa violations",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nThe Consulate General of Nepal in New York has issued an urgent notice warning Nepali citizens residing in the United States against illegally accessing public benefits and misusing visa conditions, stating that such actions could lead to visa or Green Card cancellation.\nAccording to the notice, U.S. authorities have informed that foreign nationals who provide false or misleading information to obtain benefits meant for U.S. citizens, such as subsidized healthcare, housing, family assistance, or educational support, may face direct legal consequences affecting their immigration status.\nThe consulate noted that data from Nepali citizens who traveled to the U.S. in 2024 show Nepalis among the top groups availing subsidized services, prompting the U.S. government to issue a public notice temporarily suspending immigrant visas for Nepali nationals.\nIn addition, citing cases of overstaying and unauthorized employment by Nepali nationals on B1/B2 visas, the U.S. government has introduced a visa bond requirement ranging from USD 5,000 to USD 15,000, effective January 21, 2026.\nThe consulate warned that continued violations could further tighten U.S. visa policies toward Nepal, making visa approval more difficult and harming the country's international image. It urged all Nepali citizens in the United States to strictly comply with U.S. laws, avoid dependence on unauthorized public assistance, and refrain from misuse of visa privileges.",
        "url": "https://thehimalayantimes.com/nepal/nepal-consulate-warns-nepalis-in-us-against-misuse-of-public-benefits-visa-violations",
        "scraped_at": "2026-01-31T09:41:04.689449"
    },
    {
        "title": "Team Ventures invests in Soaltee Westend Itahari, marks hospitality foray",
        "tag": null,
        "content": "KATHMANDU, JANUARY 30\nTeam Ventures, a leading private equity and venture capital firm has made its first investment in the hospitality sector through an investment in Hotel Garima Limited, the owner of Soaltee Westend Itahari, with Team Ventures and its affiliates acquiring a 27% equity stake in the company.\nSoaltee Westend Itahari, a five-star–level hotel, is located in an emerging commercial and transit hub in eastern Nepal and operates under the Soaltee Hotels & Resorts brand, Nepal's first international hotel chain.\n\"The investment is expected to support the company's next phase of growth by advancing expansion, strengthening governance, and enhancing institutional capabilities,\" said Kesang Shrestha, Chairman of Team Ventures. The investment is supported by Team Ventures' board and leadership team, which brings deep sectoral and hospitality experience, including senior leadership and board-level involvement with international hotel chains in Nepal and the region.\n\"We have been actively exploring opportunities in the hospitality sector, given its importance to Nepal's tourism ecosystem and the broader economy,\" said Dorje Gyaltsen Lama, Director of Team Ventures. \"Soaltee Westend Itahari combines a strong brand, an experienced operator, and clear growth potential, and we look forward to supporting the company as it continues to scale and strengthen its institutional foundation.\"\n\"As an equity partner, our role will go beyond capital,\" said Bijaya Bahadur Shrestha, Director of Team Ventures. \"We will focus on strengthening governance, building organizational capacity, and working alongside management to support long-term, professionally managed growth.\"\n\"We are pleased to welcome Team Ventures as an equity partner,\" said Binod Poudel, Managing Director of Soaltee Westend Itahari. \"The partnership brings institutional capital and experience that we believe will support our expansion initiatives and the company's continued growth.\"\nTeam Ventures is a leading alternative investment firm established in 2016, focused on investing in growth-oriented businesses across multiple sectors. Its investment portfolio spans clean energy, agriculture, manufacturing, technology, and media.",
        "url": "https://thehimalayantimes.com/business/team-ventures-invests-in-soaltee-westend-itahari-marks-hospitality-fth",
        "scraped_at": "2026-01-31T09:41:06.534382"
    },
    {
        "title": "Universal Health Coverage: The decisive election agenda",
        "tag": null,
        "content": "Ensuring Universal Health Coverage (UHC) is one of the defining policy challenges of the 21st century. In election periods, few issues resonate more powerfully with voters. Everywhere, people want the same simple assurance: access to good-quality health care for themselves and their family, and protection from the financial shock of illness. Health is personal, universal, and deeply political. When political leaders understand this-and act on it-they do not just improve lives; they also significantly increase their chances of electoral success.\nThe evidence that health tops voters' priorities is unequivocal. The UN75 global survey conducted in 2020 to mark the United Nations' 75th anniversary found that access to quality health care was the single most important issue for people worldwide.\nThe most effective response to this demand has been the creation of universal health systems underpinned by socialised financing. These systems pool resources so that the healthy and wealthy subsidise care for the sick and the poor. Today, all high-income countries-except the United States-have adopted some version of this model. Whether funded through general taxation, social insurance, or a mix of both, the principle is clear: no one should be denied care or pushed into poverty because they fall ill.\nCountries with strong UHC systems enjoy longer life expectancy, lower maternal and child mortality, and better management of chronic disease. A healthier population is also more productive and remains economically active for longer. UHC therefore supports sustainable economic growth as well as social welfare.\nUniversal health systems also reduce inequality. Heavy reliance on out-of-pocket payments disproportionately harms the poorest, who often delay care, sell assets, or fall into debt to pay medical bills. Publicly financed systems redistribute resources across society, narrowing health and income gaps. When citizens know they are all contributing to and benefiting from the same system, trust in public institutions grows and willingness to pay taxes increases.\nToo often overlooked is the contribution of UHC to peace and political stability. Access to basic services is a cornerstone of the social contract between citizens and the state. When governments deliver on health, they demonstrate responsiveness and legitimacy. When they fail, grievances deepen-particularly in fragile or post-conflict settings.\nPerhaps most importantly for politicians, universal health reforms are extremely popular. Leaders who deliver health security are frequently rewarded at the ballot box and remembered as nation builders.\nHistory offers powerful examples. In the United Kingdom, the Labour Party won a landslide victory in 1945 after promising universal health care following the devastation of the Second World War. The National Health Service, launched in 1948, transformed access to care and remains the country's most popular public institution. In Japan, post-war expansion to universal health insurance helped rebuild the nation and underpin decades of economic growth and social cohesion. In Thailand, following the Asian financial crisis, Prime Minister Thaksin Shinawatra's universal coverage scheme became one of the most popular policies in modern Thai history and a key factor in his party's repeated electoral success.\nNepal's own experience fits this pattern. Following the pro-republic people's movement, political leaders enshrined health as a fundamental right in the 2007 Interim Constitution. The government introduced free basic health care, essential medicines, and reproductive health services, making Nepal an early exemplar of UHC reform despite being a low-income country. These commitments featured prominently in the 2009 elections and were rewarded by voters. This precedent matters: Nepali citizens respond positively when leaders place health security at the centre of their political agenda.\nThe 2024 Chatham House Commission on Universal Health Coverage highlights that many transitions to UHC follow periods of national crisis-economic collapse, conflict or political instability. Such moments create space for bold reform.\nAs Nepal approaches elections this spring, universal health reform once again has the potential to be decisive. A clear path forward would be to guarantee free basic services for all while strengthening social health insurance for secondary and tertiary care, with contributions proportionate to income. Extending free hospital services nationwide-while ensuring quality-would be a bold and highly popular step.\nTo make this sustainable and address the current crisis in insurance payments, Nepal must increase domestic public financing for health. This can be achieved by raising government revenues and increasing the share of the national budget allocated to health from the current 4.9 per cent. Raising the health budget share to 10 per cent, typical for countries at Nepal's income level, would more than double available resources. Dedicated health taxes on alcohol, tobacco, and other harmful products could further fund these commitments.\nSuch reforms are neither unrealistic nor unprecedented. Countries across Asia-including Thailand, Sri Lanka, Indonesia, and China-have increased public health spending by 1-2 per cent of GDP to achieve or deepen universal coverage, with economic, social, and political returns consistently outweighing the costs.\nA new government in Nepal would not be acting alone. It could draw on global expertise through WHO-supported initiatives, academic institutions such as the London School of Economics, and peer learning from countries that have successfully implemented UHC reforms.\nThe political message is clear. Voters want universal health protection, and they reward leaders who deliver it. Smart political leaders should seize this opportunity-to improve the lives of millions through a winning election agenda.\nYates is Visiting Professor in Practice, The London School of Economics, and Dr Maskey is the Executive Chief of Nepal Public Health Foundation",
        "url": "https://thehimalayantimes.com/opinion/universal-health-coverage-the-decisive-election-agenda",
        "scraped_at": "2026-01-31T09:41:08.127736"
    },
    {
        "title": "Parbat exports oranges worth Rs 320 million",
        "tag": null,
        "content": "PARBAT, JANUARY 29\nParbat district exported oranges worth Rs 320 million this year, with Banskharka, the district's major orange-producing pocket area alone contributing Rs 200 million.\nOther areas including Purnagaun, Raatmata, Shalija and Bhotedanda of Mallaj; Deupur, Bajung and Chhiter of Modi Rural Municipality; and Kurgha, Pangrang, Thanamaula and Limithana of Phalebas Municipality also contributed significantly to the exports.\nAccording to the Agricultural Development Office, the district produced 3,421 metric tons of oranges this year, all of which were supplied to markets. Oranges were purchased directly from orchards at prices ranging from Rs 95 to Rs 120 per kg.\nOffice Information Officer Sobita Subedi said orange production in Parbat was good this year and farmers benefited from favorable market prices. Traders from Kathmandu, Narayangadh, Pokhara and other parts of the country reached out to farmers to purchase oranges, facilitated by improved road connectivity in the district. Some farmers even transported their produce to markets as far as Kathmandu and Butwal.\nFarmers said improved road access has made the transportation and supply of oranges much easier. Farmer Ram Prasad Gautam said that a single locality supplied oranges worth between Rs 10 million and Rs 15 million this season.\nIn recent years, province and local governments have introduced various support initiatives for orange farmers. With access to the Mid-Hill Highway, the Kaligandaki Corridor and an expanded network of rural roads, commercial orange farming has grown steadily in the district. More than 400 farmers are now engaged in orange cultivation across 833 hectares of land, particularly in Jaljala Rural Municipality, Phalebas Municipality and Modi Rural Municipality. Farmers' interest in orange farming has been increasing in recent years.",
        "url": "https://thehimalayantimes.com/business/parbat-exports-oranges-worth-rs-320-million",
        "scraped_at": "2026-01-31T09:41:09.921851"
    },
    {
        "title": "Global IME Bank introduces kiosk-based account opening facility",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nGlobal IME Bank Limited has launched a new service that allows customers to open bank accounts directly through a self-service kiosk machine installed at its branch offices, aiming to provide simpler, more convenient, and technologically advanced banking services.\nThe bank introduced the facility on the occasion of its 19th anniversary. Through this service, customers can independently open a bank account using a kiosk machine located at the bank's Kamaladi branch in Kathmandu.\nTo open an account, customers are required to enter all necessary details via the kiosk machine. After submitting the required information and documents, an account number is issued. At present, the service is available only through the bank's Digital Universe at the Kamaladi branch.\nEarlier, the bank had been offering services such as cash deposits and cheque deposits through machines at the same Digital Universe. The bank has stated that it plans to expand such digital services to other locations in the future.\nGlobal IME Bank has received recognition from several reputed national and international institutions across various categories. The bank has been honored with prestigious awards including Bank of the Year 2014, Best Internet Bank 2016, Best Bank Nepal 2024 and 2025, Euromoney Award for Excellence 2022, 2024 and 2025, Best Bank ESG Nepal 2024, and Best Employer, among others.\nThe bank is the first private sector commercial bank in Nepal to establish a branch network across all 77 districts of the country.\nCurrently, Global IME Bank provides services through more than 1,000 service centers, including 352 branch offices, 384 ATMs, 150 branchless banking services, 68 extension and revenue collection counters, and three foreign representative offices.\nThe bank also offers remittance services to Nepali citizens worldwide, facilitating financial transactions from countries such as the United States, United Kingdom, Canada, Australia, Malaysia, South Korea, Japan, Saudi Arabia, Qatar, UAE, Bahrain, Kuwait, India, and Jordan, thereby contributing to Nepal's economic development.",
        "url": "https://thehimalayantimes.com/business/global-ime-bank-introduces-kiosk-based-account-opening-facility",
        "scraped_at": "2026-01-31T09:41:11.581104"
    },
    {
        "title": "Gold price soars Rs 20,500 in single day",
        "tag": null,
        "content": "KATHMANDU, JANUARY 29\nThe price of fine gold surged by a record Rs 20,500 per tola in a single day on Thursday, reaching an all-time high of Rs 339,300 per tola in the domestic market, just a day after posting another sharp gain.\nAccording to the Federation of Nepal Gold and Silver Dealers' Association, fine gold was priced at Rs 318,800 per tola on Wednesday-itself a historic high after surging Rs 9,500 that day.\nThe back-to-back increases represent a combined jump of Rs 30,000 per tola over two days, marking one of the most dramatic price movements in Nepal's gold market in recent memory.\nSilver price also climbed, rising Rs 205 per tola to trade at Rs 7,505 on Thursday, up from Rs 7,300 the previous day, the federation said.\nThe sharp increase in Nepal's gold market reflects volatile surges in precious metal prices on the international market, with no immediate signs of stabilization. The unprecedented price movement has left Nepali consumers facing difficult decisions about whether to delay purchases in hopes of a correction or secure gold at current rates before prices potentially climb further beyond the reach of most buyers.\nThe consecutive daily surges underscore the growing impact of global commodity market fluctuations on domestic consumers, with the precious metal now trading at levels previously unimaginable in the local market.",
        "url": "https://thehimalayantimes.com/business/gold-price-soars-rs-20500-in-single-day",
        "scraped_at": "2026-01-31T09:41:13.348219"
    },
    {
        "title": "Sri Lanka Investment Forum 2026 to be held in Colombo",
        "tag": null,
        "content": "KATHMANDU, JANUARY 28\nThe Board of Investment of Sri Lanka (BOI), in collaboration with the European Union, the Asian Development Bank (ADB) and the United Nations Economic and Social Commission for Asia and the Pacific (ESCAP), is scheduled to organize the Sri Lanka Investment Forum 2026 on March 30, 2026, in Colombo.\nThe forum aims to position Sri Lanka as a competitive and attractive investment destination by bringing together international and domestic investors, development partners and key stakeholders on a high-level platform for engagement and collaboration. Organizers said the event will showcase investment-ready opportunities, priority sectors and policy incentives while promoting strategic partnerships and sustainable, inclusive economic growth.\nThe forum is expected to draw senior corporate and business leaders, business associations and chambers of commerce, the international and domestic investor community, economic policymakers, thought leaders, and representatives from national leadership and line ministries.\nDiscussions will focus on key sector themes, including services such as logistics, education and information technology; sustainable manufacturing; tourism, with emphasis on marinas, theme parks and nautical tourism; and infrastructure and utilities, including IT parks, industrial zones, energy and mixed-use developments.\nThe programme will feature interactive engagements such as fireside chats with investors and policymakers, curated networking sessions, and deal-matching and B2B connect meetings.\nA High-Level Investor–Sri Lanka Dialogue, hosted by the EU Delegation and BOI, will also be held alongside the forum. The dialogue will bring together European investors, chambers of commerce and senior Sri Lankan officials to discuss investment opportunities, policy incentives and partnerships supporting sustainable and inclusive growth in the country.",
        "url": "https://thehimalayantimes.com/business/sri-lanka-investment-forum-2026-to-be-held-in-colombo",
        "scraped_at": "2026-01-31T09:41:15.085957"
    },
    {
        "title": "Passang Nuru Sherpa, author of 'Behind the Mask', honoured in Ilam",
        "tag": null,
        "content": "KATHMANDU, JANUARY 28\nRenowned Nepali-American writer Passang Nuru Sherpa has been honoured by the Federal Executive Committee of the Nepal Sherpa Association in recognition of his growing international literary achievements, including winning a prestigious book award in the United States.\nAt a special ceremony held in Ilam, the Association presented an honour certificate acknowledging Sherpa's contribution to literature and his role in bringing the Sherpa community and Nepali narratives to a global audience. Born in Solukhumbu and currently based in the United States, Sherpa was unable to attend the event in person. The certificate was received on his behalf by his elder sister Lakpa Phuti Sherpa, recognised as Nepal's first Sherpa writer.\nSherpa won the Best Book Award 2025 for his memoir Behind the Mask: A Pandemic Memoir at the 22nd edition of the American Book Fest Awards, one of the world's largest international book award programmes. His work was selected as outstanding among mainstream, independent and self-published titles.\nWhile presenting the honour, Lakpa Thinley Sherpa, President of the Association's Federal Executive Committee, said Sherpa's creative work has elevated the pride of the Sherpa community and contributed significantly to the international recognition of Nepali literature. He also highlighted Sherpa's earlier memoir-based book Corona Katha, which portrays American life, Nepali society and social realities in the aftermath of the COVID-19 pandemic, noting that it too has received major international recognition.\nThe honour comes amid growing global acclaim for Behind the Mask. The memoir has received a highly regarded review from Kirkus Reviews, one of the world's most influential authorities in professional book criticism, established in 1933. Kirkus praised the work for its intimate storytelling, emotional depth and authentic depiction of resilience within immigrant communities during the COVID-19 pandemic.\nSet in Jackson Heights, New York-one of the areas hardest hit during the pandemic-the book is based on Sherpa's personal diary entries. It chronicles daily life during lockdowns, capturing fear, uncertainty and solidarity within the Nepali diaspora. Drawing from his experiences as a barber and salon owner, Sherpa documents community conversations, shortages of essential supplies, psychological isolation and grassroots relief efforts.\nThe English edition of the memoir was translated from Nepali by Mahesh Paudyal and Peter Gill. Kirkus described the book as \"an intimate, heartfelt portrait of one New York City community's struggles and resilience,\" noting its reflections on Nepali culture, migration and collective compassion.\nAccording to Lakpa G. Sherpa, General Secretary of the Nepal Sherpa Association, the organisation expressed gratitude for the author's continued creativity, his deep connection to Nepali society and the Sherpa community, and his spirit of tolerance, while wishing him greater success in the future.\nBeyond his literary work, Passang Nuru Sherpa is also known for his community service during the pandemic, when he helped deliver food, medicines and essential supplies to vulnerable residents in Jackson Heights. His memoir reflects these frontline experiences, presenting a collective community narrative rather than a single personal account.",
        "url": "https://thehimalayantimes.com/lifestyle/passang-nuru-sherpa-author-of-behind-the-mask-honoured-in-ilam",
        "scraped_at": "2026-01-31T09:41:16.826284"
    },
    {
        "title": "Toastmasters Leadership Institute 2026: Building stronger clubs-and stronger organizations-through leadership and membership excellence",
        "tag": null,
        "content": "The Toastmasters Leadership Institute (TLI), organized by Division A and Division B of Toastmasters District 41, was successfully conducted on January 17, 2026, at Sanskriti International School, Kathmandu. The program brought together the spirit of leadership, learning, and collaboration. With over 100 Toastmasters members in attendance, it became one of the most impactful and resplendent leadership training events of the season in Nepal.\nTLI is one of the core training platforms in Toastmasters. While it is designed primarily to equip club officers and members with the knowledge, skills, and mindset needed to lead Toastmasters clubs more effectively, the principles explored during TLI extend far beyond club leadership. The competencies developed-such as goal setting, team management, communication, accountability, and stakeholder engagement-are equally relevant in organizational leadership contexts across government, private sector, and development organizations.\nThis edition of TLI reflected that broader relevance, with a strong focus on practical leadership, systems thinking, people management, and long-term growth-areas that resonate with anyone holding leadership or coordination responsibilities in professional settings.\n\n\nThe training included dedicated sessions for each club officer role, facilitated by experienced and committed Toastmasters leaders. The trainers for the respective roles were:\nPresident Trainer: Vaishali Pradhan\nVice President Education Trainer: Grishma Shrestha\nVice President Membership Trainer: Susan Dangol\nVice President Public Relations Trainer: Amod Niraula\nSecretary Trainer: Prajwol Tamrakar 'Nepal'\nTreasurer Trainer: Rajan Maharjan\nSergeant at Arms Trainer: Kajol Jha\nIn addition, special sessions were conducted by Toastmasters Nirajan Shrestha and Anuj Shrestha on Awards and DCP (Distinguished Club Program) Goals and the Dashboard respectively. These sessions emphasized performance tracking, goal alignment, and data-informed decision-making-skills that are increasingly critical in modern organizations as well.\n\n\nEach session was interactive and practical in nature. Participants gained a clearer understanding of their roles, learned best practices, and shared real-life experiences from their own clubs. This peer-learning environment mirrored the dynamics of effective workplaces, where learning happens not only through formal training but also through shared reflection and collaboration.\nOne of the major highlights of the program was the Membership Building session conducted by Distinguished Toastmaster Ranjit Acharya. His session focused on how clubs can increase membership while simultaneously building stronger and more sustainable systems. The ideas presented had strong parallels with organizational growth and team-building strategies, emphasizing mindset, visibility, engagement, and relationship management.\nUsing practical frameworks and relatable examples, he spoke about creating visibility through social media, strengthening public relations, enhancing guest and stakeholder engagement, and establishing effective follow-up systems. He also highlighted approaches such as showcasing member achievements, organizing open-to-guest meetings, leveraging word-of-mouth referrals, and building partnerships with corporate, community, and institutional platforms. These strategies resonated deeply with participants, as they reflected challenges commonly faced by teams and organizations seeking growth and relevance.\nThe venue, Sanskriti International School, provided a resplendent learning environment that supported discussions, networking, and engagement throughout the day. The energy in the hall reflected the shared commitment of Toastmasters in Nepal to grow together-not only as club leaders but also as professionals striving to lead better in their respective organizations.\n\n\nOverall, TLI 2026 organized by Division A and Division B served as a strong reminder that effective leadership-whether in a Toastmasters club or an organization-is built on prepared leaders, clear systems, and a growth-focused mindset. The program not only trained club officers but also empowered participants with leadership insights applicable to their workplaces and communities.\nContinuing this momentum, the next Toastmasters Leadership Institute organized by Division C and Division D is scheduled for January 31, 2026. The Toastmasters community is equally excited and eagerly looking forward to this upcoming program.\nAs Toastmasters in Nepal continue their journey of communication and leadership excellence, programs like TLI play a vital role in shaping leaders who create impact-not only within their clubs, but also across organizations, institutions, and society at large.",
        "url": "https://thehimalayantimes.com/lifestyle/toastmasters-leadership-institute-2026-building-stronger-clubs-and-stronger-organizations-through-leadership-and-membership-excellence",
        "scraped_at": "2026-01-31T09:41:18.468931"
    },
    {
        "title": "My Peace Corps experience",
        "tag": null,
        "content": "Being born in Nepal and moving to the United States at the age of five, my parents never allowed me to forget our culture, heritage, or motherland. From a young age, they taught me that helping others and giving back as much as possible is the best way to live life-a lesson that continues to guide me today. Yo maan ta mero Nepali ho-six simple words meaning \"My heart is Nepali\"-captures my enduring love for Nepal. Even as a child, I carried a deep desire to one day return and create a meaningful impact in the country where my life began.\nAfter moving to the United States, my family first lived in Maryland for about a year and a half. While there was a Nepali community, my involvement was limited due to my young age. Eventually, we moved to North Carolina, where we were warmly welcomed into a close-knit Nepali community. The Nepal Center of North Carolina (NCNC) became my first real experience of what it meant to belong to a community built on shared identity, service, and care for one another.\nSoon after settling in North Carolina, I began volunteering at NCNC. My family and I attended nearly every event, and I helped wherever I could-setting up, breaking down, and assisting with whatever was needed. Over time, I built deep connections within the community and met people who would profoundly influence my life. It was through NCNC that I was first introduced to the Peace Corps. A respected community member, who had served as a Peace Corps volunteer in Nepal during the 1980s, shared stories of his time working in Nepali villages. I listened with fascination. Every conversation planted a seed, and Peace Corps slowly became something I saw not just as an opportunity, but as a calling.\nWhile in high school, I started my own electronics repair business from home, focusing on computers, laptops, and mobile phones. Through hands-on experience, I developed strong troubleshooting skills and learned both hardware and software systems. As my business grew, I began purchasing broken devices, repairing them, and reselling them. More than just technical skills, this experience taught me patience, problem-solving, and how to work independently-skills I now use daily in my service in Nepal.\nAfter graduating from Lenoir-Rhyne University in 2022, I worked as a Technical Support Specialist and later as a Software Engineer.\nAlthough these roles were professionally rewarding, I felt something was missing. I wanted to do work that felt meaningful. I wanted to do work that directly impacted people's lives. That longing brought me back to Peace Corps and to the idea of returning to Nepal, not as a visitor, but as a volunteer.\nInitially, I explored English Education opportunities but later learned about a Peace Corps Response position as a Digital Learning Trainer, which is a six-month assignment focused on teaching computer science and repairing computers. This role perfectly aligned with my skills and my desire to serve. In November 2024, while visiting Nepal for my cousin's wedding, I met with Peace Corps Nepal staff and the Country Director to learn more. After this, I submitted my application. In April 2025, I received the news that I had been accepted.\nIt was a moment of overwhelming joy. Serving in Nepal through Peace Corps was not just a dream fulfilled-it felt like destiny.\nI arrived in Nepal in May 2025 as part of Nepal Response 2, alongside seven other volunteers. After two weeks of technical, medical, and language training, we were placed across different districts. I was assigned to the Kaski District, where I now work at a government school. Each day begins with morning assembly, followed by teaching or co-teaching computer classes for grades five, eight, nine, and ten.\nMy teaching varies by grade level. Fifth graders learn the basics-what a computer is and what its parts do. Eighth graders go deeper, studying the history of computers, Microsoft Office, introductory HTML, and QBASIC. Ninth grade begins with fundamentals before moving into block programming, web technologies, internet and social media, cybersecurity, and more advanced HTML. Tenth grade brings everything together: networking, ethics, computer security, contemporary technologies, number systems, database management systems, modular programming, C programming, and QBASIC. Most days are long but incredibly fulfilling.\nOne experience that deeply impacted me emotionally was our school's pen pal program. The goal was simple: help students practice reading and writing English by exchanging letters with students in the United States. However, I quickly realized how difficult this was for many of my students. Even letters written in basic English were hard for them to understand. When my students replied, many letters looked the same-one student would write, and the rest would copy. This moment made me realize just how challenging English is for them, and how much support they truly need. It also showed me the limits of what I can do within a short time frame, which has been humbling and emotionally difficult.\nAs my service progressed, it became clear to me that six months was simply not enough time to create the kind of sustainable impact this community deserved. Meaningful change-especially in education and technology-requires trust, consistency, and time. While I was able to make progress in the classroom and improve the school's computer labs, I realized that real growth happens gradually.\nStudents need repeated exposure, teachers need long-term support, and systems need time to take root. With that understanding, I made the decision to extend my Peace Corps service from six months to a full 27 months. This decision was not easy, especially knowing it meant spending more time away from my family, but it felt necessary. Extending my service was my way of committing more deeply-to the students, the school, and the community that had welcomed me so warmly. I wanted to ensure that the work I started would continue to grow long after my service ends.\nOne of the hardest parts of my service has been being away from my parents. I had never gone more than a month without seeing them before coming to Nepal, and the distance has been challenging. We talk every day, which helps, but the separation has taught me independence and emotional resilience.\nI live with a host family, and living in the community has been one of the most transformative parts of my service. Life here is simple, but deeply connected. Everyone knows everyone. People genuinely care for one another. This level of community integration is something I had never experienced before, even during short visits to Nepal.\nServing in Nepal as someone born here but raised in the United States has been both an honor and a challenge. Many people treat me differently than they would an American volunteer. Some welcome me warmly, appreciating that I returned to serve. Others question why I am here at all. Through this experience, I've learned that my identity is not just my own-it belongs to the community as well. This has reshaped how I understand what it means to be Nepali.\nOne tangible impact of my service has been improving the school's computer labs. During the Ashad break, my counterpart teachers and I worked to repair computers, replace parts, and restore functionality. Today, most of our computers are working, with only about fourteen non-functional machines remaining. For me, success means having two fully functional computer labs that can serve students long after my service ends.\nBy the end of my service, I hope the community clearly sees the value of having a volunteer-not just in terms of technical skills, but in presence, collaboration, and support. This experience has strongly shaped my future goals. I aspire to become a Foreign Service Officer, continuing to work with Nepal and representing communities like the one I now serve.\nTo the Nepal Center of North Carolina, I offer my deepest gratitude. Thank you for shaping me into someone who believes in service and community. Without NCNC, I may never have found the motivation to return to Nepal and serve. The NCNC community played a critical role in guiding me toward this path, and I know I made the right decision.\nTo young Nepali-Americans, I encourage you to experience service firsthand. We are incredibly privileged to grow up in the United States, surrounded by resources and opportunities. But to truly understand Nepal-to understand daily life, challenges, and resilience-you must live it, not just visit it. Only through prolonged engagement can you fully appreciate what it means to give back.\nPeace Corps has allowed me to reconnect with my roots in a way that is humbling and transformative. Giving back is not a single act-it is a lifelong commitment. One that began with my parents' teachings, was nurtured by the Nepali community in North Carolina, and now continues here, in Nepal, where my heart has always belonged.\nDulal served as Peace Corps Response Volunteer",
        "url": "https://thehimalayantimes.com/lifestyle/my-peace-corps-experience",
        "scraped_at": "2026-01-31T09:41:20.176642"
    },
    {
        "title": "Malisa Acharya wins 'Face of SY 2082 (Brand Ambassador Hunt)'",
        "tag": null,
        "content": "KATHMANDU, JANUARY 18\nMalisa Acharya has won the 'Face of SY 2082 (Brand Ambassador Hunt)', a competition organised by SY Entertainment Pvt Ltd.\nAccording to the organiser, prizes worth more than Rs 2 crore were distributed during the grand finale held on Friday at Everest Hotel, Baneshwor, Kathmandu.\nOrganised to promote the brands SY Panel, SY Cosmetic, SY Bazaar and SY UPVC, the competition is described as Nepal's first large-scale brand ambassador hunt. Speaking at the event, Bimal Raj Gosai, Director of SY Panel Nepal, said that the prize amount of the competition was higher than that of Nepal's Miss Nepal pageant.\nThree main brand ambassadors were selected during the programme. Title winner Malisa Acharya received Rs 5 lakh in cash along with a one-year contract worth Rs 1 crore. Sara Lama was declared the first runner-up, while Api Yonjan secured the second runner-up position. They received Rs 4 lakh and Rs 3 lakh in cash respectively, along with contracts worth Rs 50 lakh and Rs 30 lakh. The remaining seven finalists were awarded Rs 1.5 lakh each as Popularity Awards.\nThe competition was conducted in phases. In the first phase, participants took part in a digital audition by creating videos based on the SY theme. From there, 500 participants advanced to the second phase, after which 25 contestants were selected for the final audition. In the final phase, participants were evaluated based on social networking engagement and judges' assessment.\nBoth male and female contestants were eligible to participate. Participants were required to follow the Facebook, Instagram and TikTok pages of SY Bazaar and SY Cosmetic and create creative videos.\nThe organiser, SY Group of Companies, is a South Korea–based multinational company, with subsidiaries including SY Panel Nepal, SY Bazaar and SY Enterprises operating in Nepal.",
        "url": "https://thehimalayantimes.com/lifestyle/malisa-acharya-wins-face-of-sy-2082-brand-ambassador-hunt",
        "scraped_at": "2026-01-31T09:41:22.028913"
    },
    {
        "title": "NASA astronaut who was stuck at the space station for months retires within a year of returning",
        "tag": null,
        "content": "CAPE CANAVERAL, JANUARY 21\nNASA's Suni Williams - one of two astronauts stuck for months at the International Space Station - has retired.\nThe space agency announced the news Tuesday, saying her retirement took effect at the end of December.\nWilliams' crewmate on Boeing's ill-fated capsule test flight, Butch Wilmore, left NASA last summer.\nThe pair launched to the space station in 2024, the first people to fly Boeing's new Starliner crew capsule. Their mission should have lasted just a week, but stretched to more than nine months because of Starliner trouble. In the end, they caught a ride home last March with SpaceX.\nBoeing's next Starliner mission will carry cargo - not people - to the space station. NASA wants to make sure all of the capsule's thruster and other issues are solved before putting anyone on board. The trial run will take place later this year.\nWilliams, 60, a former Navy captain, spent more than 27 years at NASA, logging 608 days in space over three station missions. She also set a record for the most spacewalking time by a woman: 62 hours during nine excursions.\nNASA's new administrator Jared Isaacman called her \"a trailblazer in human spaceflight.\"\n\"Congratulations on your well-deserved retirement,\" he added in a statement.",
        "url": "https://thehimalayantimes.com/school-times/nasa-astronaut-who-was-stuck-at-the-space-station-for-months-retires-within-a-year-of-returning",
        "scraped_at": "2026-01-31T09:41:23.746984"
    },
    {
        "title": "Nepal's NAST ranks 3rd in digital innovation among 45 nations",
        "tag": null,
        "content": "KATHMANDU, JANUARY 19\nNepal Academy of Science and Technology (NAST) has secured third place in an international video competition organized by South Korea's National Information Society Agency (NIA).\nThe competition featured programs from 60 information access centers across 45 countries, with 30 videos submitted from various nations.\nAccording to NAST's Senior Scientific Officer Pawan Kumar Neupane, under the Official Development Assistance (ODA) program, the Government of the Republic of Korea established Information Access Centres (IACs) at NAST in 2021. Each video, ranging from three to five minutes in length, was required to showcase a success story, inspiring moments, impactful content, and optimal utilization of the program, in line with the competition guidelines.\nNeupane added that the primary objective of the collaboration between the two countries is to reduce Nepal's digital divide and contribute to the overall development of the information technology sector.\n\n\n\"In our three-and-a-half-minute video, we incorporated the voices of participants from theMobile IAC-'Centre on Wheels'-across seven provinces, which delivered free IT education to school teachers and security personnel. We also highlighted visually impaired individuals who were provided with advanced assistive devices and trained to identify banknotes and navigate directions,\" Neupane shared.\nAccording to Neupane, Mongolia secured first place, followed by Colombia in second, and Nepal in third, earning a prize of USD 1,000. He added that the prize money will be used to further enhance research and innovation at the center.\nSpeaking to THT, Pradeep Dhodari, Coordinator at the IAC under NAST, said, \"This is not only NAST's achievement but also a matter of national pride. Despite limited resources compared to the advanced technology and skilled manpower of developed nations, NAST's third-place ranking is a remarkable accomplishment.\"\nSince its inception, more than 12,000 people have received free, high-quality information and computer technology training through these facilities across seven provinces.\n\n\n\"We have been regularly organizing specialized training sessions to help visually impaired individuals leverage technology for a better quality of life, while advocating for the nationwide expansion of these inclusive programs,\" Dhodari added.\nHe further stated, \"This recognition is not just an achievement for NAST, but a proud moment for the nation, demonstrating that with strategic partnerships and local dedication, Nepal can compete on the world stage.\"\nThe award-winning video was conceived and scripted by Pawan Kumar Neupane, edited by Om Baral, and produced by NAST's Information Access Centre (IAC).\nAll the pictures captured during IAC training were provided by NAST.\n\n\n\n\n\n\n\n",
        "url": "https://thehimalayantimes.com/science-and-tech/nepals-nast-ranks-3rd-in-digital-innovation-among-45-nations",
        "scraped_at": "2026-01-31T09:41:25.584780"
    },
    {
        "title": "Social media platforms removed 4.7 million accounts after Australia banned them for children",
        "tag": null,
        "content": "WELLINGTON,JANUARY 16\nSocial media companies have revoked access to about 4.7 million accounts identified as belonging to children in Australia since the country banned use of the platforms by those under 16, officials said.\n\"We stared down everybody who said it couldn't be done, some of the most powerful and rich companies in the world and their supporters,\" communications minister Anika Wells told reporters on Friday. \"Now Australian parents can be confident that their kids can have their childhoods back.\"\nThe figures, reported to Australia's government by 10 social media platforms, were the first to show the scale of the landmark ban since it was enacted in December over fears about the effects of harmful online environments on young people. The law provoked fraught debates in Australia about technology use, privacy, child safety and mental health and has prompted other countries to consider similar measures.\nOfficials said the figure was encouraging\nUnder Australian law, Facebook, Instagram, Kick, Reddit, Snapchat, Threads, TikTok, X, YouTube and Twitch face fines of up to 49.5 million Australian dollars ($33.2 million) if they fail to take reasonable steps to remove the accounts of Australian children younger than 16. Messaging services such as WhatsApp and Facebook Messenger are exempt.\nTo verify age, platforms can either request copies of identification documents, use a third party to apply age estimation technology to an account holder's face, or make inferences from data already available such has how long an account has been held.\nAbout 2.5 million Australians are aged between 8 and 15, said the country's eSafety Commissioner Julie Inman Grant, and past estimates suggested 84% of 8- to 12-year-olds held social media accounts. It was not known how many accounts were held across the 10 platforms but Inman Grant said the figure of 4.7 million \"deactivated or restricted\" was encouraging.\n\"We're preventing predatory social media companies from accessing our children,\" Inman Grant said.\nThe 10 biggest companies covered by the ban were compliant with it and had reported removal figures to Australia's regulator on time, the commissioner said. She added that social media companies were expected to shift their efforts from enforcing the ban to preventing children from creating new accounts or otherwise circumventing the prohibition.\nMeta removed 550,000 accounts\nAustralian officials didn't break the figures down by platform. But Meta, which owns Facebook, Instagram and Threads, said this week that by the day after the ban came into effect it had removed nearly 550,000 accounts belonging to users understood to be under 16.\nIn the blog post divulging the figures, Meta criticized the ban and said smaller platforms where the ban doesn't apply might not prioritize safety. The company also noted browsing platforms would still present content to children based on algorithms - a concern that led to the ban's enactment.\nThe law was widely popular among parents and child safety campaigners. Online privacy advocates and some groups representing teenagers opposed it, with the latter citing the support found in online spaces by vulnerable young people or those geographically isolated in Australia's sprawling rural areas.\nSome said they had managed to fool age assessing technologies or were helped by parents or older siblings to circumvent the ban.\nOther countries might follow\nSince Australia began debating the measures in 2024, other countries have considered following suit. Denmark's government is among them, saying in November that it had planned to implement a social media ban for children under 15.\n\"The fact that in spite of some skepticism out there, it's working and being replicated now around the world, is something that is a source of Australian pride,\" Prime Minister Anthony Albanese said Friday.\nOpposition lawmakers have suggested that young people have circumvented the ban easily or are migrating to other apps that are less scrutinized than the largest platforms. Inman Grant said Friday that data seen by her office showed a spike in downloads of alternative apps when the ban was enacted but not a spike in usage.\n\"There is no real long-term trends yet that we can say but we're engaging,\" she said.\nMeanwhile, she said, the regulator she heads planned to introduce \"world-leading AI companion and chatbot restrictions in March.\" She didn't disclose further details.",
        "url": "https://thehimalayantimes.com/science-and-tech/social-media-platforms-removed-47-million-accounts-after-australia-banned-them-for-children",
        "scraped_at": "2026-01-31T09:41:27.249535"
    },
    {
        "title": "NASA sends 4 astronauts back to Earth in first medical evacuation",
        "tag": null,
        "content": "CAPE CANAVERAL, JANUARY 15\nAn astronaut in need of doctors' care departed the International Space Station with three crewmates on Wednesday in NASA's first medical evacuation.\nThe four returning astronauts - from the U.S., Russia and Japan - are aiming for an early Thursday morning splashdown in the Pacific near San Diego with SpaceX. The decision cuts short their mission by over a month.\n\"Our timing of this departure is unexpected,\" NASA astronaut Zena Cardman said before the return trip, \"but what was not surprising to me was how well this crew came together as a family to help each other and just take care of each other.\"\nOfficials refused to identify the astronaut who needed care last week and would not divulge the health concerns.\nThe ailing astronaut is \"stable, safe and well cared for,\" outgoing space station commander Mike Fincke said earlier this week via social media. \"This was a deliberate decision to allow the right medical evaluations to happen on the ground, where the full range of diagnostic capability exists.\"\nLaunched in August, Cardman, Fincke, Japan's Kimiya Yui and Russia's Oleg Platonov should have remained on the space station until late February. But on Jan. 7, NASA abruptly canceled the next day's spacewalk by Cardman and Fincke and later announced the crew's early return. Officials said the health problem was unrelated to spacewalk preparations or other station operations, but offered no other details, citing medical privacy. They stressed it was not an emergency situation.\nNASA said it would stick to the same entry and splashdown procedures at flight's end, with the usual assortment of medical experts aboard the recovery ship in the Pacific. It was another middle-of-the-night crew return for SpaceX, coming less than 11 hours after undocking from the space station. NASA said it was not yet known how quickly all four would be flown from California to Houston, home to Johnson Space Center and the base for astronauts.\nOne U.S. and two Russian astronauts remain aboard the orbiting lab, just 1 1/2 months into an eight-month mission that began with a Soyuz rocket liftoff from Kazakhstan. NASA and SpaceX are working to move up the launch of a fresh four-person crew from Florida, currently targeted for mid-February.\nComputer modeling predicted a medical evacuation from the space station every three years, but NASA hasn't had one in its 65 years of human spaceflight. The Russians have not been as fortunate. In 1985, Soviet cosmonaut Vladimir Vasyutin came down with a serious infection or related illness aboard his country's Salyut 7 space station, prompting an early return. A few other Soviet cosmonauts encountered less serious health issues that shortened their flights.\nIt was the first spaceflight for Cardman, 38, biologist and polar explorer who missed out on spacewalking, as well as Platonov, 39, a former fighter pilot with the Russian air force who had to wait a few extra years to get to space because of an undisclosed health issue. Cardman should have launched last year but was bumped to make room on the way down for NASA's Butch Wilmore and Suni Williams, who were stuck nearly a year at the space station because of Boeing's capsule problems.\nFincke, 58, a retired Air Force colonel, and Yui, 55, a retired fighter pilot with the Japan Air Self-Defense Force, were repeat space fliers. Finke has spent 1 1/2 years in orbit over four missions and conducted nine spacewalks on previous flights, making him one of NASA's top performers. Last week, Yui celebrated his 300th day in space over two station stays, sharing stunning views of Earth, including Japan's Mount Fuji and breathtaking auroras.\n\"I want to burn it firmly into my eyes, and even more so, into my heart,\" Yui said on the social platform X. \"Soon, I too will become one of those small lights on the ground.\"\nNASA officials had said it was riskier to leave the astronaut in space without proper medical attention for another month than to temporarily reduce the size of the space station crew by more than half. Until SpaceX delivers another crew, NASA said it will have to stand down from any routine or even emergency spacewalks, a two-person job requiring backup help from crew inside the orbiting complex.\nThe medical evacuation was the first major decision by NASA's new administrator Jared Isaacman. The billionaire founder of a payment processing company and two-time space flier assumed the agency's top job in December.\n\"The health and the well-being of our astronauts is always and will be our highest priority,\" Isaacman said in announcing the decision last week.",
        "url": "https://thehimalayantimes.com/science-and-tech/nasa-sends-4-astronauts-back-to-earth-in-first-medical-evacuation",
        "scraped_at": "2026-01-31T09:41:28.959390"
    }
]